{"Select the [passive voice verb]() in the sentence below.": {"Jonathan Joestar's colorful collage will be displayed in the lunchroom.": "will be displayed", "Nico Minoru's novel about a werewolf has been read all over the world.": "has been read", "Archie Andrews's broken glasses will be fixed by the magician.": "will be fixed", "The guests are being entertained by Gertrude Yorkes's talking robot.": "are being entertained", "The cake with gold sparkles has been baked for Chase Stein.": "has been baked", "My sketches are being displayed at Seth Acosta's gallery for a week.": "are being displayed", "Paxton Hall-Yoshida's novel about a werewolf has been read all over the world.": "has been read", "Goats are groomed on the farm near Dre Johnson’s house.": "are groomed", "The books in the library are being eaten by the caterpillars from Trent Harrison's garden.": "are being eaten", "The best hamburgers in the city are cooked at Karolina Dean's diner on Main Street.": "are cooked", "Tomorrow morning, Ben Gross's bubble gum statue will be mailed to the White House.": "will be mailed", "On Wednesday, an award will be given to Lucy Hernandez by the dance team.": "will be given", "Tomorrow, the award will be presented to Veronica Lodge by the principal.": "will be presented", "Vivian Carter's surfboard is being painted with colorful patterns.": "is being painted", "On Wednesday, an award will be given to Rainbow Johnson by the dance team.": "will be given", "Dio Brando's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Next week, the best hula dancer will be awarded a slice of Kamala Nandiwadal’s famous apple pie.": "will be awarded", "Tomorrow, the award will be presented to Pops Johnson by the principal.": "will be presented", "Joseph Joestar was offered a game of Connect Four to play in the car.": "was offered", "The best doodles were found on Jughead Jones’s dinner napkins.": "were found", "All Diane Johnson's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Eleanor Wong's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Molly Hayes Hernandez's comedy routine will be remembered for many years.": "will be remembered", "Two summers ago, Nalini Vishwakumar was sent to the art fair to show her beautiful painting.": "was sent", "Mitchell Wilson's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Jack Johnson’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "During the summer, Devi Vishwakumar's ant farm is guarded by my neighbors.": "is guarded", "Once a month, my youth football team is coached by Josuke Higashikata.": "is coached", "Elephants were ridden at Jotaro Kujo's circus-themed party.": "were ridden", "Alex Wilder’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Next week, those banners will be hung for Fabiola Torres's graduation.": "will be hung", "Every morning, the Zumba class is taught by Cheryl Blossom.": "is taught", "We were directed to Kaitlynn Price’s house by the flashing neon signs.": "were directed", "Every rehearsal, the ballerinas are chased across the stage by Archie Andrews's little brother.": "are chased", "Ceramic bowls were sculpted on Diane Johnson's pottery wheel.": "were sculpted", "A balloon and a juice box have been offered by Trent Harrison's baby cousin.": "have been offered", "Eleanor Wong's famous crepes are made with fresh strawberries.": "are made", "Jotaro Kujo was offered a game of Connect Four to play in the car.": "was offered", "Gertrude Yorkes will be invited to this event by the secret juggling society.": "will be invited", "Just a few moments ago, the fuzzy tarantula was adopted by Vivian Carter.": "was adopted", "The cake with gold sparkles has been baked for Pops Johnson.": "has been baked", "Last Thursday, the polka class was taught in Devi Vishwakumar's studio.": "was taught", "At this very moment, my costume for the show is being designed by Joseph Joestar.": "is being designed", "Karolina Dean's movie about a flying robot was praised by the film critic.": "was praised", "According to Dre Johnson, extra juice boxes are kept behind our teacher's desk.": "are kept", "Last semester, the lead role in the musical was played by Jonathan Joestar.": "was played", "Josuke Higashikata was handed a key to open the buried treasure.": "was handed", "The marshmallows have been toasted to perfection by Rainbow Johnson and me.": "have been toasted", "Kaitlynn Price's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Two summers ago, Chase Stein was sent to the art fair to show his beautiful painting.": "was sent", "Next week, those banners will be hung for Trent Harrison's graduation.": "will be hung", "Paxton Hall-Yoshida will be invited to this event by the secret juggling society.": "will be invited", "At this very moment, my costume for the show is being designed by Dre Johnson.": "is being designed", "Gertrude Yorkes's broken glasses will be fixed by the magician.": "will be fixed", "Chase Stein will be invited to this event by the secret juggling society.": "will be invited", "Goats are groomed on the farm near Cheryl Blossom’s house.": "are groomed", "Tomorrow, the award will be presented to Jonathan Joestar by the principal.": "will be presented", "Two summers ago, Josuke Higashikata was sent to the art fair to show his beautiful painting.": "was sent", "Right now, my finger paints are being used by Diane Johnson and her cousins.": "are being used", "Archie Andrews's movie about a flying robot was praised by the film critic.": "was praised", "All Mitchell Wilson's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "My sketches are being displayed at Alex Wilder's gallery for a week.": "are being displayed", "Next week, the best hula dancer will be awarded a slice of Pops Johnson’s famous apple pie.": "will be awarded", "Nico Minoru was handed a key to open the buried treasure.": "was handed", "The best doodles were found on Molly Hayes Hernandez’s dinner napkins.": "were found", "Every morning, the Zumba class is taught by Joseph Joestar.": "is taught", "Nalini Vishwakumar's CDs were played during the dance party.": "were played", "Every rehearsal, the ballerinas are chased across the stage by Rainbow Johnson's little brother.": "are chased", "Kamala Nandiwadal's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Once a month, my youth football team is coached by Jack Johnson.": "is coached", "A balloon and a juice box have been offered by Vivian Carter's baby cousin.": "have been offered", "Kaitlynn Price's famous crepes are made with fresh strawberries.": "are made", "The marshmallows have been toasted to perfection by Lucy Hernandez and me.": "have been toasted", "Karolina Dean's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Fabiola Torres was handed a key to open the buried treasure.": "was handed", "Ben Gross's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "A balloon and a juice box have been offered by Veronica Lodge's baby cousin.": "have been offered", "Seth Acosta's novel about a werewolf has been read all over the world.": "has been read", "Eleanor Wong's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "The balloon was tied to Jughead Jones's wrist by the clown.": "was tied", "The books in the library are being eaten by the caterpillars from Jotaro Kujo's garden.": "are being eaten", "Dio Brando's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "We were directed to Devi Vishwakumar’s house by the flashing neon signs.": "were directed", "After every storm, mud pies are made in Cheryl Blossom's yard.": "are made", "The best hamburgers in the city are cooked at Diane Johnson's diner on Main Street.": "are cooked", "On Sunday, Eleanor Wong's plastic watches will be sold at the craft fair.": "will be sold", "On Wednesday, an award will be given to Trent Harrison by the dance team.": "will be given", "Last semester, the lead role in the musical was played by Kaitlynn Price.": "was played", "According to Mitchell Wilson, extra juice boxes are kept behind our teacher's desk.": "are kept", "Seth Acosta was offered a game of Connect Four to play in the car.": "was offered", "Last Thursday, the polka class was taught in Kamala Nandiwadal's studio.": "was taught", "Our monthly crafts club is organized by Chase Stein.": "is organized", "The cake with gold sparkles has been baked for Molly Hayes Hernandez.": "has been baked", "Dre Johnson's surfboard is being painted with colorful patterns.": "is being painted", "The marshmallows have been toasted to perfection by Devi Vishwakumar and me.": "have been toasted", "During the summer, Nico Minoru's ant farm is guarded by my neighbors.": "is guarded", "Joseph Joestar’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Tomorrow morning, Nalini Vishwakumar's bubble gum statue will be mailed to the White House.": "will be mailed", "Next week, those banners will be hung for Alex Wilder's graduation.": "will be hung", "Trent Harrison's colorful collage will be displayed in the lunchroom.": "will be displayed", "Rainbow Johnson’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Goats are groomed on the farm near Eleanor Wong’s house.": "are groomed", "Mitchell Wilson's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "On Wednesday, an award will be given to Jonathan Joestar by the dance team.": "will be given", "Gertrude Yorkes's novel about a werewolf has been read all over the world.": "has been read", "Vivian Carter was offered a game of Connect Four to play in the car.": "was offered", "Chase Stein’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "According to Karolina Dean, extra juice boxes are kept behind our teacher's desk.": "are kept", "Jughead Jones's comedy routine will be remembered for many years.": "will be remembered", "Tomorrow, the award will be presented to Dio Brando by the principal.": "will be presented", "Two summers ago, Archie Andrews was sent to the art fair to show his beautiful painting.": "was sent", "Ceramic bowls were sculpted on Paxton Hall-Yoshida's pottery wheel.": "were sculpted", "Elephants were ridden at Kaitlynn Price's circus-themed party.": "were ridden", "Right now, my finger paints are being used by Pops Johnson and his cousins.": "are being used", "Once a month, my youth football team is coached by Molly Hayes Hernandez.": "is coached", "After every storm, mud pies are made in Joseph Joestar's yard.": "are made", "The balloon was tied to Josuke Higashikata's wrist by the clown.": "was tied", "Cheryl Blossom was handed a key to open the buried treasure.": "was handed", "Tomorrow, the award will be presented to Dre Johnson by the principal.": "will be presented", "Jack Johnson's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "All Lucy Hernandez's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Every morning, the Zumba class is taught by Fabiola Torres.": "is taught", "Last Thursday, the polka class was taught in Nalini Vishwakumar's studio.": "was taught", "Ben Gross's surfboard is being painted with colorful patterns.": "is being painted", "Veronica Lodge's broken glasses will be fixed by the magician.": "will be fixed", "At this very moment, my costume for the show is being designed by Nico Minoru.": "is being designed", "The cake with gold sparkles has been baked for Devi Vishwakumar.": "has been baked", "Diane Johnson's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "On Wednesday, an award will be given to Jotaro Kujo by the dance team.": "will be given", "Our monthly crafts club is organized by Kamala Nandiwadal.": "is organized", "We were directed to Pops Johnson’s house by the flashing neon signs.": "were directed", "Veronica Lodge's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "The marshmallows have been toasted to perfection by Gertrude Yorkes and me.": "have been toasted", "Last semester, the lead role in the musical was played by Jack Johnson.": "was played", "On Sunday, Jonathan Joestar's plastic watches will be sold at the craft fair.": "will be sold", "The books in the library are being eaten by the caterpillars from Fabiola Torres's garden.": "are being eaten", "The cake with gold sparkles has been baked for Lucy Hernandez.": "has been baked", "Molly Hayes Hernandez's novel about a werewolf has been read all over the world.": "has been read", "A balloon and a juice box have been offered by Rainbow Johnson's baby cousin.": "have been offered", "Two summers ago, Nico Minoru was sent to the art fair to show her beautiful painting.": "was sent", "Jughead Jones will be invited to this event by the secret juggling society.": "will be invited", "My sketches are being displayed at Kaitlynn Price's gallery for a week.": "are being displayed", "Devi Vishwakumar's CDs were played during the dance party.": "were played", "Dio Brando's famous crepes are made with fresh strawberries.": "are made", "Molly Hayes Hernandez's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Next week, the best hula dancer will be awarded a slice of Jughead Jones’s famous apple pie.": "will be awarded", "Kamala Nandiwadal's movie about a flying robot was praised by the film critic.": "was praised", "A balloon and a juice box have been offered by Joseph Joestar's baby cousin.": "have been offered", "Goats are groomed on the farm near Pops Johnson’s house.": "are groomed", "Two summers ago, Diane Johnson was sent to the art fair to show her beautiful painting.": "was sent", "Right now, my finger paints are being used by Dre Johnson and his cousins.": "are being used", "According to Jonathan Joestar, extra juice boxes are kept behind our teacher's desk.": "are kept", "My sketches are being displayed at Fabiola Torres's gallery for a week.": "are being displayed", "Tomorrow, the award will be presented to Paxton Hall-Yoshida by the principal.": "will be presented", "Our monthly crafts club is organized by Jack Johnson.": "is organized", "The cake with gold sparkles has been baked for Gertrude Yorkes.": "has been baked", "Alex Wilder was handed a key to open the buried treasure.": "was handed", "Every rehearsal, the ballerinas are chased across the stage by Jotaro Kujo's little brother.": "are chased", "Lucy Hernandez was handed a key to open the buried treasure.": "was handed", "The marshmallows have been toasted to perfection by Eleanor Wong and me.": "have been toasted", "Vivian Carter's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Rainbow Johnson's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Last semester, the lead role in the musical was played by Seth Acosta.": "was played", "At this very moment, my costume for the show is being designed by Dio Brando.": "is being designed", "Josuke Higashikata's colorful collage will be displayed in the lunchroom.": "will be displayed", "Kaitlynn Price will be invited to this event by the secret juggling society.": "will be invited", "We were directed to Karolina Dean’s house by the flashing neon signs.": "were directed", "The guests are being entertained by Cheryl Blossom's talking robot.": "are being entertained", "Trent Harrison's comedy routine will be remembered for many years.": "will be remembered", "Nalini Vishwakumar's famous crepes are made with fresh strawberries.": "are made", "Mitchell Wilson's CDs were played during the dance party.": "were played", "Chase Stein's novel about a werewolf has been read all over the world.": "has been read", "On Sunday, Archie Andrews's plastic watches will be sold at the craft fair.": "will be sold", "The balloon was tied to Veronica Lodge's wrist by the clown.": "was tied", "Rainbow Johnson will be invited to this event by the secret juggling society.": "will be invited", "Just a few moments ago, the fuzzy tarantula was adopted by Jughead Jones.": "was adopted", "Elephants were ridden at Trent Harrison's circus-themed party.": "were ridden", "A balloon and a juice box have been offered by Dio Brando's baby cousin.": "have been offered", "Ceramic bowls were sculpted on Fabiola Torres's pottery wheel.": "were sculpted", "Molly Hayes Hernandez’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Karolina Dean was offered a game of Connect Four to play in the car.": "was offered", "Diane Johnson's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Every morning, the Zumba class is taught by Kaitlynn Price.": "is taught", "Mitchell Wilson's broken glasses will be fixed by the magician.": "will be fixed", "On Wednesday, an award will be given to Pops Johnson by the dance team.": "will be given", "Nico Minoru’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "Two summers ago, Jonathan Joestar was sent to the art fair to show his beautiful painting.": "was sent", "Seth Acosta's broken glasses will be fixed by the magician.": "will be fixed", "After every storm, mud pies are made in Devi Vishwakumar's yard.": "are made", "The best doodles were found on Eleanor Wong’s dinner napkins.": "were found", "The books in the library are being eaten by the caterpillars from Chase Stein's garden.": "are being eaten", "Devi Vishwakumar’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "The balloon was tied to Nalini Vishwakumar's wrist by the clown.": "was tied", "Once a month, my youth football team is coached by Trent Harrison.": "is coached", "We were directed to Chase Stein’s house by the flashing neon signs.": "were directed", "Nico Minoru's broken glasses will be fixed by the magician.": "will be fixed", "Gertrude Yorkes’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "All Kaitlynn Price's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "A balloon and a juice box have been offered by Lucy Hernandez's baby cousin.": "have been offered", "Mitchell Wilson's novel about a werewolf has been read all over the world.": "has been read", "On Wednesday, an award will be given to Jughead Jones by the dance team.": "will be given", "Goats are groomed on the farm near Seth Acosta’s house.": "are groomed", "My sketches are being displayed at Diane Johnson's gallery for a week.": "are being displayed", "Right now, my finger paints are being used by Jonathan Joestar and his cousins.": "are being used", "Cheryl Blossom's comedy routine will be remembered for many years.": "will be remembered", "Two summers ago, Ben Gross was sent to the art fair to show his beautiful painting.": "was sent", "Elephants were ridden at Kamala Nandiwadal's circus-themed party.": "were ridden", "The cake with gold sparkles has been baked for Archie Andrews.": "has been baked", "Paxton Hall-Yoshida's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Eleanor Wong's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "The best doodles were found on Fabiola Torres’s dinner napkins.": "were found", "Dio Brando's novel about a werewolf has been read all over the world.": "has been read", "Ceramic bowls were sculpted on Alex Wilder's pottery wheel.": "were sculpted", "The cake with gold sparkles has been baked for Jotaro Kujo.": "has been baked", "Karolina Dean will be invited to this event by the secret juggling society.": "will be invited", "Molly Hayes Hernandez's surfboard is being painted with colorful patterns.": "is being painted", "Tomorrow morning, Jack Johnson's bubble gum statue will be mailed to the White House.": "will be mailed", "During the summer, Veronica Lodge's ant farm is guarded by my neighbors.": "is guarded", "Next week, the best hula dancer will be awarded a slice of Vivian Carter’s famous apple pie.": "will be awarded", "Tomorrow, the award will be presented to Chase Stein by the principal.": "will be presented", "The best hamburgers in the city are cooked at Nico Minoru's diner on Main Street.": "are cooked", "Last Thursday, the polka class was taught in Alex Wilder's studio.": "was taught", "Just a few moments ago, the fuzzy tarantula was adopted by Eleanor Wong.": "was adopted", "Last semester, the lead role in the musical was played by Jughead Jones.": "was played", "The guests are being entertained by Fabiola Torres's talking robot.": "are being entertained", "After every storm, mud pies are made in Dre Johnson's yard.": "are made", "Gertrude Yorkes was handed a key to open the buried treasure.": "was handed", "Nalini Vishwakumar's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Lucy Hernandez's movie about a flying robot was praised by the film critic.": "was praised", "According to Cheryl Blossom, extra juice boxes are kept behind our teacher's desk.": "are kept", "Next week, those banners will be hung for Rainbow Johnson's graduation.": "will be hung", "Pops Johnson was offered a game of Connect Four to play in the car.": "was offered", "Vivian Carter's famous crepes are made with fresh strawberries.": "are made", "During the summer, Jack Johnson's ant farm is guarded by my neighbors.": "is guarded", "Seth Acosta will be invited to this event by the secret juggling society.": "will be invited", "A balloon and a juice box have been offered by Alex Wilder's baby cousin.": "have been offered", "Joseph Joestar's broken glasses will be fixed by the magician.": "will be fixed", "Right now, my finger paints are being used by Josuke Higashikata and his cousins.": "are being used", "Gertrude Yorkes's movie about a flying robot was praised by the film critic.": "was praised", "Next week, those banners will be hung for Jonathan Joestar's graduation.": "will be hung", "We were directed to Nico Minoru’s house by the flashing neon signs.": "were directed", "Every rehearsal, the ballerinas are chased across the stage by Jughead Jones's little brother.": "are chased", "On Sunday, Pops Johnson's plastic watches will be sold at the craft fair.": "will be sold", "Tomorrow, the award will be presented to Archie Andrews by the principal.": "will be presented", "The cake with gold sparkles has been baked for Cheryl Blossom.": "has been baked", "At this very moment, my costume for the show is being designed by Devi Vishwakumar.": "is being designed", "Next week, the best hula dancer will be awarded a slice of Nalini Vishwakumar’s famous apple pie.": "will be awarded", "Our monthly crafts club is organized by Karolina Dean.": "is organized", "All Vivian Carter's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "According to Eleanor Wong, extra juice boxes are kept behind our teacher's desk.": "are kept", "Dio Brando's CDs were played during the dance party.": "were played", "The balloon was tied to Paxton Hall-Yoshida's wrist by the clown.": "was tied", "The best doodles were found on Mitchell Wilson’s dinner napkins.": "were found", "Ceramic bowls were sculpted on Molly Hayes Hernandez's pottery wheel.": "were sculpted", "Every morning, the Zumba class is taught by Chase Stein.": "is taught", "Lucy Hernandez's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "After every storm, mud pies are made in Kaitlynn Price's yard.": "are made", "Fabiola Torres's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Ben Gross was handed a key to open the buried treasure.": "was handed", "The guests are being entertained by Veronica Lodge's talking robot.": "are being entertained", "Two summers ago, Kamala Nandiwadal was sent to the art fair to show her beautiful painting.": "was sent", "Jotaro Kujo's novel about a werewolf has been read all over the world.": "has been read", "The marshmallows have been toasted to perfection by Dre Johnson and me.": "have been toasted", "The best hamburgers in the city are cooked at Jonathan Joestar's diner on Main Street.": "are cooked", "On Wednesday, an award will be given to Vivian Carter by the dance team.": "will be given", "Alex Wilder’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Kaitlynn Price's surfboard is being painted with colorful patterns.": "is being painted", "Goats are groomed on the farm near Devi Vishwakumar’s house.": "are groomed", "The marshmallows have been toasted to perfection by Dio Brando and me.": "have been toasted", "Tomorrow morning, Karolina Dean's bubble gum statue will be mailed to the White House.": "will be mailed", "Last Thursday, the polka class was taught in Rainbow Johnson's studio.": "was taught", "Cheryl Blossom's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Jack Johnson's broken glasses will be fixed by the magician.": "will be fixed", "Once a month, my youth football team is coached by Veronica Lodge.": "is coached", "Two summers ago, Mitchell Wilson was sent to the art fair to show his beautiful painting.": "was sent", "Diane Johnson was offered a game of Connect Four to play in the car.": "was offered", "Elephants were ridden at Veronica Lodge's circus-themed party.": "were ridden", "Pops Johnson's comedy routine will be remembered for many years.": "will be remembered", "Alex Wilder's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Jack Johnson's novel about a werewolf has been read all over the world.": "has been read", "Devi Vishwakumar's surfboard is being painted with colorful patterns.": "is being painted", "Next week, those banners will be hung for Chase Stein's graduation.": "will be hung", "Goats are groomed on the farm near Gertrude Yorkes’s house.": "are groomed", "Tomorrow, the award will be presented to Seth Acosta by the principal.": "will be presented", "The marshmallows have been toasted to perfection by Jonathan Joestar and me.": "have been toasted", "Nico Minoru's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "The cake with gold sparkles has been baked for Paxton Hall-Yoshida.": "has been baked", "Once a month, my youth football team is coached by Karolina Dean.": "is coached", "Jotaro Kujo’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Tomorrow, the award will be presented to Kaitlynn Price by the principal.": "will be presented", "The best hamburgers in the city are cooked at Fabiola Torres's diner on Main Street.": "are cooked", "We were directed to Dio Brando’s house by the flashing neon signs.": "were directed", "Ben Gross's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Every morning, the Zumba class is taught by Eleanor Wong.": "is taught", "Last Thursday, the polka class was taught in Trent Harrison's studio.": "was taught", "Dre Johnson's movie about a flying robot was praised by the film critic.": "was praised", "Right now, my finger paints are being used by Archie Andrews and his cousins.": "are being used", "Joseph Joestar's famous crepes are made with fresh strawberries.": "are made", "Our monthly crafts club is organized by Molly Hayes Hernandez.": "is organized", "Kamala Nandiwadal's novel about a werewolf has been read all over the world.": "has been read", "A balloon and a juice box have been offered by Cheryl Blossom's baby cousin.": "have been offered", "The balloon was tied to Joseph Joestar's wrist by the clown.": "was tied", "The cake with gold sparkles has been baked for Dre Johnson.": "has been baked", "My sketches are being displayed at Eleanor Wong's gallery for a week.": "are being displayed", "After every storm, mud pies are made in Seth Acosta's yard.": "are made", "Cheryl Blossom’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "According to Lucy Hernandez, extra juice boxes are kept behind our teacher's desk.": "are kept", "The books in the library are being eaten by the caterpillars from Devi Vishwakumar's garden.": "are being eaten", "All Rainbow Johnson's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Alex Wilder was offered a game of Connect Four to play in the car.": "was offered", "On Sunday, Diane Johnson's plastic watches will be sold at the craft fair.": "will be sold", "Jonathan Joestar was handed a key to open the buried treasure.": "was handed", "Josuke Higashikata's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "The cake with gold sparkles has been baked for Mitchell Wilson.": "has been baked", "Cheryl Blossom will be invited to this event by the secret juggling society.": "will be invited", "Two summers ago, Kaitlynn Price was sent to the art fair to show her beautiful painting.": "was sent", "A balloon and a juice box have been offered by Eleanor Wong's baby cousin.": "have been offered", "The marshmallows have been toasted to perfection by Fabiola Torres and me.": "have been toasted", "Dre Johnson's broken glasses will be fixed by the magician.": "will be fixed", "Every morning, the Zumba class is taught by Diane Johnson.": "is taught", "Jonathan Joestar will be invited to this event by the secret juggling society.": "will be invited", "The books in the library are being eaten by the caterpillars from Archie Andrews's garden.": "are being eaten", "The best hamburgers in the city are cooked at Jughead Jones's diner on Main Street.": "are cooked", "Right now, my finger paints are being used by Nalini Vishwakumar and her cousins.": "are being used", "At this very moment, my costume for the show is being designed by Rainbow Johnson.": "is being designed", "Our monthly crafts club is organized by Joseph Joestar.": "is organized", "Karolina Dean's novel about a werewolf has been read all over the world.": "has been read", "Trent Harrison's CDs were played during the dance party.": "were played", "Last semester, the lead role in the musical was played by Vivian Carter.": "was played", "Nico Minoru was offered a game of Connect Four to play in the car.": "was offered", "Elephants were ridden at Gertrude Yorkes's circus-themed party.": "were ridden", "After every storm, mud pies are made in Pops Johnson's yard.": "are made", "On Sunday, Seth Acosta's plastic watches will be sold at the craft fair.": "will be sold", "Molly Hayes Hernandez's colorful collage will be displayed in the lunchroom.": "will be displayed", "Last Thursday, the polka class was taught in Lucy Hernandez's studio.": "was taught", "During the summer, Josuke Higashikata's ant farm is guarded by my neighbors.": "is guarded", "Diane Johnson was handed a key to open the buried treasure.": "was handed", "Every rehearsal, the ballerinas are chased across the stage by Kaitlynn Price's little brother.": "are chased", "Devi Vishwakumar's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Pops Johnson’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "My sketches are being displayed at Gertrude Yorkes's gallery for a week.": "are being displayed", "According to Kamala Nandiwadal, extra juice boxes are kept behind our teacher's desk.": "are kept", "A balloon and a juice box have been offered by Seth Acosta's baby cousin.": "have been offered", "Two summers ago, Rainbow Johnson was sent to the art fair to show her beautiful painting.": "was sent", "The best doodles were found on Dio Brando’s dinner napkins.": "were found", "Alex Wilder's famous crepes are made with fresh strawberries.": "are made", "Just a few moments ago, the fuzzy tarantula was adopted by Karolina Dean.": "was adopted", "Ceramic bowls were sculpted on Lucy Hernandez's pottery wheel.": "were sculpted", "Last semester, the lead role in the musical was played by Joseph Joestar.": "was played", "Mitchell Wilson's colorful collage will be displayed in the lunchroom.": "will be displayed", "After every storm, mud pies are made in Alex Wilder's yard.": "are made", "Devi Vishwakumar’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Pops Johnson's broken glasses will be fixed by the magician.": "will be fixed", "The books in the library are being eaten by the caterpillars from Jonathan Joestar's garden.": "are being eaten", "Chase Stein's comedy routine will be remembered for many years.": "will be remembered", "Tomorrow morning, Jughead Jones's bubble gum statue will be mailed to the White House.": "will be mailed", "Goats are groomed on the farm near Paxton Hall-Yoshida’s house.": "are groomed", "The best doodles were found on Trent Harrison’s dinner napkins.": "were found", "The balloon was tied to Vivian Carter's wrist by the clown.": "was tied", "Ben Gross's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Josuke Higashikata was offered a game of Connect Four to play in the car.": "was offered", "The marshmallows have been toasted to perfection by Diane Johnson and me.": "have been toasted", "Kamala Nandiwadal's famous crepes are made with fresh strawberries.": "are made", "Jack Johnson's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Next week, those banners will be hung for Gertrude Yorkes's graduation.": "will be hung", "The cake with gold sparkles has been baked for Seth Acosta.": "has been baked", "Once a month, my youth football team is coached by Cheryl Blossom.": "is coached", "Fabiola Torres’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "The best hamburgers in the city are cooked at Jotaro Kujo's diner on Main Street.": "are cooked", "Fabiola Torres will be invited to this event by the secret juggling society.": "will be invited", "Every rehearsal, the ballerinas are chased across the stage by Jack Johnson's little brother.": "are chased", "All Jotaro Kujo's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "On Wednesday, an award will be given to Kaitlynn Price by the dance team.": "will be given", "According to Dio Brando, extra juice boxes are kept behind our teacher's desk.": "are kept", "We were directed to Trent Harrison’s house by the flashing neon signs.": "were directed", "The marshmallows have been toasted to perfection by Nalini Vishwakumar and me.": "have been toasted", "During the summer, Eleanor Wong's ant farm is guarded by my neighbors.": "is guarded", "On Wednesday, an award will be given to Devi Vishwakumar by the dance team.": "will be given", "Elephants were ridden at Josuke Higashikata's circus-themed party.": "were ridden", "Just a few moments ago, the fuzzy tarantula was adopted by Mitchell Wilson.": "was adopted", "Trent Harrison’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "The best doodles were found on Seth Acosta’s dinner napkins.": "were found", "The best hamburgers in the city are cooked at Dre Johnson's diner on Main Street.": "are cooked", "After every storm, mud pies are made in Jack Johnson's yard.": "are made", "Alex Wilder's movie about a flying robot was praised by the film critic.": "was praised", "The guests are being entertained by Eleanor Wong's talking robot.": "are being entertained", "Molly Hayes Hernandez's broken glasses will be fixed by the magician.": "will be fixed", "At this very moment, my costume for the show is being designed by Archie Andrews.": "is being designed", "Ben Gross's CDs were played during the dance party.": "were played", "A balloon and a juice box have been offered by Paxton Hall-Yoshida's baby cousin.": "have been offered", "Tomorrow morning, Dio Brando's bubble gum statue will be mailed to the White House.": "will be mailed", "Pops Johnson was handed a key to open the buried treasure.": "was handed", "On Wednesday, an award will be given to Cheryl Blossom by the dance team.": "will be given", "Mitchell Wilson's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Devi Vishwakumar's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Two summers ago, Fabiola Torres was sent to the art fair to show her beautiful painting.": "was sent", "Goats are groomed on the farm near Lucy Hernandez’s house.": "are groomed", "Jughead Jones was offered a game of Connect Four to play in the car.": "was offered", "Next week, those banners will be hung for Joseph Joestar's graduation.": "will be hung", "Jotaro Kujo's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "The books in the library are being eaten by the caterpillars from Vivian Carter's garden.": "are being eaten", "Rainbow Johnson's broken glasses will be fixed by the magician.": "will be fixed", "Veronica Lodge's famous crepes are made with fresh strawberries.": "are made", "The balloon was tied to Jonathan Joestar's wrist by the clown.": "was tied", "Nico Minoru's comedy routine will be remembered for many years.": "will be remembered", "During the summer, Diane Johnson's ant farm is guarded by my neighbors.": "is guarded", "Last Thursday, the polka class was taught in Karolina Dean's studio.": "was taught", "All Fabiola Torres's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Archie Andrews's novel about a werewolf has been read all over the world.": "has been read", "Last semester, the lead role in the musical was played by Chase Stein.": "was played", "Ceramic bowls were sculpted on Dio Brando's pottery wheel.": "were sculpted", "Our monthly crafts club is organized by Devi Vishwakumar.": "is organized", "Jotaro Kujo's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "On Sunday, Karolina Dean's plastic watches will be sold at the craft fair.": "will be sold", "Every rehearsal, the ballerinas are chased across the stage by Veronica Lodge's little brother.": "are chased", "Every morning, the Zumba class is taught by Nico Minoru.": "is taught", "The marshmallows have been toasted to perfection by Mitchell Wilson and me.": "have been toasted", "Once a month, my youth football team is coached by Alex Wilder.": "is coached", "Dre Johnson's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "The cake with gold sparkles has been baked for Dio Brando.": "has been baked", "Tomorrow, the award will be presented to Jughead Jones by the principal.": "will be presented", "Just a few moments ago, the fuzzy tarantula was adopted by Lucy Hernandez.": "was adopted", "On Wednesday, an award will be given to Paxton Hall-Yoshida by the dance team.": "will be given", "On Sunday, Mitchell Wilson's plastic watches will be sold at the craft fair.": "will be sold", "Last Thursday, the polka class was taught in Pops Johnson's studio.": "was taught", "Our monthly crafts club is organized by Ben Gross.": "is organized", "Josuke Higashikata's broken glasses will be fixed by the magician.": "will be fixed", "We were directed to Jonathan Joestar’s house by the flashing neon signs.": "were directed", "My sketches are being displayed at Vivian Carter's gallery for a week.": "are being displayed", "Molly Hayes Hernandez's movie about a flying robot was praised by the film critic.": "was praised", "Cheryl Blossom was offered a game of Connect Four to play in the car.": "was offered", "Seth Acosta’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Elephants were ridden at Alex Wilder's circus-themed party.": "were ridden", "Goats are groomed on the farm near Nalini Vishwakumar’s house.": "are groomed", "The marshmallows have been toasted to perfection by Kaitlynn Price and me.": "have been toasted", "Joseph Joestar's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "According to Jotaro Kujo, extra juice boxes are kept behind our teacher's desk.": "are kept", "Trent Harrison's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Jack Johnson's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "On Wednesday, an award will be given to Karolina Dean by the dance team.": "will be given", "Last semester, the lead role in the musical was played by Diane Johnson.": "was played", "Next week, those banners will be hung for Eleanor Wong's graduation.": "will be hung", "Alex Wilder's colorful collage will be displayed in the lunchroom.": "will be displayed", "The guests are being entertained by Kaitlynn Price's talking robot.": "are being entertained", "Cheryl Blossom’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "The books in the library are being eaten by the caterpillars from Paxton Hall-Yoshida's garden.": "are being eaten", "Archie Andrews was handed a key to open the buried treasure.": "was handed", "Once a month, my youth football team is coached by Fabiola Torres.": "is coached", "Tomorrow, the award will be presented to Nalini Vishwakumar by the principal.": "will be presented", "Trent Harrison's famous crepes are made with fresh strawberries.": "are made", "Joseph Joestar's CDs were played during the dance party.": "were played", "Tomorrow morning, Lucy Hernandez's bubble gum statue will be mailed to the White House.": "will be mailed", "All Kamala Nandiwadal's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "The best hamburgers in the city are cooked at Dio Brando's diner on Main Street.": "are cooked", "After every storm, mud pies are made in Vivian Carter's yard.": "are made", "Last Thursday, the polka class was taught in Mitchell Wilson's studio.": "was taught", "A balloon and a juice box have been offered by Gertrude Yorkes's baby cousin.": "have been offered", "Jonathan Joestar's broken glasses will be fixed by the magician.": "will be fixed", "Pops Johnson’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Next week, the best hula dancer will be awarded a slice of Jotaro Kujo’s famous apple pie.": "will be awarded", "Ceramic bowls were sculpted on Jack Johnson's pottery wheel.": "were sculpted", "Just a few moments ago, the fuzzy tarantula was adopted by Cheryl Blossom.": "was adopted", "Molly Hayes Hernandez was handed a key to open the buried treasure.": "was handed", "Nalini Vishwakumar's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "My sketches are being displayed at Lucy Hernandez's gallery for a week.": "are being displayed", "Jughead Jones’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Next week, those banners will be hung for Karolina Dean's graduation.": "will be hung", "On Wednesday, an award will be given to Seth Acosta by the dance team.": "will be given", "Ben Gross's novel about a werewolf has been read all over the world.": "has been read", "Tomorrow, the award will be presented to Vivian Carter by the principal.": "will be presented", "Fabiola Torres's broken glasses will be fixed by the magician.": "will be fixed", "Rainbow Johnson's novel about a werewolf has been read all over the world.": "has been read", "Devi Vishwakumar was handed a key to open the buried treasure.": "was handed", "On Sunday, Chase Stein's plastic watches will be sold at the craft fair.": "will be sold", "Goats are groomed on the farm near Archie Andrews’s house.": "are groomed", "Our monthly crafts club is organized by Eleanor Wong.": "is organized", "The best doodles were found on Joseph Joestar’s dinner napkins.": "were found", "Nico Minoru's movie about a flying robot was praised by the film critic.": "was praised", "Josuke Higashikata's CDs were played during the dance party.": "were played", "At this very moment, my costume for the show is being designed by Kamala Nandiwadal.": "is being designed", "Nico Minoru will be invited to this event by the secret juggling society.": "will be invited", "A balloon and a juice box have been offered by Dre Johnson's baby cousin.": "have been offered", "Gertrude Yorkes's famous crepes are made with fresh strawberries.": "are made", "Fabiola Torres's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "According to Vivian Carter, extra juice boxes are kept behind our teacher's desk.": "are kept", "The guests are being entertained by Karolina Dean's talking robot.": "are being entertained", "Two summers ago, Trent Harrison was sent to the art fair to show his beautiful painting.": "was sent", "We were directed to Archie Andrews’s house by the flashing neon signs.": "were directed", "The marshmallows have been toasted to perfection by Alex Wilder and me.": "have been toasted", "Kaitlynn Price's comedy routine will be remembered for many years.": "will be remembered", "Devi Vishwakumar was offered a game of Connect Four to play in the car.": "was offered", "Last semester, the lead role in the musical was played by Paxton Hall-Yoshida.": "was played", "Jotaro Kujo's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Nico Minoru's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "The marshmallows have been toasted to perfection by Paxton Hall-Yoshida and me.": "have been toasted", "Just a few moments ago, the fuzzy tarantula was adopted by Diane Johnson.": "was adopted", "The balloon was tied to Devi Vishwakumar's wrist by the clown.": "was tied", "Mitchell Wilson was offered a game of Connect Four to play in the car.": "was offered", "Tomorrow, the award will be presented to Joseph Joestar by the principal.": "will be presented", "Tomorrow morning, Chase Stein's bubble gum statue will be mailed to the White House.": "will be mailed", "My sketches are being displayed at Veronica Lodge's gallery for a week.": "are being displayed", "The best hamburgers in the city are cooked at Jack Johnson's diner on Main Street.": "are cooked", "A balloon and a juice box have been offered by Nalini Vishwakumar's baby cousin.": "have been offered", "Last semester, the lead role in the musical was played by Ben Gross.": "was played", "Karolina Dean's comedy routine will be remembered for many years.": "will be remembered", "All Molly Hayes Hernandez's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Kamala Nandiwadal's colorful collage will be displayed in the lunchroom.": "will be displayed", "During the summer, Vivian Carter's ant farm is guarded by my neighbors.": "is guarded", "The guests are being entertained by Nico Minoru's talking robot.": "are being entertained", "Jack Johnson was offered a game of Connect Four to play in the car.": "was offered", "The best doodles were found on Alex Wilder’s dinner napkins.": "were found", "Molly Hayes Hernandez's famous crepes are made with fresh strawberries.": "are made", "Every rehearsal, the ballerinas are chased across the stage by Lucy Hernandez's little brother.": "are chased", "According to Jughead Jones, extra juice boxes are kept behind our teacher's desk.": "are kept", "At this very moment, my costume for the show is being designed by Cheryl Blossom.": "is being designed", "Our monthly crafts club is organized by Veronica Lodge.": "is organized", "On Wednesday, an award will be given to Mitchell Wilson by the dance team.": "will be given", "Dio Brando's broken glasses will be fixed by the magician.": "will be fixed", "Joseph Joestar was handed a key to open the buried treasure.": "was handed", "Dio Brando was handed a key to open the buried treasure.": "was handed", "All Pops Johnson's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "According to Fabiola Torres, extra juice boxes are kept behind our teacher's desk.": "are kept", "The best hamburgers in the city are cooked at Devi Vishwakumar's diner on Main Street.": "are cooked", "The marshmallows have been toasted to perfection by Vivian Carter and me.": "have been toasted", "Veronica Lodge's CDs were played during the dance party.": "were played", "A balloon and a juice box have been offered by Diane Johnson's baby cousin.": "have been offered", "Archie Andrews's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Trent Harrison's novel about a werewolf has been read all over the world.": "has been read", "Two summers ago, Jack Johnson was sent to the art fair to show his beautiful painting.": "was sent", "The best doodles were found on Lucy Hernandez’s dinner napkins.": "were found", "Jughead Jones's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Right now, my finger paints are being used by Jotaro Kujo and his cousins.": "are being used", "Every morning, the Zumba class is taught by Mitchell Wilson.": "is taught", "After every storm, mud pies are made in Paxton Hall-Yoshida's yard.": "are made", "Next week, the best hula dancer will be awarded a slice of Rainbow Johnson’s famous apple pie.": "will be awarded", "My sketches are being displayed at Nalini Vishwakumar's gallery for a week.": "are being displayed", "Last Thursday, the polka class was taught in Ben Gross's studio.": "was taught", "Ceramic bowls were sculpted on Jonathan Joestar's pottery wheel.": "were sculpted", "We were directed to Cheryl Blossom’s house by the flashing neon signs.": "were directed", "Two summers ago, Alex Wilder was sent to the art fair to show his beautiful painting.": "was sent", "Josuke Higashikata’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Kamala Nandiwadal's broken glasses will be fixed by the magician.": "will be fixed", "Dre Johnson's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Once a month, my youth football team is coached by Gertrude Yorkes.": "is coached", "Nico Minoru's famous crepes are made with fresh strawberries.": "are made", "Tomorrow morning, Diane Johnson's bubble gum statue will be mailed to the White House.": "will be mailed", "Pops Johnson's surfboard is being painted with colorful patterns.": "is being painted", "During the summer, Jughead Jones's ant farm is guarded by my neighbors.": "is guarded", "Last semester, the lead role in the musical was played by Josuke Higashikata.": "was played", "The cake with gold sparkles has been baked for Veronica Lodge.": "has been baked", "Mitchell Wilson’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Archie Andrews was offered a game of Connect Four to play in the car.": "was offered", "On Wednesday, an award will be given to Dre Johnson by the dance team.": "will be given", "Kaitlynn Price's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Vivian Carter's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Vivian Carter was handed a key to open the buried treasure.": "was handed", "Next week, those banners will be hung for Jughead Jones's graduation.": "will be hung", "Tomorrow morning, Trent Harrison's bubble gum statue will be mailed to the White House.": "will be mailed", "Last Thursday, the polka class was taught in Dio Brando's studio.": "was taught", "My sketches are being displayed at Jotaro Kujo's gallery for a week.": "are being displayed", "Every morning, the Zumba class is taught by Jack Johnson.": "is taught", "Chase Stein was offered a game of Connect Four to play in the car.": "was offered", "On Wednesday, an award will be given to Fabiola Torres by the dance team.": "will be given", "Kamala Nandiwadal was offered a game of Connect Four to play in the car.": "was offered", "The marshmallows have been toasted to perfection by Ben Gross and me.": "have been toasted", "Molly Hayes Hernandez's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Nico Minoru’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Elephants were ridden at Archie Andrews's circus-themed party.": "were ridden", "Tomorrow, the award will be presented to Alex Wilder by the principal.": "will be presented", "Dre Johnson's famous crepes are made with fresh strawberries.": "are made", "Veronica Lodge's colorful collage will be displayed in the lunchroom.": "will be displayed", "The marshmallows have been toasted to perfection by Joseph Joestar and me.": "have been toasted", "Once a month, my youth football team is coached by Seth Acosta.": "is coached", "Two summers ago, Eleanor Wong was sent to the art fair to show her beautiful painting.": "was sent", "Right now, my finger paints are being used by Devi Vishwakumar and her cousins.": "are being used", "Diane Johnson’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "All Trent Harrison's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Paxton Hall-Yoshida was handed a key to open the buried treasure.": "was handed", "Jonathan Joestar's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "The cake with gold sparkles has been baked for Karolina Dean.": "has been baked", "The balloon was tied to Dre Johnson's wrist by the clown.": "was tied", "The guests are being entertained by Mitchell Wilson's talking robot.": "are being entertained", "Veronica Lodge will be invited to this event by the secret juggling society.": "will be invited", "The cake with gold sparkles has been baked for Kaitlynn Price.": "has been baked", "The books in the library are being eaten by the caterpillars from Cheryl Blossom's garden.": "are being eaten", "At this very moment, my costume for the show is being designed by Seth Acosta.": "is being designed", "We were directed to Rainbow Johnson’s house by the flashing neon signs.": "were directed", "On Sunday, Kamala Nandiwadal's plastic watches will be sold at the craft fair.": "will be sold", "Jonathan Joestar's famous crepes are made with fresh strawberries.": "are made", "Vivian Carter will be invited to this event by the secret juggling society.": "will be invited", "My sketches are being displayed at Jughead Jones's gallery for a week.": "are being displayed", "Two summers ago, Devi Vishwakumar was sent to the art fair to show her beautiful painting.": "was sent", "Seth Acosta's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Last Thursday, the polka class was taught in Paxton Hall-Yoshida's studio.": "was taught", "Rainbow Johnson's colorful collage will be displayed in the lunchroom.": "will be displayed", "Chase Stein's broken glasses will be fixed by the magician.": "will be fixed", "The best doodles were found on Pops Johnson’s dinner napkins.": "were found", "Dre Johnson's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Next week, those banners will be hung for Kamala Nandiwadal's graduation.": "will be hung", "Every morning, the Zumba class is taught by Jotaro Kujo.": "is taught", "After every storm, mud pies are made in Veronica Lodge's yard.": "are made", "Trent Harrison's movie about a flying robot was praised by the film critic.": "was praised", "Goats are groomed on the farm near Diane Johnson’s house.": "are groomed", "We were directed to Molly Hayes Hernandez’s house by the flashing neon signs.": "were directed", "Eleanor Wong’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Nico Minoru's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Cheryl Blossom's novel about a werewolf has been read all over the world.": "has been read", "Ceramic bowls were sculpted on Joseph Joestar's pottery wheel.": "were sculpted", "According to Jack Johnson, extra juice boxes are kept behind our teacher's desk.": "are kept", "Kaitlynn Price was handed a key to open the buried treasure.": "was handed", "Dio Brando's surfboard is being painted with colorful patterns.": "is being painted", "Right now, my finger paints are being used by Lucy Hernandez and her cousins.": "are being used", "At this very moment, my costume for the show is being designed by Alex Wilder.": "is being designed", "On Wednesday, an award will be given to Nalini Vishwakumar by the dance team.": "will be given", "A balloon and a juice box have been offered by Nico Minoru's baby cousin.": "have been offered", "Next week, the best hula dancer will be awarded a slice of Alex Wilder’s famous apple pie.": "will be awarded", "Paxton Hall-Yoshida's comedy routine will be remembered for many years.": "will be remembered", "The best hamburgers in the city are cooked at Ben Gross's diner on Main Street.": "are cooked", "Just a few moments ago, the fuzzy tarantula was adopted by Trent Harrison.": "was adopted", "Elephants were ridden at Cheryl Blossom's circus-themed party.": "were ridden", "Our monthly crafts club is organized by Nalini Vishwakumar.": "is organized", "Tomorrow, the award will be presented to Kamala Nandiwadal by the principal.": "will be presented", "Eleanor Wong's broken glasses will be fixed by the magician.": "will be fixed", "Joseph Joestar’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Ben Gross's colorful collage will be displayed in the lunchroom.": "will be displayed", "The cake with gold sparkles has been baked for Josuke Higashikata.": "has been baked", "According to Seth Acosta, extra juice boxes are kept behind our teacher's desk.": "are kept", "Just a few moments ago, the fuzzy tarantula was adopted by Nico Minoru.": "was adopted", "Ceramic bowls were sculpted on Rainbow Johnson's pottery wheel.": "were sculpted", "After every storm, mud pies are made in Dio Brando's yard.": "are made", "The balloon was tied to Eleanor Wong's wrist by the clown.": "was tied", "Fabiola Torres's CDs were played during the dance party.": "were played", "Diane Johnson will be invited to this event by the secret juggling society.": "will be invited", "Jonathan Joestar's surfboard is being painted with colorful patterns.": "is being painted", "The guests are being entertained by Jughead Jones's talking robot.": "are being entertained", "Pops Johnson's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "A balloon and a juice box have been offered by Jotaro Kujo's baby cousin.": "have been offered", "We were directed to Mitchell Wilson’s house by the flashing neon signs.": "were directed", "Nalini Vishwakumar's movie about a flying robot was praised by the film critic.": "was praised", "Right now, my finger paints are being used by Trent Harrison and his cousins.": "are being used", "At this very moment, my costume for the show is being designed by Paxton Hall-Yoshida.": "is being designed", "The books in the library are being eaten by the caterpillars from Kaitlynn Price's garden.": "are being eaten", "On Wednesday, an award will be given to Chase Stein by the dance team.": "will be given", "The best hamburgers in the city are cooked at Veronica Lodge's diner on Main Street.": "are cooked", "Nalini Vishwakumar will be invited to this event by the secret juggling society.": "will be invited", "Fabiola Torres was offered a game of Connect Four to play in the car.": "was offered", "All Gertrude Yorkes's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Next week, the best hula dancer will be awarded a slice of Jack Johnson’s famous apple pie.": "will be awarded", "The cake with gold sparkles has been baked for Alex Wilder.": "has been baked", "Kaitlynn Price’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "Goats are groomed on the farm near Molly Hayes Hernandez’s house.": "are groomed", "The guests are being entertained by Alex Wilder's talking robot.": "are being entertained", "Every morning, the Zumba class is taught by Nalini Vishwakumar.": "is taught", "Seth Acosta's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "A balloon and a juice box have been offered by Karolina Dean's baby cousin.": "have been offered", "Cheryl Blossom's movie about a flying robot was praised by the film critic.": "was praised", "Last Thursday, the polka class was taught in Vivian Carter's studio.": "was taught", "Rainbow Johnson's surfboard is being painted with colorful patterns.": "is being painted", "Next week, the best hula dancer will be awarded a slice of Paxton Hall-Yoshida’s famous apple pie.": "will be awarded", "Tomorrow morning, Devi Vishwakumar's bubble gum statue will be mailed to the White House.": "will be mailed", "A balloon and a juice box have been offered by Jughead Jones's baby cousin.": "have been offered", "Lucy Hernandez’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Every rehearsal, the ballerinas are chased across the stage by Fabiola Torres's little brother.": "are chased", "On Wednesday, an award will be given to Josuke Higashikata by the dance team.": "will be given", "Kamala Nandiwadal's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "After every storm, mud pies are made in Molly Hayes Hernandez's yard.": "are made", "According to Veronica Lodge, extra juice boxes are kept behind our teacher's desk.": "are kept", "On Wednesday, an award will be given to Dio Brando by the dance team.": "will be given", "Gertrude Yorkes’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "Pops Johnson's novel about a werewolf has been read all over the world.": "has been read", "Diane Johnson's novel about a werewolf has been read all over the world.": "has been read", "Dre Johnson was handed a key to open the buried treasure.": "was handed", "The best hamburgers in the city are cooked at Archie Andrews's diner on Main Street.": "are cooked", "The cake with gold sparkles has been baked for Fabiola Torres.": "has been baked", "Next week, those banners will be hung for Dre Johnson's graduation.": "will be hung", "Goats are groomed on the farm near Rainbow Johnson’s house.": "are groomed", "Ceramic bowls were sculpted on Nalini Vishwakumar's pottery wheel.": "were sculpted", "The best doodles were found on Devi Vishwakumar’s dinner napkins.": "were found", "Last semester, the lead role in the musical was played by Gertrude Yorkes.": "was played", "All Joseph Joestar's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Elephants were ridden at Devi Vishwakumar's circus-themed party.": "were ridden", "The cake with gold sparkles has been baked for Nico Minoru.": "has been baked", "Next week, those banners will be hung for Mitchell Wilson's graduation.": "will be hung", "Once a month, my youth football team is coached by Jughead Jones.": "is coached", "Jack Johnson’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Last semester, the lead role in the musical was played by Jotaro Kujo.": "was played", "On Sunday, Rainbow Johnson's plastic watches will be sold at the craft fair.": "will be sold", "The best hamburgers in the city are cooked at Kaitlynn Price's diner on Main Street.": "are cooked", "Just a few moments ago, the fuzzy tarantula was adopted by Chase Stein.": "was adopted", "During the summer, Lucy Hernandez's ant farm is guarded by my neighbors.": "is guarded", "Eleanor Wong's CDs were played during the dance party.": "were played", "Our monthly crafts club is organized by Archie Andrews.": "is organized", "Right now, my finger paints are being used by Ben Gross and his cousins.": "are being used", "Every morning, the Zumba class is taught by Seth Acosta.": "is taught", "Gertrude Yorkes's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "After every storm, mud pies are made in Jotaro Kujo's yard.": "are made", "Josuke Higashikata’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "At this very moment, my costume for the show is being designed by Jonathan Joestar.": "is being designed", "Alex Wilder will be invited to this event by the secret juggling society.": "will be invited", "Cheryl Blossom's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "The guests are being entertained by Archie Andrews's talking robot.": "are being entertained", "Dre Johnson was offered a game of Connect Four to play in the car.": "was offered", "Last Thursday, the polka class was taught in Josuke Higashikata's studio.": "was taught", "Dio Brando's comedy routine will be remembered for many years.": "will be remembered", "The best hamburgers in the city are cooked at Gertrude Yorkes's diner on Main Street.": "are cooked", "Goats are groomed on the farm near Vivian Carter’s house.": "are groomed", "Cheryl Blossom's broken glasses will be fixed by the magician.": "will be fixed", "Kamala Nandiwadal was handed a key to open the buried treasure.": "was handed", "Elephants were ridden at Mitchell Wilson's circus-themed party.": "were ridden", "On Sunday, Nalini Vishwakumar's plastic watches will be sold at the craft fair.": "will be sold", "After every storm, mud pies are made in Chase Stein's yard.": "are made", "Right now, my finger paints are being used by Joseph Joestar and his cousins.": "are being used", "We were directed to Dre Johnson’s house by the flashing neon signs.": "were directed", "At this very moment, my costume for the show is being designed by Ben Gross.": "is being designed", "The guests are being entertained by Seth Acosta's talking robot.": "are being entertained", "Devi Vishwakumar's novel about a werewolf has been read all over the world.": "has been read", "The books in the library are being eaten by the caterpillars from Molly Hayes Hernandez's garden.": "are being eaten", "My sketches are being displayed at Jack Johnson's gallery for a week.": "are being displayed", "Jughead Jones's CDs were played during the dance party.": "were played", "On Wednesday, an award will be given to Diane Johnson by the dance team.": "will be given", "The balloon was tied to Jotaro Kujo's wrist by the clown.": "was tied", "Next week, the best hula dancer will be awarded a slice of Nico Minoru’s famous apple pie.": "will be awarded", "A balloon and a juice box have been offered by Jack Johnson's baby cousin.": "have been offered", "Archie Andrews’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Our monthly crafts club is organized by Dio Brando.": "is organized", "Devi Vishwakumar will be invited to this event by the secret juggling society.": "will be invited", "Once a month, my youth football team is coached by Dio Brando.": "is coached", "Ceramic bowls were sculpted on Kaitlynn Price's pottery wheel.": "were sculpted", "Tomorrow morning, Dre Johnson's bubble gum statue will be mailed to the White House.": "will be mailed", "Jughead Jones's famous crepes are made with fresh strawberries.": "are made", "Elephants were ridden at Rainbow Johnson's circus-themed party.": "were ridden", "Alex Wilder's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Ben Gross will be invited to this event by the secret juggling society.": "will be invited", "Every rehearsal, the ballerinas are chased across the stage by Paxton Hall-Yoshida's little brother.": "are chased", "Trent Harrison's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Veronica Lodge's novel about a werewolf has been read all over the world.": "has been read", "Tomorrow, the award will be presented to Eleanor Wong by the principal.": "will be presented", "On Sunday, Lucy Hernandez's plastic watches will be sold at the craft fair.": "will be sold", "Karolina Dean's CDs were played during the dance party.": "were played", "The guests are being entertained by Kamala Nandiwadal's talking robot.": "are being entertained", "Next week, the best hula dancer will be awarded a slice of Joseph Joestar’s famous apple pie.": "will be awarded", "Chase Stein's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Cheryl Blossom's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Right now, my finger paints are being used by Gertrude Yorkes and her cousins.": "are being used", "Jonathan Joestar’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Our monthly crafts club is organized by Seth Acosta.": "is organized", "Nalini Vishwakumar's broken glasses will be fixed by the magician.": "will be fixed", "Archie Andrews's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Devi Vishwakumar's movie about a flying robot was praised by the film critic.": "was praised", "Joseph Joestar's comedy routine will be remembered for many years.": "will be remembered", "A balloon and a juice box have been offered by Josuke Higashikata's baby cousin.": "have been offered", "The books in the library are being eaten by the caterpillars from Jack Johnson's garden.": "are being eaten", "The balloon was tied to Cheryl Blossom's wrist by the clown.": "was tied", "At this very moment, my costume for the show is being designed by Chase Stein.": "is being designed", "We were directed to Paxton Hall-Yoshida’s house by the flashing neon signs.": "were directed", "Just a few moments ago, the fuzzy tarantula was adopted by Nalini Vishwakumar.": "was adopted", "Archie Andrews's colorful collage will be displayed in the lunchroom.": "will be displayed", "During the summer, Pops Johnson's ant farm is guarded by my neighbors.": "is guarded", "Goats are groomed on the farm near Jughead Jones’s house.": "are groomed", "At this very moment, my costume for the show is being designed by Josuke Higashikata.": "is being designed", "The balloon was tied to Kamala Nandiwadal's wrist by the clown.": "was tied", "The best hamburgers in the city are cooked at Rainbow Johnson's diner on Main Street.": "are cooked", "A balloon and a juice box have been offered by Mitchell Wilson's baby cousin.": "have been offered", "Veronica Lodge's surfboard is being painted with colorful patterns.": "is being painted", "Molly Hayes Hernandez will be invited to this event by the secret juggling society.": "will be invited", "Jack Johnson's famous crepes are made with fresh strawberries.": "are made", "Once a month, my youth football team is coached by Eleanor Wong.": "is coached", "Last Thursday, the polka class was taught in Cheryl Blossom's studio.": "was taught", "The cake with gold sparkles has been baked for Vivian Carter.": "has been baked", "Last semester, the lead role in the musical was played by Lucy Hernandez.": "was played", "During the summer, Jotaro Kujo's ant farm is guarded by my neighbors.": "is guarded", "Nalini Vishwakumar's novel about a werewolf has been read all over the world.": "has been read", "All Jonathan Joestar's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Diane Johnson's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Next week, the best hula dancer will be awarded a slice of Chase Stein’s famous apple pie.": "will be awarded", "Kaitlynn Price's broken glasses will be fixed by the magician.": "will be fixed", "Every morning, the Zumba class is taught by Dre Johnson.": "is taught", "Dio Brando’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Dre Johnson’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "We were directed to Kamala Nandiwadal’s house by the flashing neon signs.": "were directed", "Tomorrow, the award will be presented to Mitchell Wilson by the principal.": "will be presented", "On Wednesday, an award will be given to Ben Gross by the dance team.": "will be given", "After every storm, mud pies are made in Gertrude Yorkes's yard.": "are made", "Tomorrow, the award will be presented to Josuke Higashikata by the principal.": "will be presented", "According to Alex Wilder, extra juice boxes are kept behind our teacher's desk.": "are kept", "Two summers ago, Karolina Dean was sent to the art fair to show her beautiful painting.": "was sent", "Tomorrow morning, Kaitlynn Price's bubble gum statue will be mailed to the White House.": "will be mailed", "Two summers ago, Molly Hayes Hernandez was sent to the art fair to show her beautiful painting.": "was sent", "Paxton Hall-Yoshida's colorful collage will be displayed in the lunchroom.": "will be displayed", "My sketches are being displayed at Josuke Higashikata's gallery for a week.": "are being displayed", "The books in the library are being eaten by the caterpillars from Eleanor Wong's garden.": "are being eaten", "Archie Andrews's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Chase Stein's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Lucy Hernandez's famous crepes are made with fresh strawberries.": "are made", "Next week, the best hula dancer will be awarded a slice of Seth Acosta’s famous apple pie.": "will be awarded", "The marshmallows have been toasted to perfection by Jack Johnson and me.": "have been toasted", "Molly Hayes Hernandez’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "Vivian Carter's novel about a werewolf has been read all over the world.": "has been read", "Goats are groomed on the farm near Ben Gross’s house.": "are groomed", "The best doodles were found on Diane Johnson’s dinner napkins.": "were found", "Chase Stein's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "During the summer, Jonathan Joestar's ant farm is guarded by my neighbors.": "is guarded", "Just a few moments ago, the fuzzy tarantula was adopted by Molly Hayes Hernandez.": "was adopted", "Joseph Joestar's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Two summers ago, Gertrude Yorkes was sent to the art fair to show her beautiful painting.": "was sent", "The best hamburgers in the city are cooked at Pops Johnson's diner on Main Street.": "are cooked", "Veronica Lodge was offered a game of Connect Four to play in the car.": "was offered", "Last Thursday, the polka class was taught in Seth Acosta's studio.": "was taught", "Ben Gross's movie about a flying robot was praised by the film critic.": "was praised", "Elephants were ridden at Vivian Carter's circus-themed party.": "were ridden", "Last semester, the lead role in the musical was played by Eleanor Wong.": "was played", "Nalini Vishwakumar's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Right now, my finger paints are being used by Mitchell Wilson and his cousins.": "are being used", "On Sunday, Joseph Joestar's plastic watches will be sold at the craft fair.": "will be sold", "Ceramic bowls were sculpted on Dre Johnson's pottery wheel.": "were sculpted", "Every rehearsal, the ballerinas are chased across the stage by Gertrude Yorkes's little brother.": "are chased", "Elephants were ridden at Nico Minoru's circus-themed party.": "were ridden", "My sketches are being displayed at Pops Johnson's gallery for a week.": "are being displayed", "The books in the library are being eaten by the caterpillars from Jughead Jones's garden.": "are being eaten", "Lucy Hernandez was offered a game of Connect Four to play in the car.": "was offered", "Jotaro Kujo's CDs were played during the dance party.": "were played", "A balloon and a juice box have been offered by Chase Stein's baby cousin.": "have been offered", "Seth Acosta was handed a key to open the buried treasure.": "was handed", "After every storm, mud pies are made in Jonathan Joestar's yard.": "are made", "Our monthly crafts club is organized by Rainbow Johnson.": "is organized", "Once a month, my youth football team is coached by Kamala Nandiwadal.": "is coached", "Two summers ago, Paxton Hall-Yoshida was sent to the art fair to show his beautiful painting.": "was sent", "The guests are being entertained by Molly Hayes Hernandez's talking robot.": "are being entertained", "At this very moment, my costume for the show is being designed by Kaitlynn Price.": "is being designed", "Alex Wilder's comedy routine will be remembered for many years.": "will be remembered", "Devi Vishwakumar's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "We were directed to Fabiola Torres’s house by the flashing neon signs.": "were directed", "Karolina Dean’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "Every morning, the Zumba class is taught by Jonathan Joestar.": "is taught", "Seth Acosta's surfboard is being painted with colorful patterns.": "is being painted", "The cake with gold sparkles has been baked for Joseph Joestar.": "has been baked", "On Wednesday, an award will be given to Molly Hayes Hernandez by the dance team.": "will be given", "According to Ben Gross, extra juice boxes are kept behind our teacher's desk.": "are kept", "Jughead Jones's colorful collage will be displayed in the lunchroom.": "will be displayed", "Lucy Hernandez's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Two summers ago, Jotaro Kujo was sent to the art fair to show his beautiful painting.": "was sent", "Tomorrow morning, Nico Minoru's bubble gum statue will be mailed to the White House.": "will be mailed", "The marshmallows have been toasted to perfection by Jughead Jones and me.": "have been toasted", "Every rehearsal, the ballerinas are chased across the stage by Josuke Higashikata's little brother.": "are chased", "Two summers ago, Cheryl Blossom was sent to the art fair to show her beautiful painting.": "was sent", "Chase Stein was handed a key to open the buried treasure.": "was handed", "Kaitlynn Price's CDs were played during the dance party.": "were played", "Just a few moments ago, the fuzzy tarantula was adopted by Alex Wilder.": "was adopted", "Gertrude Yorkes's colorful collage will be displayed in the lunchroom.": "will be displayed", "Tomorrow, the award will be presented to Jotaro Kujo by the principal.": "will be presented", "On Sunday, Fabiola Torres's plastic watches will be sold at the craft fair.": "will be sold", "Goats are groomed on the farm near Jack Johnson’s house.": "are groomed", "My sketches are being displayed at Ben Gross's gallery for a week.": "are being displayed", "Last semester, the lead role in the musical was played by Archie Andrews.": "was played", "Eleanor Wong was offered a game of Connect Four to play in the car.": "was offered", "Joseph Joestar's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "The books in the library are being eaten by the caterpillars from Lucy Hernandez's garden.": "are being eaten", "Dio Brando’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Jonathan Joestar’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "The marshmallows have been toasted to perfection by Seth Acosta and me.": "have been toasted", "During the summer, Mitchell Wilson's ant farm is guarded by my neighbors.": "is guarded", "Josuke Higashikata's famous crepes are made with fresh strawberries.": "are made", "Our monthly crafts club is organized by Fabiola Torres.": "is organized", "Eleanor Wong's surfboard is being painted with colorful patterns.": "is being painted", "The best hamburgers in the city are cooked at Alex Wilder's diner on Main Street.": "are cooked", "The cake with gold sparkles has been baked for Jonathan Joestar.": "has been baked", "Pops Johnson's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "The best doodles were found on Archie Andrews’s dinner napkins.": "were found", "Right now, my finger paints are being used by Chase Stein and his cousins.": "are being used", "On Wednesday, an award will be given to Veronica Lodge by the dance team.": "will be given", "Next week, those banners will be hung for Archie Andrews's graduation.": "will be hung", "Jughead Jones's surfboard is being painted with colorful patterns.": "is being painted", "The best doodles were found on Jotaro Kujo’s dinner napkins.": "were found", "The books in the library are being eaten by the caterpillars from Rainbow Johnson's garden.": "are being eaten", "All Josuke Higashikata's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "On Wednesday, an award will be given to Joseph Joestar by the dance team.": "will be given", "Trent Harrison was offered a game of Connect Four to play in the car.": "was offered", "At this very moment, my costume for the show is being designed by Vivian Carter.": "is being designed", "My sketches are being displayed at Kamala Nandiwadal's gallery for a week.": "are being displayed", "During the summer, Paxton Hall-Yoshida's ant farm is guarded by my neighbors.": "is guarded", "Tomorrow, the award will be presented to Cheryl Blossom by the principal.": "will be presented", "Ceramic bowls were sculpted on Eleanor Wong's pottery wheel.": "were sculpted", "Ben Gross's broken glasses will be fixed by the magician.": "will be fixed", "Right now, my finger paints are being used by Seth Acosta and his cousins.": "are being used", "Last semester, the lead role in the musical was played by Nalini Vishwakumar.": "was played", "Devi Vishwakumar's broken glasses will be fixed by the magician.": "will be fixed", "Mitchell Wilson's famous crepes are made with fresh strawberries.": "are made", "The cake with gold sparkles has been baked for Ben Gross.": "has been baked", "Nalini Vishwakumar's comedy routine will be remembered for many years.": "will be remembered", "According to Kaitlynn Price, extra juice boxes are kept behind our teacher's desk.": "are kept", "Dio Brando's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Just a few moments ago, the fuzzy tarantula was adopted by Gertrude Yorkes.": "was adopted", "Tomorrow morning, Fabiola Torres's bubble gum statue will be mailed to the White House.": "will be mailed", "Next week, the best hula dancer will be awarded a slice of Josuke Higashikata’s famous apple pie.": "will be awarded", "Tomorrow, the award will be presented to Nico Minoru by the principal.": "will be presented", "Goats are groomed on the farm near Trent Harrison’s house.": "are groomed", "Lucy Hernandez's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Gertrude Yorkes's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "The best hamburgers in the city are cooked at Trent Harrison's diner on Main Street.": "are cooked", "Every morning, the Zumba class is taught by Pops Johnson.": "is taught", "The best doodles were found on Dre Johnson’s dinner napkins.": "were found", "Veronica Lodge's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Chase Stein’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Next week, the best hula dancer will be awarded a slice of Mitchell Wilson’s famous apple pie.": "will be awarded", "The marshmallows have been toasted to perfection by Cheryl Blossom and me.": "have been toasted", "Diane Johnson's colorful collage will be displayed in the lunchroom.": "will be displayed", "Next week, those banners will be hung for Jack Johnson's graduation.": "will be hung", "Rainbow Johnson's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Right now, my finger paints are being used by Jughead Jones and his cousins.": "are being used", "Dio Brando was offered a game of Connect Four to play in the car.": "was offered", "Last Thursday, the polka class was taught in Jonathan Joestar's studio.": "was taught", "Karolina Dean was handed a key to open the buried treasure.": "was handed", "Tomorrow, the award will be presented to Molly Hayes Hernandez by the principal.": "will be presented", "During the summer, Alex Wilder's ant farm is guarded by my neighbors.": "is guarded", "Kamala Nandiwadal will be invited to this event by the secret juggling society.": "will be invited", "Josuke Higashikata's surfboard is being painted with colorful patterns.": "is being painted", "Trent Harrison's broken glasses will be fixed by the magician.": "will be fixed", "Once a month, my youth football team is coached by Lucy Hernandez.": "is coached", "The balloon was tied to Alex Wilder's wrist by the clown.": "was tied", "The guests are being entertained by Devi Vishwakumar's talking robot.": "are being entertained", "At this very moment, my costume for the show is being designed by Mitchell Wilson.": "is being designed", "On Sunday, Dio Brando's plastic watches will be sold at the craft fair.": "will be sold", "Mitchell Wilson’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Last Thursday, the polka class was taught in Gertrude Yorkes's studio.": "was taught", "Our monthly crafts club is organized by Vivian Carter.": "is organized", "All Alex Wilder's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Every rehearsal, the ballerinas are chased across the stage by Cheryl Blossom's little brother.": "are chased", "Every morning, the Zumba class is taught by Josuke Higashikata.": "is taught", "Nalini Vishwakumar's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Goats are groomed on the farm near Jotaro Kujo’s house.": "are groomed", "On Wednesday, an award will be given to Archie Andrews by the dance team.": "will be given", "Joseph Joestar's movie about a flying robot was praised by the film critic.": "was praised", "Kaitlynn Price's colorful collage will be displayed in the lunchroom.": "will be displayed", "Two summers ago, Lucy Hernandez was sent to the art fair to show her beautiful painting.": "was sent", "Ben Gross was offered a game of Connect Four to play in the car.": "was offered", "The best hamburgers in the city are cooked at Paxton Hall-Yoshida's diner on Main Street.": "are cooked", "Dre Johnson will be invited to this event by the secret juggling society.": "will be invited", "On Wednesday, an award will be given to Eleanor Wong by the dance team.": "will be given", "Kaitlynn Price’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "According to Pops Johnson, extra juice boxes are kept behind our teacher's desk.": "are kept", "At this very moment, my costume for the show is being designed by Jack Johnson.": "is being designed", "The books in the library are being eaten by the caterpillars from Diane Johnson's garden.": "are being eaten", "On Sunday, Paxton Hall-Yoshida's plastic watches will be sold at the craft fair.": "will be sold", "After every storm, mud pies are made in Mitchell Wilson's yard.": "are made", "Right now, my finger paints are being used by Rainbow Johnson and her cousins.": "are being used", "Just a few moments ago, the fuzzy tarantula was adopted by Dre Johnson.": "was adopted", "Veronica Lodge was handed a key to open the buried treasure.": "was handed", "Jonathan Joestar's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Ceramic bowls were sculpted on Cheryl Blossom's pottery wheel.": "were sculpted", "Two summers ago, Joseph Joestar was sent to the art fair to show his beautiful painting.": "was sent", "Gertrude Yorkes's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Mitchell Wilson's surfboard is being painted with colorful patterns.": "is being painted", "Kaitlynn Price's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "The marshmallows have been toasted to perfection by Josuke Higashikata and me.": "have been toasted", "Elephants were ridden at Paxton Hall-Yoshida's circus-themed party.": "were ridden", "We were directed to Alex Wilder’s house by the flashing neon signs.": "were directed", "Just a few moments ago, the fuzzy tarantula was adopted by Fabiola Torres.": "was adopted", "Tomorrow, the award will be presented to Devi Vishwakumar by the principal.": "will be presented", "On Sunday, Veronica Lodge's plastic watches will be sold at the craft fair.": "will be sold", "Jotaro Kujo's famous crepes are made with fresh strawberries.": "are made", "The marshmallows have been toasted to perfection by Archie Andrews and me.": "have been toasted", "Every rehearsal, the ballerinas are chased across the stage by Eleanor Wong's little brother.": "are chased", "On Wednesday, an award will be given to Jack Johnson by the dance team.": "will be given", "According to Trent Harrison, extra juice boxes are kept behind our teacher's desk.": "are kept", "Lucy Hernandez will be invited to this event by the secret juggling society.": "will be invited", "During the summer, Archie Andrews's ant farm is guarded by my neighbors.": "is guarded", "Alex Wilder's CDs were played during the dance party.": "were played", "The books in the library are being eaten by the caterpillars from Pops Johnson's garden.": "are being eaten", "Next week, the best hula dancer will be awarded a slice of Cheryl Blossom’s famous apple pie.": "will be awarded", "Two summers ago, Veronica Lodge was sent to the art fair to show her beautiful painting.": "was sent", "All Chase Stein's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Diane Johnson's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Vivian Carter’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "Every rehearsal, the ballerinas are chased across the stage by Seth Acosta's little brother.": "are chased", "Every morning, the Zumba class is taught by Ben Gross.": "is taught", "My sketches are being displayed at Archie Andrews's gallery for a week.": "are being displayed", "Pops Johnson's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Jotaro Kujo was handed a key to open the buried treasure.": "was handed", "Lucy Hernandez's surfboard is being painted with colorful patterns.": "is being painted", "Fabiola Torres's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Jonathan Joestar's novel about a werewolf has been read all over the world.": "has been read", "The balloon was tied to Molly Hayes Hernandez's wrist by the clown.": "was tied", "Tomorrow, the award will be presented to Karolina Dean by the principal.": "will be presented", "Devi Vishwakumar's famous crepes are made with fresh strawberries.": "are made", "Just a few moments ago, the fuzzy tarantula was adopted by Joseph Joestar.": "was adopted", "At this very moment, my costume for the show is being designed by Diane Johnson.": "is being designed", "After every storm, mud pies are made in Archie Andrews's yard.": "are made", "The best doodles were found on Jonathan Joestar’s dinner napkins.": "were found", "Paxton Hall-Yoshida's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Lucy Hernandez's broken glasses will be fixed by the magician.": "will be fixed", "Jotaro Kujo's colorful collage will be displayed in the lunchroom.": "will be displayed", "Last Thursday, the polka class was taught in Diane Johnson's studio.": "was taught", "All Cheryl Blossom's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "The marshmallows have been toasted to perfection by Karolina Dean and me.": "have been toasted", "Goats are groomed on the farm near Kamala Nandiwadal’s house.": "are groomed", "Molly Hayes Hernandez's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Tomorrow, the award will be presented to Ben Gross by the principal.": "will be presented", "Josuke Higashikata will be invited to this event by the secret juggling society.": "will be invited", "During the summer, Trent Harrison's ant farm is guarded by my neighbors.": "is guarded", "Nalini Vishwakumar was handed a key to open the buried treasure.": "was handed", "On Sunday, Nico Minoru's plastic watches will be sold at the craft fair.": "will be sold", "Last semester, the lead role in the musical was played by Veronica Lodge.": "was played", "The balloon was tied to Seth Acosta's wrist by the clown.": "was tied", "After every storm, mud pies are made in Jughead Jones's yard.": "are made", "Every morning, the Zumba class is taught by Vivian Carter.": "is taught", "Fabiola Torres's novel about a werewolf has been read all over the world.": "has been read", "Seth Acosta's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Our monthly crafts club is organized by Jonathan Joestar.": "is organized", "Nico Minoru's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Next week, the best hula dancer will be awarded a slice of Karolina Dean’s famous apple pie.": "will be awarded", "The guests are being entertained by Nalini Vishwakumar's talking robot.": "are being entertained", "Every rehearsal, the ballerinas are chased across the stage by Jonathan Joestar's little brother.": "are chased", "Cheryl Blossom's famous crepes are made with fresh strawberries.": "are made", "The books in the library are being eaten by the caterpillars from Veronica Lodge's garden.": "are being eaten", "Jughead Jones's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Vivian Carter's movie about a flying robot was praised by the film critic.": "was praised", "Kamala Nandiwadal's CDs were played during the dance party.": "were played", "Tomorrow morning, Paxton Hall-Yoshida's bubble gum statue will be mailed to the White House.": "will be mailed", "Dre Johnson's colorful collage will be displayed in the lunchroom.": "will be displayed", "Jack Johnson will be invited to this event by the secret juggling society.": "will be invited", "The best hamburgers in the city are cooked at Chase Stein's diner on Main Street.": "are cooked", "Next week, those banners will be hung for Lucy Hernandez's graduation.": "will be hung", "Right now, my finger paints are being used by Karolina Dean and her cousins.": "are being used", "Every morning, the Zumba class is taught by Paxton Hall-Yoshida.": "is taught", "The balloon was tied to Rainbow Johnson's wrist by the clown.": "was tied", "Our monthly crafts club is organized by Gertrude Yorkes.": "is organized", "Tomorrow, the award will be presented to Fabiola Torres by the principal.": "will be presented", "Diane Johnson's broken glasses will be fixed by the magician.": "will be fixed", "Dre Johnson's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Ceramic bowls were sculpted on Seth Acosta's pottery wheel.": "were sculpted", "Chase Stein's CDs were played during the dance party.": "were played", "The books in the library are being eaten by the caterpillars from Nico Minoru's garden.": "are being eaten", "Dio Brando's colorful collage will be displayed in the lunchroom.": "will be displayed", "Trent Harrison was handed a key to open the buried treasure.": "was handed", "Jonathan Joestar's comedy routine will be remembered for many years.": "will be remembered", "According to Nalini Vishwakumar, extra juice boxes are kept behind our teacher's desk.": "are kept", "Joseph Joestar's novel about a werewolf has been read all over the world.": "has been read", "Our monthly crafts club is organized by Dre Johnson.": "is organized", "During the summer, Fabiola Torres's ant farm is guarded by my neighbors.": "is guarded", "Ceramic bowls were sculpted on Josuke Higashikata's pottery wheel.": "were sculpted", "A balloon and a juice box have been offered by Archie Andrews's baby cousin.": "have been offered", "The balloon was tied to Ben Gross's wrist by the clown.": "was tied", "Vivian Carter's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "A balloon and a juice box have been offered by Pops Johnson's baby cousin.": "have been offered", "After every storm, mud pies are made in Lucy Hernandez's yard.": "are made", "Trent Harrison will be invited to this event by the secret juggling society.": "will be invited", "The best doodles were found on Kaitlynn Price’s dinner napkins.": "were found", "Fabiola Torres's surfboard is being painted with colorful patterns.": "is being painted", "The marshmallows have been toasted to perfection by Kamala Nandiwadal and me.": "have been toasted", "Tomorrow, the award will be presented to Gertrude Yorkes by the principal.": "will be presented", "Just a few moments ago, the fuzzy tarantula was adopted by Pops Johnson.": "was adopted", "The guests are being entertained by Jotaro Kujo's talking robot.": "are being entertained", "On Sunday, Jughead Jones's plastic watches will be sold at the craft fair.": "will be sold", "Just a few moments ago, the fuzzy tarantula was adopted by Dio Brando.": "was adopted", "Tomorrow morning, Kamala Nandiwadal's bubble gum statue will be mailed to the White House.": "will be mailed", "The best hamburgers in the city are cooked at Mitchell Wilson's diner on Main Street.": "are cooked", "According to Archie Andrews, extra juice boxes are kept behind our teacher's desk.": "are kept", "Kaitlynn Price's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Next week, the best hula dancer will be awarded a slice of Fabiola Torres’s famous apple pie.": "will be awarded", "Lucy Hernandez's colorful collage will be displayed in the lunchroom.": "will be displayed", "The books in the library are being eaten by the caterpillars from Joseph Joestar's garden.": "are being eaten", "Next week, those banners will be hung for Paxton Hall-Yoshida's graduation.": "will be hung", "All Karolina Dean's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Jotaro Kujo's broken glasses will be fixed by the magician.": "will be fixed", "The marshmallows have been toasted to perfection by Pops Johnson and me.": "have been toasted", "Nico Minoru's surfboard is being painted with colorful patterns.": "is being painted", "Elephants were ridden at Eleanor Wong's circus-themed party.": "were ridden", "Every morning, the Zumba class is taught by Karolina Dean.": "is taught", "Last semester, the lead role in the musical was played by Dre Johnson.": "was played", "Jack Johnson's movie about a flying robot was praised by the film critic.": "was praised", "My sketches are being displayed at Joseph Joestar's gallery for a week.": "are being displayed", "Eleanor Wong's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "On Wednesday, an award will be given to Gertrude Yorkes by the dance team.": "will be given", "Every rehearsal, the ballerinas are chased across the stage by Trent Harrison's little brother.": "are chased", "Every rehearsal, the ballerinas are chased across the stage by Dre Johnson's little brother.": "are chased", "Vivian Carter's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Two summers ago, Seth Acosta was sent to the art fair to show his beautiful painting.": "was sent", "Rainbow Johnson was offered a game of Connect Four to play in the car.": "was offered", "A balloon and a juice box have been offered by Kaitlynn Price's baby cousin.": "have been offered", "Mitchell Wilson will be invited to this event by the secret juggling society.": "will be invited", "Next week, the best hula dancer will be awarded a slice of Eleanor Wong’s famous apple pie.": "will be awarded", "Jughead Jones's movie about a flying robot was praised by the film critic.": "was praised", "All Paxton Hall-Yoshida's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Jotaro Kujo’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "Our monthly crafts club is organized by Jotaro Kujo.": "is organized", "The marshmallows have been toasted to perfection by Trent Harrison and me.": "have been toasted", "The best doodles were found on Ben Gross’s dinner napkins.": "were found", "The cake with gold sparkles has been baked for Eleanor Wong.": "has been baked", "Every morning, the Zumba class is taught by Kamala Nandiwadal.": "is taught", "Last semester, the lead role in the musical was played by Molly Hayes Hernandez.": "was played", "Next week, those banners will be hung for Veronica Lodge's graduation.": "will be hung", "Jonathan Joestar's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "The books in the library are being eaten by the caterpillars from Gertrude Yorkes's garden.": "are being eaten", "Cheryl Blossom's CDs were played during the dance party.": "were played", "Jughead Jones's broken glasses will be fixed by the magician.": "will be fixed", "Elephants were ridden at Joseph Joestar's circus-themed party.": "were ridden", "Paxton Hall-Yoshida was offered a game of Connect Four to play in the car.": "was offered", "Vivian Carter's colorful collage will be displayed in the lunchroom.": "will be displayed", "We were directed to Josuke Higashikata’s house by the flashing neon signs.": "were directed", "Jonathan Joestar was offered a game of Connect Four to play in the car.": "was offered", "Tomorrow, the award will be presented to Rainbow Johnson by the principal.": "will be presented", "Ceramic bowls were sculpted on Jotaro Kujo's pottery wheel.": "were sculpted", "Mitchell Wilson's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Vivian Carter’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Every morning, the Zumba class is taught by Jughead Jones.": "is taught", "After every storm, mud pies are made in Kamala Nandiwadal's yard.": "are made", "Next week, the best hula dancer will be awarded a slice of Ben Gross’s famous apple pie.": "will be awarded", "On Sunday, Jotaro Kujo's plastic watches will be sold at the craft fair.": "will be sold", "Dre Johnson's novel about a werewolf has been read all over the world.": "has been read", "A balloon and a juice box have been offered by Fabiola Torres's baby cousin.": "have been offered", "At this very moment, my costume for the show is being designed by Gertrude Yorkes.": "is being designed", "Every rehearsal, the ballerinas are chased across the stage by Dio Brando's little brother.": "are chased", "Karolina Dean's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "The balloon was tied to Kaitlynn Price's wrist by the clown.": "was tied", "Rainbow Johnson's CDs were played during the dance party.": "were played", "The guests are being entertained by Joseph Joestar's talking robot.": "are being entertained", "Just a few moments ago, the fuzzy tarantula was adopted by Josuke Higashikata.": "was adopted", "Lucy Hernandez's comedy routine will be remembered for many years.": "will be remembered", "We were directed to Seth Acosta’s house by the flashing neon signs.": "were directed", "Elephants were ridden at Ben Gross's circus-themed party.": "were ridden", "The best doodles were found on Veronica Lodge’s dinner napkins.": "were found", "Last semester, the lead role in the musical was played by Fabiola Torres.": "was played", "Elephants were ridden at Diane Johnson's circus-themed party.": "were ridden", "Paxton Hall-Yoshida's movie about a flying robot was praised by the film critic.": "was praised", "After every storm, mud pies are made in Nico Minoru's yard.": "are made", "Once a month, my youth football team is coached by Rainbow Johnson.": "is coached", "The cake with gold sparkles has been baked for Jughead Jones.": "has been baked", "Next week, those banners will be hung for Dio Brando's graduation.": "will be hung", "The best doodles were found on Josuke Higashikata’s dinner napkins.": "were found", "A balloon and a juice box have been offered by Molly Hayes Hernandez's baby cousin.": "have been offered", "Eleanor Wong's comedy routine will be remembered for many years.": "will be remembered", "We were directed to Jotaro Kujo’s house by the flashing neon signs.": "were directed", "Karolina Dean's famous crepes are made with fresh strawberries.": "are made", "Every rehearsal, the ballerinas are chased across the stage by Diane Johnson's little brother.": "are chased", "Archie Andrews's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "The balloon was tied to Jack Johnson's wrist by the clown.": "was tied", "Tomorrow, the award will be presented to Lucy Hernandez by the principal.": "will be presented", "Next week, those banners will be hung for Devi Vishwakumar's graduation.": "will be hung", "Goats are groomed on the farm near Fabiola Torres’s house.": "are groomed", "Our monthly crafts club is organized by Pops Johnson.": "is organized", "The books in the library are being eaten by the caterpillars from Nalini Vishwakumar's garden.": "are being eaten", "The best doodles were found on Vivian Carter’s dinner napkins.": "were found", "Lucy Hernandez's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Right now, my finger paints are being used by Kamala Nandiwadal and her cousins.": "are being used", "Seth Acosta’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Ben Gross’s fuzzy green scarf was knit by his elderly uncle.": "was knit", "A balloon and a juice box have been offered by Devi Vishwakumar's baby cousin.": "have been offered", "Two summers ago, Pops Johnson was sent to the art fair to show his beautiful painting.": "was sent", "The cake with gold sparkles has been baked for Jack Johnson.": "has been baked", "After every storm, mud pies are made in Fabiola Torres's yard.": "are made", "Trent Harrison's surfboard is being painted with colorful patterns.": "is being painted", "Molly Hayes Hernandez's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Eleanor Wong's novel about a werewolf has been read all over the world.": "has been read", "The marshmallows have been toasted to perfection by Nico Minoru and me.": "have been toasted", "The guests are being entertained by Vivian Carter's talking robot.": "are being entertained", "The balloon was tied to Dio Brando's wrist by the clown.": "was tied", "On Wednesday, an award will be given to Nico Minoru by the dance team.": "will be given", "My sketches are being displayed at Trent Harrison's gallery for a week.": "are being displayed", "Kaitlynn Price was offered a game of Connect Four to play in the car.": "was offered", "Our monthly crafts club is organized by Diane Johnson.": "is organized", "We were directed to Jack Johnson’s house by the flashing neon signs.": "were directed", "My sketches are being displayed at Chase Stein's gallery for a week.": "are being displayed", "The marshmallows have been toasted to perfection by Molly Hayes Hernandez and me.": "have been toasted", "Devi Vishwakumar's comedy routine will be remembered for many years.": "will be remembered", "Our monthly crafts club is organized by Josuke Higashikata.": "is organized", "The books in the library are being eaten by the caterpillars from Karolina Dean's garden.": "are being eaten", "Rainbow Johnson's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Fabiola Torres’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Two summers ago, Dre Johnson was sent to the art fair to show his beautiful painting.": "was sent", "Gertrude Yorkes was offered a game of Connect Four to play in the car.": "was offered", "Gertrude Yorkes's surfboard is being painted with colorful patterns.": "is being painted", "Josuke Higashikata's novel about a werewolf has been read all over the world.": "has been read", "Last Thursday, the polka class was taught in Eleanor Wong's studio.": "was taught", "Last semester, the lead role in the musical was played by Nico Minoru.": "was played", "Vivian Carter's CDs were played during the dance party.": "were played", "Pops Johnson's movie about a flying robot was praised by the film critic.": "was praised", "All Dre Johnson's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Once a month, my youth football team is coached by Joseph Joestar.": "is coached", "Next week, the best hula dancer will be awarded a slice of Dio Brando’s famous apple pie.": "will be awarded", "Right now, my finger paints are being used by Veronica Lodge and her cousins.": "are being used", "The marshmallows have been toasted to perfection by Jotaro Kujo and me.": "have been toasted", "Elephants were ridden at Karolina Dean's circus-themed party.": "were ridden", "The best doodles were found on Chase Stein’s dinner napkins.": "were found", "Just a few moments ago, the fuzzy tarantula was adopted by Jack Johnson.": "was adopted", "Eleanor Wong was handed a key to open the buried treasure.": "was handed", "Kaitlynn Price's novel about a werewolf has been read all over the world.": "has been read", "The best hamburgers in the city are cooked at Vivian Carter's diner on Main Street.": "are cooked", "The guests are being entertained by Dio Brando's talking robot.": "are being entertained", "During the summer, Ben Gross's ant farm is guarded by my neighbors.": "is guarded", "We were directed to Vivian Carter’s house by the flashing neon signs.": "were directed", "Seth Acosta's movie about a flying robot was praised by the film critic.": "was praised", "Goats are groomed on the farm near Karolina Dean’s house.": "are groomed", "Rainbow Johnson's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Once a month, my youth football team is coached by Nalini Vishwakumar.": "is coached", "Joseph Joestar will be invited to this event by the secret juggling society.": "will be invited", "At this very moment, my costume for the show is being designed by Jughead Jones.": "is being designed", "Jonathan Joestar's CDs were played during the dance party.": "were played", "Every rehearsal, the ballerinas are chased across the stage by Ben Gross's little brother.": "are chased", "My sketches are being displayed at Cheryl Blossom's gallery for a week.": "are being displayed", "The guests are being entertained by Jonathan Joestar's talking robot.": "are being entertained", "During the summer, Karolina Dean's ant farm is guarded by my neighbors.": "is guarded", "On Sunday, Gertrude Yorkes's plastic watches will be sold at the craft fair.": "will be sold", "Archie Andrews’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Trent Harrison's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Jack Johnson was handed a key to open the buried treasure.": "was handed", "All Nalini Vishwakumar's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Elephants were ridden at Lucy Hernandez's circus-themed party.": "were ridden", "The guests are being entertained by Pops Johnson's talking robot.": "are being entertained", "Nalini Vishwakumar’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "Molly Hayes Hernandez's CDs were played during the dance party.": "were played", "Tomorrow morning, Gertrude Yorkes's bubble gum statue will be mailed to the White House.": "will be mailed", "The balloon was tied to Nico Minoru's wrist by the clown.": "was tied", "Every morning, the Zumba class is taught by Dio Brando.": "is taught", "Next week, those banners will be hung for Diane Johnson's graduation.": "will be hung", "Right now, my finger paints are being used by Eleanor Wong and her cousins.": "are being used", "Once a month, my youth football team is coached by Paxton Hall-Yoshida.": "is coached", "According to Nico Minoru, extra juice boxes are kept behind our teacher's desk.": "are kept", "Alex Wilder's surfboard is being painted with colorful patterns.": "is being painted", "Pops Johnson's colorful collage will be displayed in the lunchroom.": "will be displayed", "My sketches are being displayed at Dre Johnson's gallery for a week.": "are being displayed", "All Devi Vishwakumar's stuffed animals were pulled along in the wheelbarrow.": "were pulled", "Jughead Jones was handed a key to open the buried treasure.": "was handed", "Last Thursday, the polka class was taught in Archie Andrews's studio.": "was taught", "Alex Wilder's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Every rehearsal, the ballerinas are chased across the stage by Devi Vishwakumar's little brother.": "are chased", "The guests are being entertained by Dre Johnson's talking robot.": "are being entertained", "Goats are groomed on the farm near Nico Minoru’s house.": "are groomed", "During the summer, Nalini Vishwakumar's ant farm is guarded by my neighbors.": "is guarded", "The best doodles were found on Cheryl Blossom’s dinner napkins.": "were found", "Chase Stein's movie about a flying robot was praised by the film critic.": "was praised", "Karolina Dean's broken glasses will be fixed by the magician.": "will be fixed", "Jonathan Joestar's lucky boomerang is being tossed in the park by the toddlers.": "is being tossed", "Next week, those banners will be hung for Seth Acosta's graduation.": "will be hung", "According to Devi Vishwakumar, extra juice boxes are kept behind our teacher's desk.": "are kept", "Mitchell Wilson was handed a key to open the buried treasure.": "was handed", "We were directed to Diane Johnson’s house by the flashing neon signs.": "were directed", "Lucy Hernandez's CDs were played during the dance party.": "were played", "Our monthly crafts club is organized by Kaitlynn Price.": "is organized", "Archie Andrews will be invited to this event by the secret juggling society.": "will be invited", "Every rehearsal, the ballerinas are chased across the stage by Pops Johnson's little brother.": "are chased", "Ceramic bowls were sculpted on Mitchell Wilson's pottery wheel.": "were sculpted", "Nalini Vishwakumar was offered a game of Connect Four to play in the car.": "was offered", "The best hamburgers in the city are cooked at Seth Acosta's diner on Main Street.": "are cooked", "Jughead Jones's electric scooter is being repaired at the mechanic's shop.": "is being repaired", "Chase Stein's colorful collage will be displayed in the lunchroom.": "will be displayed", "Tomorrow morning, Vivian Carter's bubble gum statue will be mailed to the White House.": "will be mailed", "At this very moment, my costume for the show is being designed by Pops Johnson.": "is being designed", "Chase Stein's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Cheryl Blossom's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Right now, my finger paints are being used by Dio Brando and his cousins.": "are being used", "Next week, those banners will be hung for Pops Johnson's graduation.": "will be hung", "During the summer, Dio Brando's ant farm is guarded by my neighbors.": "is guarded", "The books in the library are being eaten by the caterpillars from Dre Johnson's garden.": "are being eaten", "Kamala Nandiwadal’s fuzzy green scarf was knit by her elderly aunt.": "was knit", "Every rehearsal, the ballerinas are chased across the stage by Chase Stein's little brother.": "are chased", "Next week, those banners will be hung for Ben Gross's graduation.": "will be hung", "Karolina Dean's birthday cake is being decorated with frosting and real flower petals.": "is being decorated", "Our monthly crafts club is organized by Jughead Jones.": "is organized", "Once a month, my youth football team is coached by Mitchell Wilson.": "is coached", "After every storm, mud pies are made in Josuke Higashikata's yard.": "are made", "Veronica Lodge's video of her cat has been viewed on YouTube over a million times.": "has been viewed", "Last Thursday, the polka class was taught in Jotaro Kujo's studio.": "was taught", "Just a few moments ago, the fuzzy tarantula was adopted by Devi Vishwakumar.": "was adopted", "Right now, my finger paints are being used by Paxton Hall-Yoshida and his cousins.": "are being used", "Tomorrow morning, Molly Hayes Hernandez's bubble gum statue will be mailed to the White House.": "will be mailed", "We were directed to Nalini Vishwakumar’s house by the flashing neon signs.": "were directed", "Vivian Carter's broken glasses will be fixed by the magician.": "will be fixed", "Fabiola Torres's colorful collage will be displayed in the lunchroom.": "will be displayed", "The cake with gold sparkles has been baked for Rainbow Johnson.": "has been baked", "Our monthly crafts club is organized by Trent Harrison.": "is organized", "Paxton Hall-Yoshida's CDs were played during the dance party.": "were played", "Last Thursday, the polka class was taught in Jughead Jones's studio.": "was taught", "Goats are groomed on the farm near Dio Brando’s house.": "are groomed", "Right now, my finger paints are being used by Alex Wilder and his cousins.": "are being used", "According to Josuke Higashikata, extra juice boxes are kept behind our teacher's desk.": "are kept", "Ceramic bowls were sculpted on Jughead Jones's pottery wheel.": "were sculpted", "The marshmallows have been toasted to perfection by Chase Stein and me.": "have been toasted", "Jack Johnson's video of his cat has been viewed on YouTube over a million times.": "has been viewed", "Paxton Hall-Yoshida’s duffle bag is being filled with protein bars and Gatorade.": "is being filled", "The best hamburgers in the city are cooked at Nalini Vishwakumar's diner on Main Street.": "are cooked", "Joseph Joestar's surfboard is being painted with colorful patterns.": "is being painted", "Nico Minoru's colorful collage will be displayed in the lunchroom.": "will be displayed", "The books in the library are being eaten by the caterpillars from Dio Brando's garden.": "are being eaten", "After every storm, mud pies are made in Diane Johnson's yard.": "are made", "Once a month, my youth football team is coached by Diane Johnson.": "is coached", "Alex Wilder's novel about a werewolf has been read all over the world.": "has been read", "During the summer, Molly Hayes Hernandez's ant farm is guarded by my neighbors.": "is guarded"}}