{"Add or remove commas, if necessary, until the sentence has correct punctuation.": {"The children left slippery banana peels all over Nalini Vishwakumar's clean floor.": "no_comma", "The astronaut inspired Nico Minoru to sign up for space camp.": "no_comma", "When the radio station plays country music Cheryl Blossom sings louder than everyone else.": "Cheryl", "In the dentist's waiting room Trent Harrison read a magazine article about baby elephants.": "Trent", "I ride my scooter past Jotaro Kujo's comic book store on the way to school.": "no_comma", "Molly Hayes Hernandez loves playing the triangle in our school's marching band.": "no_comma", "The mayor rode a motorcycle past Veronica Lodge's house during the parade.": "no_comma", "After she saw the Broadway play Kaitlynn Price waited outside to meet the actors.": "Kaitlynn", "I never knew that Josuke Higashikata could beatbox until I heard him at the hip-hop festival.": "no_comma", "Until I learn how to drive Jonathan Joestar will have to take me to soccer practice.": "Jonathan", "Because he loves the smell of freshly cut grass Paxton Hall-Yoshida volunteered to mow the lawn.": "Paxton", "Dre Johnson and I go camping in the Rocky Mountains every summer.": "no_comma", "During the championship soccer match Diane Johnson did cartwheels in front of the goal.": "Diane", "The actress signed autographs for Alex Wilder and his friends.": "no_comma", "Inside the spy's secret headquarters Devi Vishwakumar learned about the upcoming mission.": "Devi", "Showing off his new cooking skills Archie Andrews flipped the pancake behind his back.": "Archie", "With an instrument in each hand Jughead Jones put on a concert all by himself.": "Jughead", "Sniffing the soggy tuna sandwich Joseph Joestar decided to eat a salad instead.": "Joseph", "Jumping on the trampoline Mitchell Wilson did a split and touched his toes.": "Mitchell", "After her cousin's ballet recital Gertrude Yorkes threw roses onto the stage.": "Gertrude", "During the tour of the Transylvanian castle Chase Stein kept an eye out for vampires.": "Chase", "Jogging through the park Vivian Carter waved to everyone she saw.": "Vivian", "The boys on Jack Johnson's swim team enjoy practicing their dives at the lake.": "no_comma", "Pops Johnson likes wearing polka dots and stripes at the same time.": "no_comma", "Slurping her chicken noodle soup Fabiola Torres had already decided to have another bowl.": "Fabiola", "Before she went on vacation Lucy Hernandez bought a new neon swimsuit.": "Lucy", "Unless I serve cinnamon rolls at my party Kamala Nandiwadal will not attend.": "Kamala", "When she eats cereal Eleanor Wong always adds two cups of milk.": "Eleanor", "The mailman needed help carrying presents to Karolina Dean's door.": "no_comma", "Rainbow Johnson dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "Seth Acosta plays dodgeball in the house on rainy days.": "no_comma", "Ben Gross updates his blog every day unless his favorite TV show is on.": "no_comma", "Dio Brando started reading science fiction books after the library added a new section.": "no_comma", "At the mall food court Jughead Jones couldn't decide which soda he wanted.": "Jughead", "I never knew that Rainbow Johnson could beatbox until I heard her at the hip-hop festival.": "no_comma", "Josuke Higashikata is considering moving to Cairo next year.": "no_comma", "Standing on the step stool Dre Johnson could almost reach the cookie jar.": "Dre", "My rabbit hides carrots under Trent Harrison's couch.": "no_comma", "Eleanor Wong enjoys making clay models of her dog.": "no_comma", "Joseph Joestar refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Fabiola Torres keeps planting palm trees all over town.": "no_comma", "During the national yo-yo convention Kaitlynn Price volunteered to teach the crowd some tricks.": "Kaitlynn", "Since he tried blueberry ice cream Mitchell Wilson has refused to eat any other flavor.": "Mitchell", "From the top floor of the office building Veronica Lodge could see the entire city.": "Veronica", "Walking through the elves' workshop Jonathan Joestar inspected the handmade toys.": "Jonathan", "The musicians held a free concert at Molly Hayes Hernandez's school.": "no_comma", "Nico Minoru updates her blog every day unless her favorite TV show is on.": "no_comma", "Singing at the top of her lungs Gertrude Yorkes woke up most of her neighbors.": "Gertrude", "Jack Johnson keeps planning to visit aliens in outer space.": "no_comma", "Pops Johnson enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "From the International Space Station Veronica Lodge sent an email to my science class.": "Veronica", "Slurping his chicken noodle soup Dre Johnson had already decided to have another bowl.": "Dre", "Chase Stein is considering moving to Cairo next year.": "no_comma", "Vivian Carter likes wearing polka dots and stripes at the same time.": "no_comma", "Sitting in the movie theater Nico Minoru realized she had forgotten to buy popcorn.": "Nico", "Gertrude Yorkes plays dodgeball in the house on rainy days.": "no_comma", "The mayor rode a motorcycle past Jotaro Kujo's house during the parade.": "no_comma", "Because she invented a flying car Lucy Hernandez became a worldwide celebrity.": "Lucy", "Inside the spy's secret headquarters Karolina Dean learned about the upcoming mission.": "Karolina", "During the championship soccer match Molly Hayes Hernandez did cartwheels in front of the goal.": "Molly", "The astronaut inspired Seth Acosta to sign up for space camp.": "no_comma", "The actress signed autographs for Nalini Vishwakumar and her friends.": "no_comma", "Dio Brando updates his blog every day unless his favorite TV show is on.": "no_comma", "Devi Vishwakumar keeps planting palm trees all over town.": "no_comma", "Paxton Hall-Yoshida enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "Diane Johnson keeps planning to visit aliens in outer space.": "no_comma", "Jogging through the park Ben Gross waved to everyone he saw.": "Ben", "Unless I serve cinnamon rolls at my party Eleanor Wong will not attend.": "Eleanor", "The boys on Jonathan Joestar's swim team enjoy practicing their dives at the lake.": "no_comma", "Before she went on vacation Kamala Nandiwadal bought a new neon swimsuit.": "Kamala", "Before he joins the chess team Mitchell Wilson wants me to help him practice.": "Mitchell", "Jughead Jones and I go camping in the Rocky Mountains every summer.": "no_comma", "Josuke Higashikata dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Walking through the elves' workshop Pops Johnson inspected the handmade toys.": "Pops", "Archie Andrews loves playing the triangle in our school's marching band.": "no_comma", "Singing at the top of her lungs Fabiola Torres woke up most of her neighbors.": "Fabiola", "Fishing in the lake Cheryl Blossom tried not to get water in her boots.": "Cheryl", "Trent Harrison's cat loves swimming in the kiddie pool.": "no_comma", "Jumping on the trampoline Joseph Joestar did a split and touched his toes.": "Joseph", "Rainbow Johnson enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "On the park's fastest roller coaster Jack Johnson's baseball cap flew off his head.": "Jack", "From the top floor of the office building Alex Wilder could see the entire city.": "Alex", "My rabbit hides carrots under Devi Vishwakumar's couch.": "no_comma", "Using the coupon Mitchell Wilson got twenty extra tokens at the arcade.": "Mitchell", "Seth Acosta started reading science fiction books after the library added a new section.": "no_comma", "With an instrument in each hand Josuke Higashikata put on a concert all by himself.": "Josuke", "Standing on the step stool Kamala Nandiwadal could almost reach the cookie jar.": "Kamala", "At the mall food court Trent Harrison couldn't decide which soda he wanted.": "Trent", "The children left slippery banana peels all over Archie Andrews's clean floor.": "no_comma", "Alex Wilder refuses to eat celery unless it's covered in peanut butter.": "no_comma", "During the national yo-yo convention Nico Minoru volunteered to teach the crowd some tricks.": "Nico", "The musicians held a free concert at Jotaro Kujo's school.": "no_comma", "I ride my scooter past Veronica Lodge's comic book store on the way to school.": "no_comma", "Since he tried blueberry ice cream Dio Brando has refused to eat any other flavor.": "Dio", "Until I learn how to drive Jack Johnson will have to take me to soccer practice.": "Jack", "Because he loves the smell of freshly cut grass Jonathan Joestar volunteered to mow the lawn.": "Jonathan", "I never knew that Dre Johnson could beatbox until I heard him at the hip-hop festival.": "no_comma", "Diane Johnson started reading science fiction books after the library added a new section.": "no_comma", "Before he joins the chess team Dre Johnson wants me to help him practice.": "Dre", "Devi Vishwakumar is considering moving to Cairo next year.": "no_comma", "From the International Space Station Seth Acosta sent an email to my science class.": "Seth", "After his cousin's ballet recital Paxton Hall-Yoshida threw roses onto the stage.": "Paxton", "I never knew that Nalini Vishwakumar could beatbox until I heard her at the hip-hop festival.": "no_comma", "Veronica Lodge started reading science fiction books after the library added a new section.": "no_comma", "Molly Hayes Hernandez refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Sitting in the movie theater Rainbow Johnson realized she had forgotten to buy popcorn.": "Rainbow", "When the radio station plays country music Jonathan Joestar sings louder than everyone else.": "Jonathan", "Using the coupon Jughead Jones got twenty extra tokens at the arcade.": "Jughead", "During the tour of the Transylvanian castle Nico Minoru kept an eye out for vampires.": "Nico", "The mayor rode a motorcycle past Jack Johnson's house during the parade.": "no_comma", "Eleanor Wong keeps planning to visit aliens in outer space.": "no_comma", "Because he invented a flying car Chase Stein became a worldwide celebrity.": "Chase", "Inside the spy's secret headquarters Joseph Joestar learned about the upcoming mission.": "Joseph", "The boys on Alex Wilder's swim team enjoy practicing their dives at the lake.": "no_comma", "At the mall food court Vivian Carter couldn't decide which soda she wanted.": "Vivian", "In the dentist's waiting room Cheryl Blossom read a magazine article about baby elephants.": "Cheryl", "Lucy Hernandez and I go camping in the Rocky Mountains every summer.": "no_comma", "With an instrument in each hand Archie Andrews put on a concert all by himself.": "Archie", "The astronaut inspired Trent Harrison to sign up for space camp.": "no_comma", "Mitchell Wilson dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Diane Johnson keeps planting palm trees all over town.": "no_comma", "Ben Gross enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "Since he tried blueberry ice cream Jotaro Kujo has refused to eat any other flavor.": "Jotaro", "Walking through the elves' workshop Josuke Higashikata inspected the handmade toys.": "Josuke", "Fabiola Torres updates her blog every day unless her favorite TV show is on.": "no_comma", "Jumping on the trampoline Kaitlynn Price did a split and touched her toes.": "Kaitlynn", "The musicians held a free concert at Pops Johnson's school.": "no_comma", "Dio Brando likes wearing polka dots and stripes at the same time.": "no_comma", "My rabbit hides carrots under Gertrude Yorkes's couch.": "no_comma", "After she saw the Broadway play Nico Minoru waited outside to meet the actors.": "Nico", "Sniffing the soggy tuna sandwich Dio Brando decided to eat a salad instead.": "Dio", "On the park's fastest roller coaster Cheryl Blossom's baseball cap flew off her head.": "Cheryl", "Josuke Higashikata's cat loves swimming in the kiddie pool.": "no_comma", "Jogging through the park Karolina Dean waved to everyone she saw.": "Karolina", "Paxton Hall-Yoshida refuses to eat celery unless it's covered in peanut butter.": "no_comma", "The children left slippery banana peels all over Devi Vishwakumar's clean floor.": "no_comma", "Until I learn how to drive Pops Johnson will have to take me to soccer practice.": "Pops", "I never knew that Seth Acosta could beatbox until I heard him at the hip-hop festival.": "no_comma", "Eleanor Wong loves playing the triangle in our school's marching band.": "no_comma", "Showing off her new cooking skills Vivian Carter flipped the pancake behind her back.": "Vivian", "I ride my scooter past Jack Johnson's comic book store on the way to school.": "no_comma", "When he eats cereal Jotaro Kujo always adds two cups of milk.": "Jotaro", "Because she loves the smell of freshly cut grass Rainbow Johnson volunteered to mow the lawn.": "Rainbow", "Molly Hayes Hernandez dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "Fishing in the lake Joseph Joestar tried not to get water in his boots.": "Joseph", "Jonathan Joestar enjoys making clay models of his dog.": "no_comma", "Gertrude Yorkes enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "The mayor rode a motorcycle past Chase Stein's house during the parade.": "no_comma", "Before he went on vacation Josuke Higashikata bought a new neon swimsuit.": "Josuke", "Singing at the top of his lungs Trent Harrison woke up most of his neighbors.": "Trent", "After his cousin's ballet recital Mitchell Wilson threw roses onto the stage.": "Mitchell", "During the championship soccer match Paxton Hall-Yoshida did cartwheels in front of the goal.": "Paxton", "When the radio station plays country music Alex Wilder sings louder than everyone else.": "Alex", "Rainbow Johnson loves playing the triangle in our school's marching band.": "no_comma", "Dre Johnson keeps planning to visit aliens in outer space.": "no_comma", "Because she invented a flying car Kaitlynn Price became a worldwide celebrity.": "Kaitlynn", "From the top floor of the office building Ben Gross could see the entire city.": "Ben", "During the national yo-yo convention Veronica Lodge volunteered to teach the crowd some tricks.": "Veronica", "Pops Johnson's cat loves swimming in the kiddie pool.": "no_comma", "When she eats cereal Cheryl Blossom always adds two cups of milk.": "Cheryl", "Showing off her new cooking skills Nalini Vishwakumar flipped the pancake behind her back.": "Nalini", "The mailman needed help carrying presents to Vivian Carter's door.": "no_comma", "Slurping his chicken noodle soup Archie Andrews had already decided to have another bowl.": "Archie", "The children left slippery banana peels all over Karolina Dean's clean floor.": "no_comma", "Eleanor Wong started reading science fiction books after the library added a new section.": "no_comma", "In the dentist's waiting room Joseph Joestar read a magazine article about baby elephants.": "Joseph", "From the International Space Station Lucy Hernandez sent an email to my science class.": "Lucy", "Before she joins the chess team Kamala Nandiwadal wants me to help her practice.": "Kamala", "At the mall food court Diane Johnson couldn't decide which soda she wanted.": "Diane", "Because she loves the smell of freshly cut grass Devi Vishwakumar volunteered to mow the lawn.": "Devi", "I never knew that Molly Hayes Hernandez could beatbox until I heard her at the hip-hop festival.": "no_comma", "Until I learn how to drive Dio Brando will have to take me to soccer practice.": "Dio", "Nico Minoru dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "Sniffing the soggy tuna sandwich Jotaro Kujo decided to eat a salad instead.": "Jotaro", "Seth Acosta likes wearing polka dots and stripes at the same time.": "no_comma", "On the park's fastest roller coaster Jughead Jones's baseball cap flew off his head.": "Jughead", "My rabbit hides carrots under Lucy Hernandez's couch.": "no_comma", "Jack Johnson plays dodgeball in the house on rainy days.": "no_comma", "The astronaut inspired Kaitlynn Price to sign up for space camp.": "no_comma", "Veronica Lodge refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Sitting in the movie theater Seth Acosta realized he had forgotten to buy popcorn.": "Seth", "I ride my scooter past Jonathan Joestar's comic book store on the way to school.": "no_comma", "During the tour of the Transylvanian castle Fabiola Torres kept an eye out for vampires.": "Fabiola", "Unless I serve cinnamon rolls at my party Devi Vishwakumar will not attend.": "Devi", "Standing on the step stool Trent Harrison could almost reach the cookie jar.": "Trent", "Using the coupon Josuke Higashikata got twenty extra tokens at the arcade.": "Josuke", "The actress signed autographs for Kamala Nandiwadal and her friends.": "no_comma", "Molly Hayes Hernandez is considering moving to Cairo next year.": "no_comma", "Cheryl Blossom enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Fishing in the lake Jughead Jones tried not to get water in his boots.": "Jughead", "The musicians held a free concert at Nico Minoru's school.": "no_comma", "The actress signed autographs for Dio Brando and his friends.": "no_comma", "The mailman needed help carrying presents to Devi Vishwakumar's door.": "no_comma", "Before he went on vacation Archie Andrews bought a new neon swimsuit.": "Archie", "Nalini Vishwakumar started reading science fiction books after the library added a new section.": "no_comma", "Trent Harrison is considering moving to Cairo next year.": "no_comma", "Since he tried blueberry ice cream Josuke Higashikata has refused to eat any other flavor.": "Josuke", "Slurping his chicken noodle soup Chase Stein had already decided to have another bowl.": "Chase", "Sniffing the soggy tuna sandwich Vivian Carter decided to eat a salad instead.": "Vivian", "Seth Acosta and I go camping in the Rocky Mountains every summer.": "no_comma", "Kaitlynn Price loves playing the triangle in our school's marching band.": "no_comma", "Standing on the step stool Veronica Lodge could almost reach the cookie jar.": "Veronica", "When the radio station plays country music Jughead Jones sings louder than everyone else.": "Jughead", "Showing off her new cooking skills Cheryl Blossom flipped the pancake behind her back.": "Cheryl", "Pops Johnson refuses to eat celery unless it's covered in peanut butter.": "no_comma", "My rabbit hides carrots under Mitchell Wilson's couch.": "no_comma", "During the tour of the Transylvanian castle Gertrude Yorkes kept an eye out for vampires.": "Gertrude", "After her cousin's ballet recital Karolina Dean threw roses onto the stage.": "Karolina", "Jack Johnson enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "During the national yo-yo convention Ben Gross volunteered to teach the crowd some tricks.": "Ben", "Unless I serve cinnamon rolls at my party Fabiola Torres will not attend.": "Fabiola", "Singing at the top of her lungs Nico Minoru woke up most of her neighbors.": "Nico", "Jotaro Kujo dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Kamala Nandiwadal's cat loves swimming in the kiddie pool.": "no_comma", "Paxton Hall-Yoshida likes wearing polka dots and stripes at the same time.": "no_comma", "After she saw the Broadway play Eleanor Wong waited outside to meet the actors.": "Eleanor", "The mayor rode a motorcycle past Diane Johnson's house during the parade.": "no_comma", "Jonathan Joestar started reading science fiction books after the library added a new section.": "no_comma", "The astronaut inspired Dre Johnson to sign up for space camp.": "no_comma", "In the dentist's waiting room Lucy Hernandez read a magazine article about baby elephants.": "Lucy", "Molly Hayes Hernandez enjoys making clay models of her dog.": "no_comma", "The children left slippery banana peels all over Rainbow Johnson's clean floor.": "no_comma", "During the championship soccer match Gertrude Yorkes did cartwheels in front of the goal.": "Gertrude", "Jumping on the trampoline Jughead Jones did a split and touched his toes.": "Jughead", "Because he invented a flying car Trent Harrison became a worldwide celebrity.": "Trent", "Walking through the elves' workshop Karolina Dean inspected the handmade toys.": "Karolina", "Nalini Vishwakumar plays dodgeball in the house on rainy days.": "no_comma", "Mitchell Wilson updates his blog every day unless his favorite TV show is on.": "no_comma", "From the top floor of the office building Jonathan Joestar could see the entire city.": "Jonathan", "Before he joins the chess team Archie Andrews wants me to help him practice.": "Archie", "I never knew that Veronica Lodge could beatbox until I heard her at the hip-hop festival.": "no_comma", "I ride my scooter past Devi Vishwakumar's comic book store on the way to school.": "no_comma", "With an instrument in each hand Ben Gross put on a concert all by himself.": "Ben", "Using the coupon Lucy Hernandez got twenty extra tokens at the arcade.": "Lucy", "Jogging through the park Seth Acosta waved to everyone he saw.": "Seth", "When she eats cereal Rainbow Johnson always adds two cups of milk.": "Rainbow", "The girls on Vivian Carter's swim team enjoy practicing their dives at the lake.": "no_comma", "The mayor rode a motorcycle past Lucy Hernandez's house during the parade.": "no_comma", "I ride my scooter past Alex Wilder's comic book store on the way to school.": "no_comma", "I never knew that Pops Johnson could beatbox until I heard him at the hip-hop festival.": "no_comma", "On the park's fastest roller coaster Rainbow Johnson's baseball cap flew off her head.": "Rainbow", "The children left slippery banana peels all over Joseph Joestar's clean floor.": "no_comma", "From the top floor of the office building Dio Brando could see the entire city.": "Dio", "Diane Johnson plays dodgeball in the house on rainy days.": "no_comma", "Vivian Carter keeps planning to visit aliens in outer space.": "no_comma", "Jogging through the park Jotaro Kujo waved to everyone he saw.": "Jotaro", "Because she loves the smell of freshly cut grass Eleanor Wong volunteered to mow the lawn.": "Eleanor", "During the championship soccer match Seth Acosta did cartwheels in front of the goal.": "Seth", "Fabiola Torres dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "Kamala Nandiwadal enjoys making clay models of her dog.": "no_comma", "Paxton Hall-Yoshida updates his blog every day unless his favorite TV show is on.": "no_comma", "Since she tried blueberry ice cream Nico Minoru has refused to eat any other flavor.": "Nico", "During the national yo-yo convention Nalini Vishwakumar volunteered to teach the crowd some tricks.": "Nalini", "My rabbit hides carrots under Archie Andrews's couch.": "no_comma", "Standing on the step stool Jack Johnson could almost reach the cookie jar.": "Jack", "Inside the spy's secret headquarters Jonathan Joestar learned about the upcoming mission.": "Jonathan", "With an instrument in each hand Dre Johnson put on a concert all by himself.": "Dre", "Ben Gross refuses to eat celery unless it's covered in peanut butter.": "no_comma", "At the mall food court Josuke Higashikata couldn't decide which soda he wanted.": "Josuke", "Because he invented a flying car Jughead Jones became a worldwide celebrity.": "Jughead", "After he saw the Broadway play Mitchell Wilson waited outside to meet the actors.": "Mitchell", "I never knew that Chase Stein could beatbox until I heard him at the hip-hop festival.": "no_comma", "Jumping on the trampoline Molly Hayes Hernandez did a split and touched her toes.": "Molly", "Before she joins the chess team Karolina Dean wants me to help her practice.": "Karolina", "Trent Harrison likes wearing polka dots and stripes at the same time.": "no_comma", "Devi Vishwakumar and I go camping in the Rocky Mountains every summer.": "no_comma", "Kaitlynn Price keeps planting palm trees all over town.": "no_comma", "The mailman needed help carrying presents to Gertrude Yorkes's door.": "no_comma", "Walking through the elves' workshop Alex Wilder inspected the handmade toys.": "Alex", "When the radio station plays country music Nalini Vishwakumar sings louder than everyone else.": "Nalini", "Singing at the top of his lungs Jughead Jones woke up most of his neighbors.": "Jughead", "Gertrude Yorkes started reading science fiction books after the library added a new section.": "no_comma", "Slurping his chicken noodle soup Josuke Higashikata had already decided to have another bowl.": "Josuke", "When she eats cereal Vivian Carter always adds two cups of milk.": "Vivian", "Dre Johnson's cat loves swimming in the kiddie pool.": "no_comma", "Diane Johnson updates her blog every day unless her favorite TV show is on.": "no_comma", "Cheryl Blossom is considering moving to Cairo next year.": "no_comma", "Before he went on vacation Trent Harrison bought a new neon swimsuit.": "Trent", "The actress signed autographs for Veronica Lodge and her friends.": "no_comma", "The boys on Joseph Joestar's swim team enjoy practicing their dives at the lake.": "no_comma", "The musicians held a free concert at Eleanor Wong's school.": "no_comma", "Dre Johnson keeps planting palm trees all over town.": "no_comma", "Inside the spy's secret headquarters Ben Gross learned about the upcoming mission.": "Ben", "Using the coupon Veronica Lodge got twenty extra tokens at the arcade.": "Veronica", "Dio Brando keeps planning to visit aliens in outer space.": "no_comma", "When the radio station plays country music Fabiola Torres sings louder than everyone else.": "Fabiola", "I never knew that Joseph Joestar could beatbox until I heard him at the hip-hop festival.": "no_comma", "Showing off his new cooking skills Mitchell Wilson flipped the pancake behind his back.": "Mitchell", "Jumping on the trampoline Vivian Carter did a split and touched her toes.": "Vivian", "The actress signed autographs for Trent Harrison and his friends.": "no_comma", "When she eats cereal Lucy Hernandez always adds two cups of milk.": "Lucy", "Jogging through the park Cheryl Blossom waved to everyone she saw.": "Cheryl", "Fishing in the lake Kaitlynn Price tried not to get water in her boots.": "Kaitlynn", "Jughead Jones's cat loves swimming in the kiddie pool.": "no_comma", "Sitting in the movie theater Kamala Nandiwadal realized she had forgotten to buy popcorn.": "Kamala", "Sniffing the soggy tuna sandwich Diane Johnson decided to eat a salad instead.": "Diane", "The astronaut inspired Chase Stein to sign up for space camp.": "no_comma", "Paxton Hall-Yoshida started reading science fiction books after the library added a new section.": "no_comma", "Archie Andrews enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "Before he went on vacation Jack Johnson bought a new neon swimsuit.": "Jack", "Nico Minoru plays dodgeball in the house on rainy days.": "no_comma", "After his cousin's ballet recital Seth Acosta threw roses onto the stage.": "Seth", "Because he loves the smell of freshly cut grass Alex Wilder volunteered to mow the lawn.": "Alex", "The mailman needed help carrying presents to Jotaro Kujo's door.": "no_comma", "The mayor rode a motorcycle past Karolina Dean's house during the parade.": "no_comma", "Gertrude Yorkes is considering moving to Cairo next year.": "no_comma", "At the mall food court Pops Johnson couldn't decide which soda he wanted.": "Pops", "With an instrument in each hand Devi Vishwakumar put on a concert all by herself.": "Devi", "My rabbit hides carrots under Jonathan Joestar's couch.": "no_comma", "The girls on Molly Hayes Hernandez's swim team enjoy practicing their dives at the lake.": "no_comma", "Since she tried blueberry ice cream Gertrude Yorkes has refused to eat any other flavor.": "Gertrude", "The children left slippery banana peels all over Seth Acosta's clean floor.": "no_comma", "During the tour of the Transylvanian castle Karolina Dean kept an eye out for vampires.": "Karolina", "Ben Gross and I go camping in the Rocky Mountains every summer.": "no_comma", "After he saw the Broadway play Chase Stein waited outside to meet the actors.": "Chase", "Unless I serve cinnamon rolls at my party Veronica Lodge will not attend.": "Veronica", "I ride my scooter past Vivian Carter's comic book store on the way to school.": "no_comma", "Jotaro Kujo enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "Archie Andrews refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Alex Wilder updates his blog every day unless his favorite TV show is on.": "no_comma", "In the dentist's waiting room Jonathan Joestar read a magazine article about baby elephants.": "Jonathan", "Dio Brando enjoys making clay models of his dog.": "no_comma", "Devi Vishwakumar started reading science fiction books after the library added a new section.": "no_comma", "Cheryl Blossom loves playing the triangle in our school's marching band.": "no_comma", "Walking through the elves' workshop Nalini Vishwakumar inspected the handmade toys.": "Nalini", "Until I learn how to drive Josuke Higashikata will have to take me to soccer practice.": "Josuke", "From the International Space Station Dre Johnson sent an email to my science class.": "Dre", "The girls on Diane Johnson's swim team enjoy practicing their dives at the lake.": "no_comma", "The astronaut inspired Pops Johnson to sign up for space camp.": "no_comma", "Cheryl Blossom started reading science fiction books after the library added a new section.": "no_comma", "Showing off his new cooking skills Josuke Higashikata flipped the pancake behind his back.": "Josuke", "Paxton Hall-Yoshida is considering moving to Cairo next year.": "no_comma", "Eleanor Wong plays dodgeball in the house on rainy days.": "no_comma", "The mailman needed help carrying presents to Trent Harrison's door.": "no_comma", "After he saw the Broadway play Dre Johnson waited outside to meet the actors.": "Dre", "After his cousin's ballet recital Jonathan Joestar threw roses onto the stage.": "Jonathan", "I ride my scooter past Kaitlynn Price's comic book store on the way to school.": "no_comma", "On the park's fastest roller coaster Veronica Lodge's baseball cap flew off her head.": "Veronica", "During the tour of the Transylvanian castle Archie Andrews kept an eye out for vampires.": "Archie", "Because he loves the smell of freshly cut grass Jack Johnson volunteered to mow the lawn.": "Jack", "In the dentist's waiting room Kamala Nandiwadal read a magazine article about baby elephants.": "Kamala", "Before he joins the chess team Jughead Jones wants me to help him practice.": "Jughead", "At the mall food court Seth Acosta couldn't decide which soda he wanted.": "Seth", "Standing on the step stool Ben Gross could almost reach the cookie jar.": "Ben", "Devi Vishwakumar's cat loves swimming in the kiddie pool.": "no_comma", "Jogging through the park Dio Brando waved to everyone he saw.": "Dio", "Sniffing the soggy tuna sandwich Gertrude Yorkes decided to eat a salad instead.": "Gertrude", "Alex Wilder and I go camping in the Rocky Mountains every summer.": "no_comma", "Until I learn how to drive Jotaro Kujo will have to take me to soccer practice.": "Jotaro", "Unless I serve cinnamon rolls at my party Lucy Hernandez will not attend.": "Lucy", "During the championship soccer match Karolina Dean did cartwheels in front of the goal.": "Karolina", "The mayor rode a motorcycle past Joseph Joestar's house during the parade.": "no_comma", "Fabiola Torres enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Cheryl Blossom enjoys making clay models of her dog.": "no_comma", "The children left slippery banana peels all over Ben Gross's clean floor.": "no_comma", "Since she tried blueberry ice cream Veronica Lodge has refused to eat any other flavor.": "Veronica", "From the International Space Station Rainbow Johnson sent an email to my science class.": "Rainbow", "Vivian Carter keeps planting palm trees all over town.": "no_comma", "Singing at the top of his lungs Chase Stein woke up most of his neighbors.": "Chase", "Fishing in the lake Jack Johnson tried not to get water in his boots.": "Jack", "Josuke Higashikata loves playing the triangle in our school's marching band.": "no_comma", "Dre Johnson likes wearing polka dots and stripes at the same time.": "no_comma", "Jughead Jones updates his blog every day unless his favorite TV show is on.": "no_comma", "The musicians held a free concert at Lucy Hernandez's school.": "no_comma", "From the top floor of the office building Diane Johnson could see the entire city.": "Diane", "Dio Brando refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Before he went on vacation Mitchell Wilson bought a new neon swimsuit.": "Mitchell", "Slurping his chicken noodle soup Paxton Hall-Yoshida had already decided to have another bowl.": "Paxton", "Sitting in the movie theater Devi Vishwakumar realized she had forgotten to buy popcorn.": "Devi", "The mayor rode a motorcycle past Jughead Jones's house during the parade.": "no_comma", "The musicians held a free concert at Archie Andrews's school.": "no_comma", "Fabiola Torres's cat loves swimming in the kiddie pool.": "no_comma", "The actress signed autographs for Ben Gross and his friends.": "no_comma", "Until I learn how to drive Kamala Nandiwadal will have to take me to soccer practice.": "Kamala", "When the radio station plays country music Chase Stein sings louder than everyone else.": "Chase", "Devi Vishwakumar refuses to eat celery unless it's covered in peanut butter.": "no_comma", "During the national yo-yo convention Dre Johnson volunteered to teach the crowd some tricks.": "Dre", "Cheryl Blossom updates her blog every day unless her favorite TV show is on.": "no_comma", "My rabbit hides carrots under Joseph Joestar's couch.": "no_comma", "The astronaut inspired Veronica Lodge to sign up for space camp.": "no_comma", "Eleanor Wong likes wearing polka dots and stripes at the same time.": "no_comma", "Kaitlynn Price is considering moving to Cairo next year.": "no_comma", "In the dentist's waiting room Karolina Dean read a magazine article about baby elephants.": "Karolina", "When he eats cereal Dio Brando always adds two cups of milk.": "Dio", "Since he tried blueberry ice cream Jonathan Joestar has refused to eat any other flavor.": "Jonathan", "During the championship soccer match Jack Johnson did cartwheels in front of the goal.": "Jack", "Nico Minoru enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Inside the spy's secret headquarters Molly Hayes Hernandez learned about the upcoming mission.": "Molly", "The girls on Lucy Hernandez's swim team enjoy practicing their dives at the lake.": "no_comma", "Before he joins the chess team Paxton Hall-Yoshida wants me to help him practice.": "Paxton", "I never knew that Alex Wilder could beatbox until I heard him at the hip-hop festival.": "no_comma", "Vivian Carter loves playing the triangle in our school's marching band.": "no_comma", "Walking through the elves' workshop Seth Acosta inspected the handmade toys.": "Seth", "From the top floor of the office building Mitchell Wilson could see the entire city.": "Mitchell", "Singing at the top of her lungs Diane Johnson woke up most of her neighbors.": "Diane", "Pops Johnson started reading science fiction books after the library added a new section.": "no_comma", "Showing off his new cooking skills Jotaro Kujo flipped the pancake behind his back.": "Jotaro", "Using the coupon Trent Harrison got twenty extra tokens at the arcade.": "Trent", "Slurping her chicken noodle soup Veronica Lodge had already decided to have another bowl.": "Veronica", "Because he loves the smell of freshly cut grass Mitchell Wilson volunteered to mow the lawn.": "Mitchell", "Sniffing the soggy tuna sandwich Seth Acosta decided to eat a salad instead.": "Seth", "After he saw the Broadway play Josuke Higashikata waited outside to meet the actors.": "Josuke", "During the tour of the Transylvanian castle Eleanor Wong kept an eye out for vampires.": "Eleanor", "Jughead Jones keeps planting palm trees all over town.": "no_comma", "Because she invented a flying car Kamala Nandiwadal became a worldwide celebrity.": "Kamala", "Joseph Joestar enjoys making clay models of his dog.": "no_comma", "Standing on the step stool Archie Andrews could almost reach the cookie jar.": "Archie", "Jumping on the trampoline Diane Johnson did a split and touched her toes.": "Diane", "Dre Johnson dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "After her cousin's ballet recital Fabiola Torres threw roses onto the stage.": "Fabiola", "I ride my scooter past Paxton Hall-Yoshida's comic book store on the way to school.": "no_comma", "Jonathan Joestar updates his blog every day unless his favorite TV show is on.": "no_comma", "Unless I serve cinnamon rolls at my party Pops Johnson will not attend.": "Pops", "Because he loves the smell of freshly cut grass Joseph Joestar volunteered to mow the lawn.": "Joseph", "Jack Johnson refuses to eat celery unless it's covered in peanut butter.": "no_comma", "When she eats cereal Nalini Vishwakumar always adds two cups of milk.": "Nalini", "Unless I serve cinnamon rolls at my party Paxton Hall-Yoshida will not attend.": "Paxton", "From the top floor of the office building Rainbow Johnson could see the entire city.": "Rainbow", "Molly Hayes Hernandez enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Inside the spy's secret headquarters Nico Minoru learned about the upcoming mission.": "Nico", "Diane Johnson enjoys making clay models of her dog.": "no_comma", "Ben Gross dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Until I learn how to drive Trent Harrison will have to take me to soccer practice.": "Trent", "Before she joins the chess team Lucy Hernandez wants me to help her practice.": "Lucy", "On the park's fastest roller coaster Eleanor Wong's baseball cap flew off her head.": "Eleanor", "From the International Space Station Mitchell Wilson sent an email to my science class.": "Mitchell", "During the championship soccer match Jotaro Kujo did cartwheels in front of the goal.": "Jotaro", "Chase Stein keeps planning to visit aliens in outer space.": "no_comma", "Jogging through the park Gertrude Yorkes waved to everyone she saw.": "Gertrude", "The mayor rode a motorcycle past Cheryl Blossom's house during the parade.": "no_comma", "Karolina Dean loves playing the triangle in our school's marching band.": "no_comma", "Veronica Lodge likes wearing polka dots and stripes at the same time.": "no_comma", "At the mall food court Devi Vishwakumar couldn't decide which soda she wanted.": "Devi", "Before she went on vacation Eleanor Wong bought a new neon swimsuit.": "Eleanor", "Sitting in the movie theater Lucy Hernandez realized she had forgotten to buy popcorn.": "Lucy", "The musicians held a free concert at Kamala Nandiwadal's school.": "no_comma", "My rabbit hides carrots under Karolina Dean's couch.": "no_comma", "Standing on the step stool Jotaro Kujo could almost reach the cookie jar.": "Jotaro", "Josuke Higashikata keeps planting palm trees all over town.": "no_comma", "The girls on Cheryl Blossom's swim team enjoy practicing their dives at the lake.": "no_comma", "During the tour of the Transylvanian castle Jughead Jones kept an eye out for vampires.": "Jughead", "Because he invented a flying car Joseph Joestar became a worldwide celebrity.": "Joseph", "I ride my scooter past Dio Brando's comic book store on the way to school.": "no_comma", "The mailman needed help carrying presents to Rainbow Johnson's door.": "no_comma", "Fabiola Torres started reading science fiction books after the library added a new section.": "no_comma", "Fishing in the lake Nico Minoru tried not to get water in her boots.": "Nico", "Jughead Jones plays dodgeball in the house on rainy days.": "no_comma", "The mayor rode a motorcycle past Devi Vishwakumar's house during the parade.": "no_comma", "When the radio station plays country music Kaitlynn Price sings louder than everyone else.": "Kaitlynn", "The children left slippery banana peels all over Lucy Hernandez's clean floor.": "no_comma", "Because he invented a flying car Alex Wilder became a worldwide celebrity.": "Alex", "The musicians held a free concert at Fabiola Torres's school.": "no_comma", "After he saw the Broadway play Seth Acosta waited outside to meet the actors.": "Seth", "The astronaut inspired Paxton Hall-Yoshida to sign up for space camp.": "no_comma", "Veronica Lodge loves playing the triangle in our school's marching band.": "no_comma", "Vivian Carter is considering moving to Cairo next year.": "no_comma", "On the park's fastest roller coaster Gertrude Yorkes's baseball cap flew off her head.": "Gertrude", "Kamala Nandiwadal updates her blog every day unless her favorite TV show is on.": "no_comma", "Unless I serve cinnamon rolls at my party Ben Gross will not attend.": "Ben", "Jonathan Joestar enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "After his cousin's ballet recital Jotaro Kujo threw roses onto the stage.": "Jotaro", "Sniffing the soggy tuna sandwich Molly Hayes Hernandez decided to eat a salad instead.": "Molly", "In the dentist's waiting room Rainbow Johnson read a magazine article about baby elephants.": "Rainbow", "Before she joins the chess team Cheryl Blossom wants me to help her practice.": "Cheryl", "From the International Space Station Joseph Joestar sent an email to my science class.": "Joseph", "Chase Stein dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "During the national yo-yo convention Archie Andrews volunteered to teach the crowd some tricks.": "Archie", "When he eats cereal Trent Harrison always adds two cups of milk.": "Trent", "I never knew that Mitchell Wilson could beatbox until I heard him at the hip-hop festival.": "no_comma", "The actress signed autographs for Jack Johnson and his friends.": "no_comma", "Since he tried blueberry ice cream Ben Gross has refused to eat any other flavor.": "Ben", "Joseph Joestar dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Trent Harrison keeps planning to visit aliens in outer space.": "no_comma", "My rabbit hides carrots under Dio Brando's couch.": "no_comma", "Molly Hayes Hernandez keeps planting palm trees all over town.": "no_comma", "Diane Johnson and I go camping in the Rocky Mountains every summer.": "no_comma", "Cheryl Blossom refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Inside the spy's secret headquarters Fabiola Torres learned about the upcoming mission.": "Fabiola", "Standing on the step stool Rainbow Johnson could almost reach the cookie jar.": "Rainbow", "The boys on Josuke Higashikata's swim team enjoy practicing their dives at the lake.": "no_comma", "Walking through the elves' workshop Lucy Hernandez inspected the handmade toys.": "Lucy", "Jumping on the trampoline Kamala Nandiwadal did a split and touched her toes.": "Kamala", "Before he went on vacation Seth Acosta bought a new neon swimsuit.": "Seth", "Until I learn how to drive Joseph Joestar will have to take me to soccer practice.": "Joseph", "From the top floor of the office building Nalini Vishwakumar could see the entire city.": "Nalini", "Ben Gross is considering moving to Cairo next year.": "no_comma", "Devi Vishwakumar plays dodgeball in the house on rainy days.": "no_comma", "At the mall food court Mitchell Wilson couldn't decide which soda he wanted.": "Mitchell", "The actress signed autographs for Jonathan Joestar and his friends.": "no_comma", "Slurping her chicken noodle soup Gertrude Yorkes had already decided to have another bowl.": "Gertrude", "In the dentist's waiting room Jack Johnson read a magazine article about baby elephants.": "Jack", "Singing at the top of her lungs Lucy Hernandez woke up most of her neighbors.": "Lucy", "Kamala Nandiwadal started reading science fiction books after the library added a new section.": "no_comma", "Fabiola Torres likes wearing polka dots and stripes at the same time.": "no_comma", "The astronaut inspired Molly Hayes Hernandez to sign up for space camp.": "no_comma", "The mailman needed help carrying presents to Archie Andrews's door.": "no_comma", "Rainbow Johnson started reading science fiction books after the library added a new section.": "no_comma", "Sitting in the movie theater Jughead Jones realized he had forgotten to buy popcorn.": "Jughead", "Jotaro Kujo updates his blog every day unless his favorite TV show is on.": "no_comma", "Since she tried blueberry ice cream Kaitlynn Price has refused to eat any other flavor.": "Kaitlynn", "Veronica Lodge and I go camping in the Rocky Mountains every summer.": "no_comma", "When the radio station plays country music Trent Harrison sings louder than everyone else.": "Trent", "Nico Minoru keeps planting palm trees all over town.": "no_comma", "Before she joins the chess team Molly Hayes Hernandez wants me to help her practice.": "Molly", "Veronica Lodge updates her blog every day unless her favorite TV show is on.": "no_comma", "From the International Space Station Alex Wilder sent an email to my science class.": "Alex", "After she saw the Broadway play Gertrude Yorkes waited outside to meet the actors.": "Gertrude", "Sniffing the soggy tuna sandwich Nalini Vishwakumar decided to eat a salad instead.": "Nalini", "I ride my scooter past Joseph Joestar's comic book store on the way to school.": "no_comma", "After his cousin's ballet recital Jack Johnson threw roses onto the stage.": "Jack", "Rainbow Johnson refuses to eat celery unless it's covered in peanut butter.": "no_comma", "During the tour of the Transylvanian castle Jotaro Kujo kept an eye out for vampires.": "Jotaro", "Josuke Higashikata enjoys making clay models of his dog.": "no_comma", "Fishing in the lake Jonathan Joestar tried not to get water in his boots.": "Jonathan", "Using the coupon Chase Stein got twenty extra tokens at the arcade.": "Chase", "Devi Vishwakumar keeps planning to visit aliens in outer space.": "no_comma", "Kaitlynn Price dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "When he eats cereal Pops Johnson always adds two cups of milk.": "Pops", "The mayor rode a motorcycle past Paxton Hall-Yoshida's house during the parade.": "no_comma", "Mitchell Wilson refuses to eat celery unless it's covered in peanut butter.": "no_comma", "The children left slippery banana peels all over Josuke Higashikata's clean floor.": "no_comma", "Jumping on the trampoline Jonathan Joestar did a split and touched his toes.": "Jonathan", "When he eats cereal Joseph Joestar always adds two cups of milk.": "Joseph", "Using the coupon Devi Vishwakumar got twenty extra tokens at the arcade.": "Devi", "Sniffing the soggy tuna sandwich Ben Gross decided to eat a salad instead.": "Ben", "Showing off her new cooking skills Gertrude Yorkes flipped the pancake behind her back.": "Gertrude", "Slurping her chicken noodle soup Kamala Nandiwadal had already decided to have another bowl.": "Kamala", "Standing on the step stool Seth Acosta could almost reach the cookie jar.": "Seth", "Until I learn how to drive Rainbow Johnson will have to take me to soccer practice.": "Rainbow", "During the championship soccer match Alex Wilder did cartwheels in front of the goal.": "Alex", "In the dentist's waiting room Pops Johnson read a magazine article about baby elephants.": "Pops", "Trent Harrison keeps planting palm trees all over town.": "no_comma", "Unless I serve cinnamon rolls at my party Jughead Jones will not attend.": "Jughead", "With an instrument in each hand Karolina Dean put on a concert all by herself.": "Karolina", "After her cousin's ballet recital Nalini Vishwakumar threw roses onto the stage.": "Nalini", "Archie Andrews plays dodgeball in the house on rainy days.": "no_comma", "Lucy Hernandez dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "Jotaro Kujo enjoys making clay models of his dog.": "no_comma", "Since she tried blueberry ice cream Diane Johnson has refused to eat any other flavor.": "Diane", "When the radio station plays country music Molly Hayes Hernandez sings louder than everyone else.": "Molly", "During the national yo-yo convention Vivian Carter volunteered to teach the crowd some tricks.": "Vivian", "The musicians held a free concert at Jughead Jones's school.": "no_comma", "Kamala Nandiwadal refuses to eat celery unless it's covered in peanut butter.": "no_comma", "After she saw the Broadway play Molly Hayes Hernandez waited outside to meet the actors.": "Molly", "Walking through the elves' workshop Diane Johnson inspected the handmade toys.": "Diane", "The actress signed autographs for Joseph Joestar and his friends.": "no_comma", "Chase Stein updates his blog every day unless his favorite TV show is on.": "no_comma", "Because she loves the smell of freshly cut grass Gertrude Yorkes volunteered to mow the lawn.": "Gertrude", "I never knew that Devi Vishwakumar could beatbox until I heard her at the hip-hop festival.": "no_comma", "Jotaro Kujo likes wearing polka dots and stripes at the same time.": "no_comma", "My rabbit hides carrots under Alex Wilder's couch.": "no_comma", "Mitchell Wilson's cat loves swimming in the kiddie pool.": "no_comma", "I never knew that Kamala Nandiwadal could beatbox until I heard her at the hip-hop festival.": "no_comma", "Gertrude Yorkes keeps planning to visit aliens in outer space.": "no_comma", "Unless I serve cinnamon rolls at my party Jonathan Joestar will not attend.": "Jonathan", "Alex Wilder dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Sitting in the movie theater Karolina Dean realized she had forgotten to buy popcorn.": "Karolina", "At the mall food court Paxton Hall-Yoshida couldn't decide which soda he wanted.": "Paxton", "Showing off her new cooking skills Diane Johnson flipped the pancake behind her back.": "Diane", "Nico Minoru enjoys making clay models of her dog.": "no_comma", "With an instrument in each hand Kaitlynn Price put on a concert all by herself.": "Kaitlynn", "Because she invented a flying car Rainbow Johnson became a worldwide celebrity.": "Rainbow", "Jumping on the trampoline Archie Andrews did a split and touched his toes.": "Archie", "During the tour of the Transylvanian castle Devi Vishwakumar kept an eye out for vampires.": "Devi", "Veronica Lodge's cat loves swimming in the kiddie pool.": "no_comma", "The actress signed autographs for Mitchell Wilson and his friends.": "no_comma", "Seth Acosta keeps planting palm trees all over town.": "no_comma", "Eleanor Wong refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Vivian Carter updates her blog every day unless her favorite TV show is on.": "no_comma", "Jack Johnson is considering moving to Cairo next year.": "no_comma", "Because she loves the smell of freshly cut grass Cheryl Blossom volunteered to mow the lawn.": "Cheryl", "I never knew that Jotaro Kujo could beatbox until I heard him at the hip-hop festival.": "no_comma", "Before he joins the chess team Dio Brando wants me to help him practice.": "Dio", "Devi Vishwakumar updates her blog every day unless her favorite TV show is on.": "no_comma", "Diane Johnson likes wearing polka dots and stripes at the same time.": "no_comma", "After she saw the Broadway play Kamala Nandiwadal waited outside to meet the actors.": "Kamala", "Chase Stein and I go camping in the Rocky Mountains every summer.": "no_comma", "Jughead Jones loves playing the triangle in our school's marching band.": "no_comma", "Inside the spy's secret headquarters Gertrude Yorkes learned about the upcoming mission.": "Gertrude", "Standing on the step stool Alex Wilder could almost reach the cookie jar.": "Alex", "I ride my scooter past Nico Minoru's comic book store on the way to school.": "no_comma", "Fishing in the lake Dio Brando tried not to get water in his boots.": "Dio", "From the top floor of the office building Pops Johnson could see the entire city.": "Pops", "My rabbit hides carrots under Jack Johnson's couch.": "no_comma", "The girls on Fabiola Torres's swim team enjoy practicing their dives at the lake.": "no_comma", "The mailman needed help carrying presents to Lucy Hernandez's door.": "no_comma", "Since she tried blueberry ice cream Molly Hayes Hernandez has refused to eat any other flavor.": "Molly", "Pops Johnson keeps planting palm trees all over town.": "no_comma", "During the national yo-yo convention Rainbow Johnson volunteered to teach the crowd some tricks.": "Rainbow", "Jogging through the park Joseph Joestar waved to everyone he saw.": "Joseph", "Karolina Dean likes wearing polka dots and stripes at the same time.": "no_comma", "When she eats cereal Devi Vishwakumar always adds two cups of milk.": "Devi", "Josuke Higashikata enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "The musicians held a free concert at Cheryl Blossom's school.": "no_comma", "Sitting in the movie theater Molly Hayes Hernandez realized she had forgotten to buy popcorn.": "Molly", "Dre Johnson refuses to eat celery unless it's covered in peanut butter.": "no_comma", "In the dentist's waiting room Nalini Vishwakumar read a magazine article about baby elephants.": "Nalini", "Because he invented a flying car Paxton Hall-Yoshida became a worldwide celebrity.": "Paxton", "Inside the spy's secret headquarters Kamala Nandiwadal learned about the upcoming mission.": "Kamala", "At the mall food court Chase Stein couldn't decide which soda he wanted.": "Chase", "Because she loves the smell of freshly cut grass Kaitlynn Price volunteered to mow the lawn.": "Kaitlynn", "On the park's fastest roller coaster Diane Johnson's baseball cap flew off her head.": "Diane", "With an instrument in each hand Mitchell Wilson put on a concert all by himself.": "Mitchell", "Vivian Carter enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Before he joins the chess team Trent Harrison wants me to help him practice.": "Trent", "My rabbit hides carrots under Vivian Carter's couch.": "no_comma", "Paxton Hall-Yoshida and I go camping in the Rocky Mountains every summer.": "no_comma", "Archie Andrews enjoys making clay models of his dog.": "no_comma", "Until I learn how to drive Ben Gross will have to take me to soccer practice.": "Ben", "Nico Minoru keeps planning to visit aliens in outer space.": "no_comma", "Jumping on the trampoline Eleanor Wong did a split and touched her toes.": "Eleanor", "Rainbow Johnson is considering moving to Cairo next year.": "no_comma", "After his cousin's ballet recital Dio Brando threw roses onto the stage.": "Dio", "Sniffing the soggy tuna sandwich Dre Johnson decided to eat a salad instead.": "Dre", "When the radio station plays country music Kamala Nandiwadal sings louder than everyone else.": "Kamala", "Nalini Vishwakumar refuses to eat celery unless it's covered in peanut butter.": "no_comma", "The children left slippery banana peels all over Trent Harrison's clean floor.": "no_comma", "Showing off her new cooking skills Karolina Dean flipped the pancake behind her back.": "Karolina", "Fishing in the lake Archie Andrews tried not to get water in his boots.": "Archie", "Dio Brando dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "During the tour of the Transylvanian castle Molly Hayes Hernandez kept an eye out for vampires.": "Molly", "When the radio station plays country music Paxton Hall-Yoshida sings louder than everyone else.": "Paxton", "After her cousin's ballet recital Nico Minoru threw roses onto the stage.": "Nico", "Before she went on vacation Rainbow Johnson bought a new neon swimsuit.": "Rainbow", "The mayor rode a motorcycle past Trent Harrison's house during the parade.": "no_comma", "Using the coupon Nalini Vishwakumar got twenty extra tokens at the arcade.": "Nalini", "On the park's fastest roller coaster Pops Johnson's baseball cap flew off his head.": "Pops", "Sniffing the soggy tuna sandwich Cheryl Blossom decided to eat a salad instead.": "Cheryl", "The actress signed autographs for Chase Stein and his friends.": "no_comma", "Sitting in the movie theater Vivian Carter realized she had forgotten to buy popcorn.": "Vivian", "Eleanor Wong's cat loves swimming in the kiddie pool.": "no_comma", "Jogging through the park Veronica Lodge waved to everyone she saw.": "Veronica", "Because he loves the smell of freshly cut grass Seth Acosta volunteered to mow the lawn.": "Seth", "I ride my scooter past Josuke Higashikata's comic book store on the way to school.": "no_comma", "From the top floor of the office building Joseph Joestar could see the entire city.": "Joseph", "Kaitlynn Price refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Fabiola Torres keeps planning to visit aliens in outer space.": "no_comma", "Inside the spy's secret headquarters Lucy Hernandez learned about the upcoming mission.": "Lucy", "My rabbit hides carrots under Jotaro Kujo's couch.": "no_comma", "Mitchell Wilson loves playing the triangle in our school's marching band.": "no_comma", "The musicians held a free concert at Paxton Hall-Yoshida's school.": "no_comma", "Singing at the top of his lungs Seth Acosta woke up most of his neighbors.": "Seth", "During the championship soccer match Dio Brando did cartwheels in front of the goal.": "Dio", "From the International Space Station Nico Minoru sent an email to my science class.": "Nico", "When he eats cereal Josuke Higashikata always adds two cups of milk.": "Josuke", "The mailman needed help carrying presents to Chase Stein's door.": "no_comma", "At the mall food court Rainbow Johnson couldn't decide which soda she wanted.": "Rainbow", "Because she invented a flying car Eleanor Wong became a worldwide celebrity.": "Eleanor", "Using the coupon Pops Johnson got twenty extra tokens at the arcade.": "Pops", "Dre Johnson updates his blog every day unless his favorite TV show is on.": "no_comma", "With an instrument in each hand Nico Minoru put on a concert all by herself.": "Nico", "The mayor rode a motorcycle past Eleanor Wong's house during the parade.": "no_comma", "Walking through the elves' workshop Joseph Joestar inspected the handmade toys.": "Joseph", "The mailman needed help carrying presents to Kaitlynn Price's door.": "no_comma", "From the top floor of the office building Seth Acosta could see the entire city.": "Seth", "Unless I serve cinnamon rolls at my party Dio Brando will not attend.": "Dio", "Before he joins the chess team Chase Stein wants me to help him practice.": "Chase", "Josuke Higashikata likes wearing polka dots and stripes at the same time.": "no_comma", "Veronica Lodge keeps planting palm trees all over town.": "no_comma", "I ride my scooter past Mitchell Wilson's comic book store on the way to school.": "no_comma", "After she saw the Broadway play Lucy Hernandez waited outside to meet the actors.": "Lucy", "Singing at the top of her lungs Rainbow Johnson woke up most of her neighbors.": "Rainbow", "Standing on the step stool Diane Johnson could almost reach the cookie jar.": "Diane", "Kamala Nandiwadal enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Jonathan Joestar's cat loves swimming in the kiddie pool.": "no_comma", "Alex Wilder loves playing the triangle in our school's marching band.": "no_comma", "Karolina Dean enjoys making clay models of her dog.": "no_comma", "Jumping on the trampoline Jack Johnson did a split and touched his toes.": "Jack", "On the park's fastest roller coaster Trent Harrison's baseball cap flew off his head.": "Trent", "When he eats cereal Archie Andrews always adds two cups of milk.": "Archie", "Molly Hayes Hernandez keeps planning to visit aliens in outer space.": "no_comma", "During the championship soccer match Kamala Nandiwadal did cartwheels in front of the goal.": "Kamala", "Slurping his chicken noodle soup Jonathan Joestar had already decided to have another bowl.": "Jonathan", "Nico Minoru started reading science fiction books after the library added a new section.": "no_comma", "Before she went on vacation Fabiola Torres bought a new neon swimsuit.": "Fabiola", "In the dentist's waiting room Vivian Carter read a magazine article about baby elephants.": "Vivian", "Sitting in the movie theater Josuke Higashikata realized he had forgotten to buy popcorn.": "Josuke", "The astronaut inspired Lucy Hernandez to sign up for space camp.": "no_comma", "Walking through the elves' workshop Kamala Nandiwadal inspected the handmade toys.": "Kamala", "Jogging through the park Paxton Hall-Yoshida waved to everyone he saw.": "Paxton", "Dre Johnson enjoys making clay models of his dog.": "no_comma", "The astronaut inspired Gertrude Yorkes to sign up for space camp.": "no_comma", "The boys on Jotaro Kujo's swim team enjoy practicing their dives at the lake.": "no_comma", "Because she invented a flying car Diane Johnson became a worldwide celebrity.": "Diane", "The actress signed autographs for Cheryl Blossom and her friends.": "no_comma", "Showing off her new cooking skills Molly Hayes Hernandez flipped the pancake behind her back.": "Molly", "Jumping on the trampoline Seth Acosta did a split and touched his toes.": "Seth", "Singing at the top of her lungs Eleanor Wong woke up most of her neighbors.": "Eleanor", "When the radio station plays country music Mitchell Wilson sings louder than everyone else.": "Mitchell", "The mailman needed help carrying presents to Jack Johnson's door.": "no_comma", "Until I learn how to drive Kaitlynn Price will have to take me to soccer practice.": "Kaitlynn", "Before she went on vacation Vivian Carter bought a new neon swimsuit.": "Vivian", "From the top floor of the office building Josuke Higashikata could see the entire city.": "Josuke", "Fishing in the lake Pops Johnson tried not to get water in his boots.": "Pops", "Joseph Joestar is considering moving to Cairo next year.": "no_comma", "Dio Brando plays dodgeball in the house on rainy days.": "no_comma", "I ride my scooter past Fabiola Torres's comic book store on the way to school.": "no_comma", "My rabbit hides carrots under Jughead Jones's couch.": "no_comma", "Standing on the step stool Nalini Vishwakumar could almost reach the cookie jar.": "Nalini", "Karolina Dean refuses to eat celery unless it's covered in peanut butter.": "no_comma", "During the tour of the Transylvanian castle Alex Wilder kept an eye out for vampires.": "Alex", "At the mall food court Nico Minoru couldn't decide which soda she wanted.": "Nico", "Vivian Carter and I go camping in the Rocky Mountains every summer.": "no_comma", "Since he tried blueberry ice cream Jughead Jones has refused to eat any other flavor.": "Jughead", "Slurping her chicken noodle soup Diane Johnson had already decided to have another bowl.": "Diane", "Jonathan Joestar dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Nalini Vishwakumar keeps planning to visit aliens in outer space.": "no_comma", "Alex Wilder likes wearing polka dots and stripes at the same time.": "no_comma", "After she saw the Broadway play Rainbow Johnson waited outside to meet the actors.": "Rainbow", "Ben Gross started reading science fiction books after the library added a new section.": "no_comma", "My rabbit hides carrots under Veronica Lodge's couch.": "no_comma", "Standing on the step stool Fabiola Torres could almost reach the cookie jar.": "Fabiola", "When the radio station plays country music Vivian Carter sings louder than everyone else.": "Vivian", "Lucy Hernandez started reading science fiction books after the library added a new section.": "no_comma", "With an instrument in each hand Jotaro Kujo put on a concert all by himself.": "Jotaro", "Walking through the elves' workshop Mitchell Wilson inspected the handmade toys.": "Mitchell", "Cheryl Blossom keeps planting palm trees all over town.": "no_comma", "Jughead Jones is considering moving to Cairo next year.": "no_comma", "Diane Johnson dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "Before he went on vacation Dio Brando bought a new neon swimsuit.": "Dio", "Seth Acosta enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "Rainbow Johnson likes wearing polka dots and stripes at the same time.": "no_comma", "At the mall food court Karolina Dean couldn't decide which soda she wanted.": "Karolina", "On the park's fastest roller coaster Dre Johnson's baseball cap flew off his head.": "Dre", "After she saw the Broadway play Devi Vishwakumar waited outside to meet the actors.": "Devi", "Jogging through the park Chase Stein waved to everyone he saw.": "Chase", "Since he tried blueberry ice cream Alex Wilder has refused to eat any other flavor.": "Alex", "The mailman needed help carrying presents to Nico Minoru's door.": "no_comma", "Nalini Vishwakumar updates her blog every day unless her favorite TV show is on.": "no_comma", "During the national yo-yo convention Paxton Hall-Yoshida volunteered to teach the crowd some tricks.": "Paxton", "Kamala Nandiwadal keeps planning to visit aliens in outer space.": "no_comma", "Sniffing the soggy tuna sandwich Kaitlynn Price decided to eat a salad instead.": "Kaitlynn", "From the International Space Station Pops Johnson sent an email to my science class.": "Pops", "Using the coupon Archie Andrews got twenty extra tokens at the arcade.": "Archie", "I never knew that Cheryl Blossom could beatbox until I heard her at the hip-hop festival.": "no_comma", "Eleanor Wong and I go camping in the Rocky Mountains every summer.": "no_comma", "I ride my scooter past Karolina Dean's comic book store on the way to school.": "no_comma", "The boys on Chase Stein's swim team enjoy practicing their dives at the lake.": "no_comma", "The children left slippery banana peels all over Jotaro Kujo's clean floor.": "no_comma", "Seth Acosta updates his blog every day unless his favorite TV show is on.": "no_comma", "Inside the spy's secret headquarters Rainbow Johnson learned about the upcoming mission.": "Rainbow", "When she eats cereal Diane Johnson always adds two cups of milk.": "Diane", "Until I learn how to drive Devi Vishwakumar will have to take me to soccer practice.": "Devi", "Because she loves the smell of freshly cut grass Kamala Nandiwadal volunteered to mow the lawn.": "Kamala", "Sitting in the movie theater Nalini Vishwakumar realized she had forgotten to buy popcorn.": "Nalini", "Before she went on vacation Veronica Lodge bought a new neon swimsuit.": "Veronica", "During the championship soccer match Nico Minoru did cartwheels in front of the goal.": "Nico", "Jack Johnson keeps planting palm trees all over town.": "no_comma", "After he saw the Broadway play Alex Wilder waited outside to meet the actors.": "Alex", "The boys on Pops Johnson's swim team enjoy practicing their dives at the lake.": "no_comma", "Vivian Carter enjoys making clay models of her dog.": "no_comma", "Slurping his chicken noodle soup Mitchell Wilson had already decided to have another bowl.": "Mitchell", "The mayor rode a motorcycle past Seth Acosta's house during the parade.": "no_comma", "Singing at the top of his lungs Jotaro Kujo woke up most of his neighbors.": "Jotaro", "At the mall food court Kaitlynn Price couldn't decide which soda she wanted.": "Kaitlynn", "My rabbit hides carrots under Diane Johnson's couch.": "no_comma", "Fishing in the lake Molly Hayes Hernandez tried not to get water in her boots.": "Molly", "Until I learn how to drive Dre Johnson will have to take me to soccer practice.": "Dre", "Fabiola Torres and I go camping in the Rocky Mountains every summer.": "no_comma", "During the tour of the Transylvanian castle Ben Gross kept an eye out for vampires.": "Ben", "On the park's fastest roller coaster Josuke Higashikata's baseball cap flew off his head.": "Josuke", "Trent Harrison started reading science fiction books after the library added a new section.": "no_comma", "Since he tried blueberry ice cream Joseph Joestar has refused to eat any other flavor.": "Joseph", "Jughead Jones enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "Unless I serve cinnamon rolls at my party Jack Johnson will not attend.": "Jack", "Cheryl Blossom keeps planning to visit aliens in outer space.": "no_comma", "Jumping on the trampoline Rainbow Johnson did a split and touched her toes.": "Rainbow", "In the dentist's waiting room Nico Minoru read a magazine article about baby elephants.": "Nico", "I never knew that Eleanor Wong could beatbox until I heard her at the hip-hop festival.": "no_comma", "Karolina Dean is considering moving to Cairo next year.": "no_comma", "Inside the spy's secret headquarters Chase Stein learned about the upcoming mission.": "Chase", "The mailman needed help carrying presents to Kamala Nandiwadal's door.": "no_comma", "Dio Brando enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "The children left slippery banana peels all over Vivian Carter's clean floor.": "no_comma", "The musicians held a free concert at Gertrude Yorkes's school.": "no_comma", "Trent Harrison updates his blog every day unless his favorite TV show is on.": "no_comma", "Since she tried blueberry ice cream Karolina Dean has refused to eat any other flavor.": "Karolina", "Standing on the step stool Lucy Hernandez could almost reach the cookie jar.": "Lucy", "Dio Brando keeps planting palm trees all over town.": "no_comma", "Until I learn how to drive Chase Stein will have to take me to soccer practice.": "Chase", "When she eats cereal Veronica Lodge always adds two cups of milk.": "Veronica", "From the top floor of the office building Archie Andrews could see the entire city.": "Archie", "Singing at the top of her lungs Nalini Vishwakumar woke up most of her neighbors.": "Nalini", "Eleanor Wong dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "The girls on Nico Minoru's swim team enjoy practicing their dives at the lake.": "no_comma", "Joseph Joestar updates his blog every day unless his favorite TV show is on.": "no_comma", "The mayor rode a motorcycle past Alex Wilder's house during the parade.": "no_comma", "During the championship soccer match Fabiola Torres did cartwheels in front of the goal.": "Fabiola", "During the national yo-yo convention Diane Johnson volunteered to teach the crowd some tricks.": "Diane", "The actress signed autographs for Seth Acosta and his friends.": "no_comma", "Dre Johnson plays dodgeball in the house on rainy days.": "no_comma", "Unless I serve cinnamon rolls at my party Vivian Carter will not attend.": "Vivian", "I ride my scooter past Trent Harrison's comic book store on the way to school.": "no_comma", "With an instrument in each hand Pops Johnson put on a concert all by himself.": "Pops", "Because she invented a flying car Gertrude Yorkes became a worldwide celebrity.": "Gertrude", "In the dentist's waiting room Paxton Hall-Yoshida read a magazine article about baby elephants.": "Paxton", "Trent Harrison refuses to eat celery unless it's covered in peanut butter.": "no_comma", "After her cousin's ballet recital Diane Johnson threw roses onto the stage.": "Diane", "Jonathan Joestar and I go camping in the Rocky Mountains every summer.": "no_comma", "Chase Stein loves playing the triangle in our school's marching band.": "no_comma", "The astronaut inspired Jotaro Kujo to sign up for space camp.": "no_comma", "On the park's fastest roller coaster Vivian Carter's baseball cap flew off her head.": "Vivian", "Sitting in the movie theater Fabiola Torres realized she had forgotten to buy popcorn.": "Fabiola", "Sniffing the soggy tuna sandwich Veronica Lodge decided to eat a salad instead.": "Veronica", "The musicians held a free concert at Devi Vishwakumar's school.": "no_comma", "The children left slippery banana peels all over Alex Wilder's clean floor.": "no_comma", "The mailman needed help carrying presents to Josuke Higashikata's door.": "no_comma", "From the International Space Station Vivian Carter sent an email to my science class.": "Vivian", "Fishing in the lake Fabiola Torres tried not to get water in her boots.": "Fabiola", "Slurping his chicken noodle soup Pops Johnson had already decided to have another bowl.": "Pops", "Alex Wilder started reading science fiction books after the library added a new section.": "no_comma", "Devi Vishwakumar enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Jogging through the park Eleanor Wong waved to everyone she saw.": "Eleanor", "Showing off his new cooking skills Dre Johnson flipped the pancake behind his back.": "Dre", "During the tour of the Transylvanian castle Lucy Hernandez kept an eye out for vampires.": "Lucy", "When the radio station plays country music Rainbow Johnson sings louder than everyone else.": "Rainbow", "The actress signed autographs for Josuke Higashikata and his friends.": "no_comma", "Singing at the top of his lungs Mitchell Wilson woke up most of his neighbors.": "Mitchell", "The mayor rode a motorcycle past Kaitlynn Price's house during the parade.": "no_comma", "Cheryl Blossom and I go camping in the Rocky Mountains every summer.": "no_comma", "Nalini Vishwakumar's cat loves swimming in the kiddie pool.": "no_comma", "At the mall food court Dio Brando couldn't decide which soda he wanted.": "Dio", "When he eats cereal Ben Gross always adds two cups of milk.": "Ben", "Unless I serve cinnamon rolls at my party Dre Johnson will not attend.": "Dre", "Inside the spy's secret headquarters Josuke Higashikata learned about the upcoming mission.": "Josuke", "Jack Johnson updates his blog every day unless his favorite TV show is on.": "no_comma", "Nalini Vishwakumar keeps planting palm trees all over town.": "no_comma", "During the national yo-yo convention Eleanor Wong volunteered to teach the crowd some tricks.": "Eleanor", "Mitchell Wilson enjoys making clay models of his dog.": "no_comma", "My rabbit hides carrots under Pops Johnson's couch.": "no_comma", "Because she loves the smell of freshly cut grass Lucy Hernandez volunteered to mow the lawn.": "Lucy", "Before she went on vacation Diane Johnson bought a new neon swimsuit.": "Diane", "Before he joins the chess team Alex Wilder wants me to help him practice.": "Alex", "Sniffing the soggy tuna sandwich Rainbow Johnson decided to eat a salad instead.": "Rainbow", "During the national yo-yo convention Chase Stein volunteered to teach the crowd some tricks.": "Chase", "Archie Andrews updates his blog every day unless his favorite TV show is on.": "no_comma", "After he saw the Broadway play Dio Brando waited outside to meet the actors.": "Dio", "The actress signed autographs for Diane Johnson and her friends.": "no_comma", "I ride my scooter past Jughead Jones's comic book store on the way to school.": "no_comma", "At the mall food court Kamala Nandiwadal couldn't decide which soda she wanted.": "Kamala", "Jumping on the trampoline Alex Wilder did a split and touched his toes.": "Alex", "When the radio station plays country music Veronica Lodge sings louder than everyone else.": "Veronica", "Fishing in the lake Nalini Vishwakumar tried not to get water in her boots.": "Nalini", "Karolina Dean and I go camping in the Rocky Mountains every summer.": "no_comma", "The mayor rode a motorcycle past Fabiola Torres's house during the parade.": "no_comma", "Inside the spy's secret headquarters Kaitlynn Price learned about the upcoming mission.": "Kaitlynn", "Since she tried blueberry ice cream Eleanor Wong has refused to eat any other flavor.": "Eleanor", "Jack Johnson started reading science fiction books after the library added a new section.": "no_comma", "Because he invented a flying car Dre Johnson became a worldwide celebrity.": "Dre", "Jogging through the park Jonathan Joestar waved to everyone he saw.": "Jonathan", "Paxton Hall-Yoshida keeps planning to visit aliens in outer space.": "no_comma", "From the top floor of the office building Trent Harrison could see the entire city.": "Trent", "The astronaut inspired Mitchell Wilson to sign up for space camp.": "no_comma", "Slurping her chicken noodle soup Nalini Vishwakumar had already decided to have another bowl.": "Nalini", "Jonathan Joestar refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Using the coupon Dre Johnson got twenty extra tokens at the arcade.": "Dre", "Sitting in the movie theater Jotaro Kujo realized he had forgotten to buy popcorn.": "Jotaro", "I never knew that Nico Minoru could beatbox until I heard her at the hip-hop festival.": "no_comma", "In the dentist's waiting room Ben Gross read a magazine article about baby elephants.": "Ben", "Standing on the step stool Paxton Hall-Yoshida could almost reach the cookie jar.": "Paxton", "Jughead Jones dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "My rabbit hides carrots under Nico Minoru's couch.": "no_comma", "Cheryl Blossom likes wearing polka dots and stripes at the same time.": "no_comma", "Kamala Nandiwadal keeps planting palm trees all over town.": "no_comma", "The mayor rode a motorcycle past Pops Johnson's house during the parade.": "no_comma", "Until I learn how to drive Vivian Carter will have to take me to soccer practice.": "Vivian", "The girls on Karolina Dean's swim team enjoy practicing their dives at the lake.": "no_comma", "Molly Hayes Hernandez's cat loves swimming in the kiddie pool.": "no_comma", "Kaitlynn Price keeps planning to visit aliens in outer space.": "no_comma", "Fishing in the lake Trent Harrison tried not to get water in his boots.": "Trent", "On the park's fastest roller coaster Lucy Hernandez's baseball cap flew off her head.": "Lucy", "Using the coupon Ben Gross got twenty extra tokens at the arcade.": "Ben", "Because he invented a flying car Jotaro Kujo became a worldwide celebrity.": "Jotaro", "The mailman needed help carrying presents to Nalini Vishwakumar's door.": "no_comma", "During the championship soccer match Joseph Joestar did cartwheels in front of the goal.": "Joseph", "Showing off his new cooking skills Alex Wilder flipped the pancake behind his back.": "Alex", "Jumping on the trampoline Devi Vishwakumar did a split and touched her toes.": "Devi", "Sitting in the movie theater Gertrude Yorkes realized she had forgotten to buy popcorn.": "Gertrude", "After her cousin's ballet recital Kaitlynn Price threw roses onto the stage.": "Kaitlynn", "Lucy Hernandez loves playing the triangle in our school's marching band.": "no_comma", "The musicians held a free concert at Mitchell Wilson's school.": "no_comma", "Chase Stein enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "The astronaut inspired Devi Vishwakumar to sign up for space camp.": "no_comma", "When the radio station plays country music Joseph Joestar sings louder than everyone else.": "Joseph", "At the mall food court Cheryl Blossom couldn't decide which soda she wanted.": "Cheryl", "The actress signed autographs for Archie Andrews and his friends.": "no_comma", "Before she joins the chess team Gertrude Yorkes wants me to help her practice.": "Gertrude", "Molly Hayes Hernandez updates her blog every day unless her favorite TV show is on.": "no_comma", "During the tour of the Transylvanian castle Vivian Carter kept an eye out for vampires.": "Vivian", "After she saw the Broadway play Nalini Vishwakumar waited outside to meet the actors.": "Nalini", "Jogging through the park Alex Wilder waved to everyone he saw.": "Alex", "From the International Space Station Trent Harrison sent an email to my science class.": "Trent", "Mitchell Wilson keeps planting palm trees all over town.": "no_comma", "I never knew that Ben Gross could beatbox until I heard him at the hip-hop festival.": "no_comma", "Standing on the step stool Karolina Dean could almost reach the cookie jar.": "Karolina", "When she eats cereal Gertrude Yorkes always adds two cups of milk.": "Gertrude", "Because he loves the smell of freshly cut grass Archie Andrews volunteered to mow the lawn.": "Archie", "The mayor rode a motorcycle past Kamala Nandiwadal's house during the parade.": "no_comma", "Sitting in the movie theater Diane Johnson realized she had forgotten to buy popcorn.": "Diane", "Since he tried blueberry ice cream Chase Stein has refused to eat any other flavor.": "Chase", "The mailman needed help carrying presents to Dio Brando's door.": "no_comma", "Walking through the elves' workshop Jughead Jones inspected the handmade toys.": "Jughead", "On the park's fastest roller coaster Devi Vishwakumar's baseball cap flew off her head.": "Devi", "The astronaut inspired Rainbow Johnson to sign up for space camp.": "no_comma", "Jotaro Kujo's cat loves swimming in the kiddie pool.": "no_comma", "During the national yo-yo convention Joseph Joestar volunteered to teach the crowd some tricks.": "Joseph", "With an instrument in each hand Eleanor Wong put on a concert all by herself.": "Eleanor", "Paxton Hall-Yoshida plays dodgeball in the house on rainy days.": "no_comma", "Lucy Hernandez enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "The actress signed autographs for Fabiola Torres and her friends.": "no_comma", "Nalini Vishwakumar likes wearing polka dots and stripes at the same time.": "no_comma", "During the tour of the Transylvanian castle Paxton Hall-Yoshida kept an eye out for vampires.": "Paxton", "Using the coupon Molly Hayes Hernandez got twenty extra tokens at the arcade.": "Molly", "Sniffing the soggy tuna sandwich Eleanor Wong decided to eat a salad instead.": "Eleanor", "Archie Andrews started reading science fiction books after the library added a new section.": "no_comma", "Showing off his new cooking skills Trent Harrison flipped the pancake behind his back.": "Trent", "Joseph Joestar loves playing the triangle in our school's marching band.": "no_comma", "Cheryl Blossom dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "When the radio station plays country music Jack Johnson sings louder than everyone else.": "Jack", "My rabbit hides carrots under Kamala Nandiwadal's couch.": "no_comma", "After his cousin's ballet recital Alex Wilder threw roses onto the stage.": "Alex", "Nalini Vishwakumar loves playing the triangle in our school's marching band.": "no_comma", "After he saw the Broadway play Ben Gross waited outside to meet the actors.": "Ben", "Slurping her chicken noodle soup Molly Hayes Hernandez had already decided to have another bowl.": "Molly", "Kamala Nandiwadal is considering moving to Cairo next year.": "no_comma", "The astronaut inspired Dio Brando to sign up for space camp.": "no_comma", "Chase Stein plays dodgeball in the house on rainy days.": "no_comma", "I never knew that Karolina Dean could beatbox until I heard her at the hip-hop festival.": "no_comma", "The girls on Rainbow Johnson's swim team enjoy practicing their dives at the lake.": "no_comma", "With an instrument in each hand Veronica Lodge put on a concert all by herself.": "Veronica", "The mayor rode a motorcycle past Mitchell Wilson's house during the parade.": "no_comma", "The actress signed autographs for Paxton Hall-Yoshida and his friends.": "no_comma", "Singing at the top of her lungs Cheryl Blossom woke up most of her neighbors.": "Cheryl", "Before she joins the chess team Nico Minoru wants me to help her practice.": "Nico", "Because he loves the smell of freshly cut grass Josuke Higashikata volunteered to mow the lawn.": "Josuke", "Until I learn how to drive Lucy Hernandez will have to take me to soccer practice.": "Lucy", "Jughead Jones refuses to eat celery unless it's covered in peanut butter.": "no_comma", "The musicians held a free concert at Joseph Joestar's school.": "no_comma", "Showing off his new cooking skills Jack Johnson flipped the pancake behind his back.": "Jack", "Fishing in the lake Karolina Dean tried not to get water in her boots.": "Karolina", "Chase Stein enjoys making clay models of his dog.": "no_comma", "During the national yo-yo convention Trent Harrison volunteered to teach the crowd some tricks.": "Trent", "Kaitlynn Price plays dodgeball in the house on rainy days.": "no_comma", "From the International Space Station Devi Vishwakumar sent an email to my science class.": "Devi", "The boys on Mitchell Wilson's swim team enjoy practicing their dives at the lake.": "no_comma", "Walking through the elves' workshop Cheryl Blossom inspected the handmade toys.": "Cheryl", "Jotaro Kujo keeps planning to visit aliens in outer space.": "no_comma", "The astronaut inspired Joseph Joestar to sign up for space camp.": "no_comma", "The mailman needed help carrying presents to Pops Johnson's door.": "no_comma", "In the dentist's waiting room Chase Stein read a magazine article about baby elephants.": "Chase", "Jack Johnson enjoys making clay models of his dog.": "no_comma", "I never knew that Paxton Hall-Yoshida could beatbox until I heard him at the hip-hop festival.": "no_comma", "On the park's fastest roller coaster Karolina Dean's baseball cap flew off her head.": "Karolina", "When she eats cereal Fabiola Torres always adds two cups of milk.": "Fabiola", "Eleanor Wong keeps planting palm trees all over town.": "no_comma", "Using the coupon Gertrude Yorkes got twenty extra tokens at the arcade.": "Gertrude", "The musicians held a free concert at Seth Acosta's school.": "no_comma", "Nico Minoru likes wearing polka dots and stripes at the same time.": "no_comma", "Kamala Nandiwadal loves playing the triangle in our school's marching band.": "no_comma", "I ride my scooter past Dre Johnson's comic book store on the way to school.": "no_comma", "Before she joins the chess team Rainbow Johnson wants me to help her practice.": "Rainbow", "At the mall food court Archie Andrews couldn't decide which soda he wanted.": "Archie", "The children left slippery banana peels all over Mitchell Wilson's clean floor.": "no_comma", "Josuke Higashikata updates his blog every day unless his favorite TV show is on.": "no_comma", "Inside the spy's secret headquarters Seth Acosta learned about the upcoming mission.": "Seth", "Karolina Dean dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "During the national yo-yo convention Jotaro Kujo volunteered to teach the crowd some tricks.": "Jotaro", "Gertrude Yorkes updates her blog every day unless her favorite TV show is on.": "no_comma", "Chase Stein started reading science fiction books after the library added a new section.": "no_comma", "Gertrude Yorkes refuses to eat celery unless it's covered in peanut butter.": "no_comma", "After his cousin's ballet recital Trent Harrison threw roses onto the stage.": "Trent", "On the park's fastest roller coaster Fabiola Torres's baseball cap flew off her head.": "Fabiola", "Pops Johnson dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Jumping on the trampoline Ben Gross did a split and touched his toes.": "Ben", "Mitchell Wilson started reading science fiction books after the library added a new section.": "no_comma", "Jonathan Joestar keeps planting palm trees all over town.": "no_comma", "When he eats cereal Jack Johnson always adds two cups of milk.": "Jack", "Paxton Hall-Yoshida loves playing the triangle in our school's marching band.": "no_comma", "Because he loves the smell of freshly cut grass Dre Johnson volunteered to mow the lawn.": "Dre", "The girls on Kaitlynn Price's swim team enjoy practicing their dives at the lake.": "no_comma", "Veronica Lodge plays dodgeball in the house on rainy days.": "no_comma", "The musicians held a free concert at Alex Wilder's school.": "no_comma", "I ride my scooter past Archie Andrews's comic book store on the way to school.": "no_comma", "When the radio station plays country music Dre Johnson sings louder than everyone else.": "Dre", "Diane Johnson is considering moving to Cairo next year.": "no_comma", "Using the coupon Kaitlynn Price got twenty extra tokens at the arcade.": "Kaitlynn", "Showing off her new cooking skills Devi Vishwakumar flipped the pancake behind her back.": "Devi", "From the International Space Station Eleanor Wong sent an email to my science class.": "Eleanor", "Singing at the top of his lungs Dio Brando woke up most of his neighbors.": "Dio", "Standing on the step stool Eleanor Wong could almost reach the cookie jar.": "Eleanor", "Sitting in the movie theater Chase Stein realized he had forgotten to buy popcorn.": "Chase", "During the national yo-yo convention Cheryl Blossom volunteered to teach the crowd some tricks.": "Cheryl", "Archie Andrews dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Because she invented a flying car Nico Minoru became a worldwide celebrity.": "Nico", "Using the coupon Jonathan Joestar got twenty extra tokens at the arcade.": "Jonathan", "During the championship soccer match Jughead Jones did cartwheels in front of the goal.": "Jughead", "Seth Acosta is considering moving to Cairo next year.": "no_comma", "Ben Gross plays dodgeball in the house on rainy days.": "no_comma", "Slurping her chicken noodle soup Rainbow Johnson had already decided to have another bowl.": "Rainbow", "I ride my scooter past Lucy Hernandez's comic book store on the way to school.": "no_comma", "Before he went on vacation Joseph Joestar bought a new neon swimsuit.": "Joseph", "Jotaro Kujo loves playing the triangle in our school's marching band.": "no_comma", "The mayor rode a motorcycle past Nalini Vishwakumar's house during the parade.": "no_comma", "After her cousin's ballet recital Veronica Lodge threw roses onto the stage.": "Veronica", "The actress signed autographs for Karolina Dean and her friends.": "no_comma", "From the top floor of the office building Lucy Hernandez could see the entire city.": "Lucy", "Since she tried blueberry ice cream Fabiola Torres has refused to eat any other flavor.": "Fabiola", "Fishing in the lake Rainbow Johnson tried not to get water in her boots.": "Rainbow", "Sniffing the soggy tuna sandwich Alex Wilder decided to eat a salad instead.": "Alex", "When the radio station plays country music Diane Johnson sings louder than everyone else.": "Diane", "Jotaro Kujo and I go camping in the Rocky Mountains every summer.": "no_comma", "Jogging through the park Devi Vishwakumar waved to everyone she saw.": "Devi", "Showing off his new cooking skills Ben Gross flipped the pancake behind his back.": "Ben", "With an instrument in each hand Jonathan Joestar put on a concert all by himself.": "Jonathan", "Sniffing the soggy tuna sandwich Kamala Nandiwadal decided to eat a salad instead.": "Kamala", "Chase Stein's cat loves swimming in the kiddie pool.": "no_comma", "The mayor rode a motorcycle past Josuke Higashikata's house during the parade.": "no_comma", "Jumping on the trampoline Veronica Lodge did a split and touched her toes.": "Veronica", "During the tour of the Transylvanian castle Seth Acosta kept an eye out for vampires.": "Seth", "My rabbit hides carrots under Kaitlynn Price's couch.": "no_comma", "Jack Johnson and I go camping in the Rocky Mountains every summer.": "no_comma", "Singing at the top of his lungs Dre Johnson woke up most of his neighbors.": "Dre", "Since she tried blueberry ice cream Rainbow Johnson has refused to eat any other flavor.": "Rainbow", "Slurping her chicken noodle soup Lucy Hernandez had already decided to have another bowl.": "Lucy", "Walking through the elves' workshop Archie Andrews inspected the handmade toys.": "Archie", "The children left slippery banana peels all over Pops Johnson's clean floor.": "no_comma", "From the top floor of the office building Eleanor Wong could see the entire city.": "Eleanor", "Mitchell Wilson is considering moving to Cairo next year.": "no_comma", "Inside the spy's secret headquarters Trent Harrison learned about the upcoming mission.": "Trent", "Jotaro Kujo started reading science fiction books after the library added a new section.": "no_comma", "The musicians held a free concert at Vivian Carter's school.": "no_comma", "When the radio station plays country music Pops Johnson sings louder than everyone else.": "Pops", "During the national yo-yo convention Alex Wilder volunteered to teach the crowd some tricks.": "Alex", "Before he went on vacation Jughead Jones bought a new neon swimsuit.": "Jughead", "Until I learn how to drive Seth Acosta will have to take me to soccer practice.": "Seth", "Kaitlynn Price enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "After he saw the Broadway play Jack Johnson waited outside to meet the actors.": "Jack", "Since he tried blueberry ice cream Archie Andrews has refused to eat any other flavor.": "Archie", "Eleanor Wong is considering moving to Cairo next year.": "no_comma", "Unless I serve cinnamon rolls at my party Joseph Joestar will not attend.": "Joseph", "Before she went on vacation Gertrude Yorkes bought a new neon swimsuit.": "Gertrude", "When she eats cereal Nico Minoru always adds two cups of milk.": "Nico", "Trent Harrison dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Using the coupon Karolina Dean got twenty extra tokens at the arcade.": "Karolina", "At the mall food court Molly Hayes Hernandez couldn't decide which soda she wanted.": "Molly", "Vivian Carter plays dodgeball in the house on rainy days.": "no_comma", "The children left slippery banana peels all over Cheryl Blossom's clean floor.": "no_comma", "Seth Acosta dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "The girls on Kamala Nandiwadal's swim team enjoy practicing their dives at the lake.": "no_comma", "After he saw the Broadway play Pops Johnson waited outside to meet the actors.": "Pops", "Jonathan Joestar likes wearing polka dots and stripes at the same time.": "no_comma", "Until I learn how to drive Veronica Lodge will have to take me to soccer practice.": "Veronica", "The mayor rode a motorcycle past Dre Johnson's house during the parade.": "no_comma", "Slurping his chicken noodle soup Jotaro Kujo had already decided to have another bowl.": "Jotaro", "During the national yo-yo convention Fabiola Torres volunteered to teach the crowd some tricks.": "Fabiola", "Jumping on the trampoline Josuke Higashikata did a split and touched his toes.": "Josuke", "When the radio station plays country music Josuke Higashikata sings louder than everyone else.": "Josuke", "With an instrument in each hand Diane Johnson put on a concert all by herself.": "Diane", "Because she loves the smell of freshly cut grass Molly Hayes Hernandez volunteered to mow the lawn.": "Molly", "Vivian Carter's cat loves swimming in the kiddie pool.": "no_comma", "Pops Johnson enjoys making clay models of his dog.": "no_comma", "Kaitlynn Price updates her blog every day unless her favorite TV show is on.": "no_comma", "In the dentist's waiting room Dre Johnson read a magazine article about baby elephants.": "Dre", "Because she invented a flying car Molly Hayes Hernandez became a worldwide celebrity.": "Molly", "Until I learn how to drive Nico Minoru will have to take me to soccer practice.": "Nico", "Unless I serve cinnamon rolls at my party Alex Wilder will not attend.": "Alex", "Showing off his new cooking skills Jonathan Joestar flipped the pancake behind his back.": "Jonathan", "Using the coupon Dio Brando got twenty extra tokens at the arcade.": "Dio", "Singing at the top of his lungs Josuke Higashikata woke up most of his neighbors.": "Josuke", "Sniffing the soggy tuna sandwich Chase Stein decided to eat a salad instead.": "Chase", "Fabiola Torres refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Sitting in the movie theater Dre Johnson realized he had forgotten to buy popcorn.": "Dre", "Rainbow Johnson keeps planning to visit aliens in outer space.": "no_comma", "Fishing in the lake Mitchell Wilson tried not to get water in his boots.": "Mitchell", "Because she loves the smell of freshly cut grass Karolina Dean volunteered to mow the lawn.": "Karolina", "On the park's fastest roller coaster Joseph Joestar's baseball cap flew off his head.": "Joseph", "Trent Harrison plays dodgeball in the house on rainy days.": "no_comma", "Archie Andrews's cat loves swimming in the kiddie pool.": "no_comma", "Jogging through the park Kamala Nandiwadal waved to everyone she saw.": "Kamala", "Jumping on the trampoline Paxton Hall-Yoshida did a split and touched his toes.": "Paxton", "Gertrude Yorkes keeps planting palm trees all over town.": "no_comma", "The astronaut inspired Josuke Higashikata to sign up for space camp.": "no_comma", "The children left slippery banana peels all over Chase Stein's clean floor.": "no_comma", "I never knew that Jack Johnson could beatbox until I heard him at the hip-hop festival.": "no_comma", "The girls on Gertrude Yorkes's swim team enjoy practicing their dives at the lake.": "no_comma", "Joseph Joestar's cat loves swimming in the kiddie pool.": "no_comma", "The mailman needed help carrying presents to Jughead Jones's door.": "no_comma", "Nalini Vishwakumar is considering moving to Cairo next year.": "no_comma", "Trent Harrison enjoys making clay models of his dog.": "no_comma", "Slurping his chicken noodle soup Ben Gross had already decided to have another bowl.": "Ben", "Unless I serve cinnamon rolls at my party Nico Minoru will not attend.": "Nico", "Veronica Lodge enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Molly Hayes Hernandez and I go camping in the Rocky Mountains every summer.": "no_comma", "Using the coupon Jack Johnson got twenty extra tokens at the arcade.": "Jack", "Archie Andrews keeps planting palm trees all over town.": "no_comma", "Mitchell Wilson enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "On the park's fastest roller coaster Paxton Hall-Yoshida's baseball cap flew off his head.": "Paxton", "My rabbit hides carrots under Dre Johnson's couch.": "no_comma", "I never knew that Diane Johnson could beatbox until I heard her at the hip-hop festival.": "no_comma", "During the national yo-yo convention Kamala Nandiwadal volunteered to teach the crowd some tricks.": "Kamala", "Since he tried blueberry ice cream Jack Johnson has refused to eat any other flavor.": "Jack", "Inside the spy's secret headquarters Pops Johnson learned about the upcoming mission.": "Pops", "Unless I serve cinnamon rolls at my party Chase Stein will not attend.": "Chase", "After his cousin's ballet recital Dre Johnson threw roses onto the stage.": "Dre", "From the top floor of the office building Jughead Jones could see the entire city.": "Jughead", "Before she went on vacation Karolina Dean bought a new neon swimsuit.": "Karolina", "Trent Harrison and I go camping in the Rocky Mountains every summer.": "no_comma", "Jogging through the park Rainbow Johnson waved to everyone she saw.": "Rainbow", "Slurping her chicken noodle soup Vivian Carter had already decided to have another bowl.": "Vivian", "Singing at the top of his lungs Joseph Joestar woke up most of his neighbors.": "Joseph", "Kaitlynn Price's cat loves swimming in the kiddie pool.": "no_comma", "Walking through the elves' workshop Devi Vishwakumar inspected the handmade toys.": "Devi", "Nico Minoru refuses to eat celery unless it's covered in peanut butter.": "no_comma", "My rabbit hides carrots under Nalini Vishwakumar's couch.": "no_comma", "In the dentist's waiting room Fabiola Torres read a magazine article about baby elephants.": "Fabiola", "Jumping on the trampoline Gertrude Yorkes did a split and touched her toes.": "Gertrude", "Molly Hayes Hernandez plays dodgeball in the house on rainy days.": "no_comma", "Veronica Lodge enjoys making clay models of her dog.": "no_comma", "Before she joins the chess team Diane Johnson wants me to help her practice.": "Diane", "During the tour of the Transylvanian castle Trent Harrison kept an eye out for vampires.": "Trent", "Because he invented a flying car Dio Brando became a worldwide celebrity.": "Dio", "At the mall food court Alex Wilder couldn't decide which soda he wanted.": "Alex", "Fabiola Torres loves playing the triangle in our school's marching band.": "no_comma", "During the national yo-yo convention Devi Vishwakumar volunteered to teach the crowd some tricks.": "Devi", "I ride my scooter past Chase Stein's comic book store on the way to school.": "no_comma", "From the International Space Station Cheryl Blossom sent an email to my science class.": "Cheryl", "Since he tried blueberry ice cream Paxton Hall-Yoshida has refused to eat any other flavor.": "Paxton", "Jumping on the trampoline Jotaro Kujo did a split and touched his toes.": "Jotaro", "Before she went on vacation Devi Vishwakumar bought a new neon swimsuit.": "Devi", "Pops Johnson loves playing the triangle in our school's marching band.": "no_comma", "The astronaut inspired Vivian Carter to sign up for space camp.": "no_comma", "Karolina Dean enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Walking through the elves' workshop Ben Gross inspected the handmade toys.": "Ben", "During the national yo-yo convention Jonathan Joestar volunteered to teach the crowd some tricks.": "Jonathan", "Inside the spy's secret headquarters Alex Wilder learned about the upcoming mission.": "Alex", "Jogging through the park Jack Johnson waved to everyone he saw.": "Jack", "Before he joins the chess team Joseph Joestar wants me to help him practice.": "Joseph", "The mayor rode a motorcycle past Archie Andrews's house during the parade.": "no_comma", "Using the coupon Seth Acosta got twenty extra tokens at the arcade.": "Seth", "Unless I serve cinnamon rolls at my party Seth Acosta will not attend.": "Seth", "On the park's fastest roller coaster Dio Brando's baseball cap flew off his head.": "Dio", "The mailman needed help carrying presents to Ben Gross's door.": "no_comma", "The children left slippery banana peels all over Dre Johnson's clean floor.": "no_comma", "After his cousin's ballet recital Josuke Higashikata threw roses onto the stage.": "Josuke", "Since she tried blueberry ice cream Vivian Carter has refused to eat any other flavor.": "Vivian", "At the mall food court Jonathan Joestar couldn't decide which soda he wanted.": "Jonathan", "My rabbit hides carrots under Molly Hayes Hernandez's couch.": "no_comma", "Karolina Dean started reading science fiction books after the library added a new section.": "no_comma", "The mailman needed help carrying presents to Dre Johnson's door.": "no_comma", "Trent Harrison enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "During the tour of the Transylvanian castle Nalini Vishwakumar kept an eye out for vampires.": "Nalini", "Because he invented a flying car Seth Acosta became a worldwide celebrity.": "Seth", "When he eats cereal Chase Stein always adds two cups of milk.": "Chase", "I never knew that Jughead Jones could beatbox until I heard him at the hip-hop festival.": "no_comma", "Showing off her new cooking skills Kamala Nandiwadal flipped the pancake behind her back.": "Kamala", "Paxton Hall-Yoshida dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Mitchell Wilson likes wearing polka dots and stripes at the same time.": "no_comma", "Before she joins the chess team Fabiola Torres wants me to help her practice.": "Fabiola", "I ride my scooter past Cheryl Blossom's comic book store on the way to school.": "no_comma", "The musicians held a free concert at Veronica Lodge's school.": "no_comma", "Before she went on vacation Kaitlynn Price bought a new neon swimsuit.": "Kaitlynn", "Dre Johnson loves playing the triangle in our school's marching band.": "no_comma", "The actress signed autographs for Nico Minoru and her friends.": "no_comma", "Jonathan Joestar keeps planning to visit aliens in outer space.": "no_comma", "The mailman needed help carrying presents to Cheryl Blossom's door.": "no_comma", "The musicians held a free concert at Chase Stein's school.": "no_comma", "Before he went on vacation Paxton Hall-Yoshida bought a new neon swimsuit.": "Paxton", "When the radio station plays country music Karolina Dean sings louder than everyone else.": "Karolina", "Slurping his chicken noodle soup Dio Brando had already decided to have another bowl.": "Dio", "At the mall food court Jack Johnson couldn't decide which soda he wanted.": "Jack", "Sitting in the movie theater Pops Johnson realized he had forgotten to buy popcorn.": "Pops", "Singing at the top of her lungs Devi Vishwakumar woke up most of her neighbors.": "Devi", "My rabbit hides carrots under Eleanor Wong's couch.": "no_comma", "Rainbow Johnson keeps planting palm trees all over town.": "no_comma", "The astronaut inspired Nalini Vishwakumar to sign up for space camp.": "no_comma", "The boys on Seth Acosta's swim team enjoy practicing their dives at the lake.": "no_comma", "The actress signed autographs for Molly Hayes Hernandez and her friends.": "no_comma", "Ben Gross keeps planting palm trees all over town.": "no_comma", "Using the coupon Cheryl Blossom got twenty extra tokens at the arcade.": "Cheryl", "Karolina Dean updates her blog every day unless her favorite TV show is on.": "no_comma", "The girls on Eleanor Wong's swim team enjoy practicing their dives at the lake.": "no_comma", "During the tour of the Transylvanian castle Dre Johnson kept an eye out for vampires.": "Dre", "The children left slippery banana peels all over Fabiola Torres's clean floor.": "no_comma", "Pops Johnson keeps planning to visit aliens in outer space.": "no_comma", "Because she invented a flying car Veronica Lodge became a worldwide celebrity.": "Veronica", "With an instrument in each hand Rainbow Johnson put on a concert all by herself.": "Rainbow", "During the championship soccer match Mitchell Wilson did cartwheels in front of the goal.": "Mitchell", "Inside the spy's secret headquarters Jughead Jones learned about the upcoming mission.": "Jughead", "Josuke Higashikata started reading science fiction books after the library added a new section.": "no_comma", "Showing off her new cooking skills Nico Minoru flipped the pancake behind her back.": "Nico", "Devi Vishwakumar likes wearing polka dots and stripes at the same time.": "no_comma", "Dre Johnson is considering moving to Cairo next year.": "no_comma", "The mayor rode a motorcycle past Rainbow Johnson's house during the parade.": "no_comma", "Until I learn how to drive Molly Hayes Hernandez will have to take me to soccer practice.": "Molly", "Gertrude Yorkes's cat loves swimming in the kiddie pool.": "no_comma", "I never knew that Trent Harrison could beatbox until I heard him at the hip-hop festival.": "no_comma", "Because he loves the smell of freshly cut grass Dio Brando volunteered to mow the lawn.": "Dio", "From the International Space Station Archie Andrews sent an email to my science class.": "Archie", "My rabbit hides carrots under Rainbow Johnson's couch.": "no_comma", "Inside the spy's secret headquarters Veronica Lodge learned about the upcoming mission.": "Veronica", "Walking through the elves' workshop Chase Stein inspected the handmade toys.": "Chase", "Singing at the top of his lungs Ben Gross woke up most of his neighbors.": "Ben", "Diane Johnson's cat loves swimming in the kiddie pool.": "no_comma", "Dre Johnson enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "At the mall food court Jotaro Kujo couldn't decide which soda he wanted.": "Jotaro", "During the championship soccer match Vivian Carter did cartwheels in front of the goal.": "Vivian", "The astronaut inspired Cheryl Blossom to sign up for space camp.": "no_comma", "During the national yo-yo convention Molly Hayes Hernandez volunteered to teach the crowd some tricks.": "Molly", "Showing off his new cooking skills Chase Stein flipped the pancake behind his back.": "Chase", "Jotaro Kujo refuses to eat celery unless it's covered in peanut butter.": "no_comma", "From the International Space Station Diane Johnson sent an email to my science class.": "Diane", "Jogging through the park Josuke Higashikata waved to everyone he saw.": "Josuke", "On the park's fastest roller coaster Nalini Vishwakumar's baseball cap flew off her head.": "Nalini", "The children left slippery banana peels all over Gertrude Yorkes's clean floor.": "no_comma", "The mailman needed help carrying presents to Fabiola Torres's door.": "no_comma", "Unless I serve cinnamon rolls at my party Karolina Dean will not attend.": "Karolina", "With an instrument in each hand Paxton Hall-Yoshida put on a concert all by himself.": "Paxton", "Rainbow Johnson updates her blog every day unless her favorite TV show is on.": "no_comma", "In the dentist's waiting room Diane Johnson read a magazine article about baby elephants.": "Diane", "When she eats cereal Kamala Nandiwadal always adds two cups of milk.": "Kamala", "I never knew that Kaitlynn Price could beatbox until I heard her at the hip-hop festival.": "no_comma", "Inside the spy's secret headquarters Vivian Carter learned about the upcoming mission.": "Vivian", "The children left slippery banana peels all over Jack Johnson's clean floor.": "no_comma", "My rabbit hides carrots under Ben Gross's couch.": "no_comma", "Slurping her chicken noodle soup Eleanor Wong had already decided to have another bowl.": "Eleanor", "At the mall food court Fabiola Torres couldn't decide which soda she wanted.": "Fabiola", "After he saw the Broadway play Joseph Joestar waited outside to meet the actors.": "Joseph", "After his cousin's ballet recital Archie Andrews threw roses onto the stage.": "Archie", "Trent Harrison loves playing the triangle in our school's marching band.": "no_comma", "During the championship soccer match Nalini Vishwakumar did cartwheels in front of the goal.": "Nalini", "In the dentist's waiting room Molly Hayes Hernandez read a magazine article about baby elephants.": "Molly", "Lucy Hernandez refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Eleanor Wong updates her blog every day unless her favorite TV show is on.": "no_comma", "Using the coupon Fabiola Torres got twenty extra tokens at the arcade.": "Fabiola", "Lucy Hernandez enjoys making clay models of her dog.": "no_comma", "Jughead Jones keeps planning to visit aliens in outer space.": "no_comma", "Fishing in the lake Vivian Carter tried not to get water in her boots.": "Vivian", "Sniffing the soggy tuna sandwich Lucy Hernandez decided to eat a salad instead.": "Lucy", "During the championship soccer match Pops Johnson did cartwheels in front of the goal.": "Pops", "Kamala Nandiwadal dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "When the radio station plays country music Seth Acosta sings louder than everyone else.": "Seth", "After she saw the Broadway play Cheryl Blossom waited outside to meet the actors.": "Cheryl", "Before he joins the chess team Jack Johnson wants me to help him practice.": "Jack", "Slurping her chicken noodle soup Karolina Dean had already decided to have another bowl.": "Karolina", "Because he loves the smell of freshly cut grass Jughead Jones volunteered to mow the lawn.": "Jughead", "The actress signed autographs for Dre Johnson and his friends.": "no_comma", "Standing on the step stool Nico Minoru could almost reach the cookie jar.": "Nico", "Karolina Dean keeps planting palm trees all over town.": "no_comma", "After her cousin's ballet recital Rainbow Johnson threw roses onto the stage.": "Rainbow", "Ben Gross keeps planning to visit aliens in outer space.": "no_comma", "I never knew that Gertrude Yorkes could beatbox until I heard her at the hip-hop festival.": "no_comma", "The children left slippery banana peels all over Paxton Hall-Yoshida's clean floor.": "no_comma", "The astronaut inspired Diane Johnson to sign up for space camp.": "no_comma", "Walking through the elves' workshop Vivian Carter inspected the handmade toys.": "Vivian", "Fishing in the lake Chase Stein tried not to get water in his boots.": "Chase", "When she eats cereal Karolina Dean always adds two cups of milk.": "Karolina", "When the radio station plays country music Devi Vishwakumar sings louder than everyone else.": "Devi", "During the championship soccer match Dre Johnson did cartwheels in front of the goal.": "Dre", "On the park's fastest roller coaster Mitchell Wilson's baseball cap flew off his head.": "Mitchell", "Until I learn how to drive Cheryl Blossom will have to take me to soccer practice.": "Cheryl", "Diane Johnson enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Jughead Jones likes wearing polka dots and stripes at the same time.": "no_comma", "I ride my scooter past Molly Hayes Hernandez's comic book store on the way to school.": "no_comma", "Kaitlynn Price started reading science fiction books after the library added a new section.": "no_comma", "Jumping on the trampoline Trent Harrison did a split and touched his toes.": "Trent", "Sitting in the movie theater Dio Brando realized he had forgotten to buy popcorn.": "Dio", "Alex Wilder keeps planting palm trees all over town.": "no_comma", "Jughead Jones started reading science fiction books after the library added a new section.": "no_comma", "Eleanor Wong enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "Unless I serve cinnamon rolls at my party Cheryl Blossom will not attend.": "Cheryl", "At the mall food court Ben Gross couldn't decide which soda he wanted.": "Ben", "Until I learn how to drive Diane Johnson will have to take me to soccer practice.": "Diane", "During the national yo-yo convention Seth Acosta volunteered to teach the crowd some tricks.": "Seth", "Standing on the step stool Joseph Joestar could almost reach the cookie jar.": "Joseph", "Jogging through the park Molly Hayes Hernandez waved to everyone she saw.": "Molly", "The girls on Nalini Vishwakumar's swim team enjoy practicing their dives at the lake.": "no_comma", "Fishing in the lake Devi Vishwakumar tried not to get water in her boots.": "Devi", "Because she invented a flying car Karolina Dean became a worldwide celebrity.": "Karolina", "Inside the spy's secret headquarters Jotaro Kujo learned about the upcoming mission.": "Jotaro", "Before she went on vacation Cheryl Blossom bought a new neon swimsuit.": "Cheryl", "After his cousin's ballet recital Jughead Jones threw roses onto the stage.": "Jughead", "The children left slippery banana peels all over Eleanor Wong's clean floor.": "no_comma", "Jonathan Joestar plays dodgeball in the house on rainy days.": "no_comma", "With an instrument in each hand Nalini Vishwakumar put on a concert all by herself.": "Nalini", "The mailman needed help carrying presents to Veronica Lodge's door.": "no_comma", "Walking through the elves' workshop Fabiola Torres inspected the handmade toys.": "Fabiola", "Gertrude Yorkes dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "Pops Johnson plays dodgeball in the house on rainy days.": "no_comma", "Gertrude Yorkes enjoys making clay models of her dog.": "no_comma", "Singing at the top of her lungs Veronica Lodge woke up most of her neighbors.": "Veronica", "I never knew that Jonathan Joestar could beatbox until I heard him at the hip-hop festival.": "no_comma", "Unless I serve cinnamon rolls at my party Archie Andrews will not attend.": "Archie", "Rainbow Johnson and I go camping in the Rocky Mountains every summer.": "no_comma", "From the top floor of the office building Nico Minoru could see the entire city.": "Nico", "Because she loves the smell of freshly cut grass Vivian Carter volunteered to mow the lawn.": "Vivian", "Sitting in the movie theater Trent Harrison realized he had forgotten to buy popcorn.": "Trent", "On the park's fastest roller coaster Archie Andrews's baseball cap flew off his head.": "Archie", "Sniffing the soggy tuna sandwich Pops Johnson decided to eat a salad instead.": "Pops", "During the tour of the Transylvanian castle Jonathan Joestar kept an eye out for vampires.": "Jonathan", "In the dentist's waiting room Alex Wilder read a magazine article about baby elephants.": "Alex", "During the championship soccer match Veronica Lodge did cartwheels in front of the goal.": "Veronica", "Nalini Vishwakumar enjoys making clay models of her dog.": "no_comma", "In the dentist's waiting room Mitchell Wilson read a magazine article about baby elephants.": "Mitchell", "The children left slippery banana peels all over Jonathan Joestar's clean floor.": "no_comma", "Josuke Higashikata refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Lucy Hernandez updates her blog every day unless her favorite TV show is on.": "no_comma", "I never knew that Archie Andrews could beatbox until I heard him at the hip-hop festival.": "no_comma", "The musicians held a free concert at Rainbow Johnson's school.": "no_comma", "Joseph Joestar keeps planning to visit aliens in outer space.": "no_comma", "On the park's fastest roller coaster Kamala Nandiwadal's baseball cap flew off her head.": "Kamala", "After her cousin's ballet recital Eleanor Wong threw roses onto the stage.": "Eleanor", "The boys on Trent Harrison's swim team enjoy practicing their dives at the lake.": "no_comma", "Dre Johnson started reading science fiction books after the library added a new section.": "no_comma", "During the championship soccer match Trent Harrison did cartwheels in front of the goal.": "Trent", "Slurping his chicken noodle soup Jughead Jones had already decided to have another bowl.": "Jughead", "Inside the spy's secret headquarters Nalini Vishwakumar learned about the upcoming mission.": "Nalini", "Because he invented a flying car Mitchell Wilson became a worldwide celebrity.": "Mitchell", "When the radio station plays country music Dio Brando sings louder than everyone else.": "Dio", "Alex Wilder is considering moving to Cairo next year.": "no_comma", "The children left slippery banana peels all over Kaitlynn Price's clean floor.": "no_comma", "Rainbow Johnson's cat loves swimming in the kiddie pool.": "no_comma", "During the tour of the Transylvanian castle Veronica Lodge kept an eye out for vampires.": "Veronica", "From the top floor of the office building Gertrude Yorkes could see the entire city.": "Gertrude", "Jotaro Kujo plays dodgeball in the house on rainy days.": "no_comma", "The boys on Ben Gross's swim team enjoy practicing their dives at the lake.": "no_comma", "Before she joins the chess team Vivian Carter wants me to help her practice.": "Vivian", "During the championship soccer match Lucy Hernandez did cartwheels in front of the goal.": "Lucy", "Inside the spy's secret headquarters Archie Andrews learned about the upcoming mission.": "Archie", "The mailman needed help carrying presents to Eleanor Wong's door.": "no_comma", "Before he joins the chess team Jonathan Joestar wants me to help him practice.": "Jonathan", "Fishing in the lake Lucy Hernandez tried not to get water in her boots.": "Lucy", "Joseph Joestar plays dodgeball in the house on rainy days.": "no_comma", "Sitting in the movie theater Mitchell Wilson realized he had forgotten to buy popcorn.": "Mitchell", "After her cousin's ballet recital Vivian Carter threw roses onto the stage.": "Vivian", "Until I learn how to drive Fabiola Torres will have to take me to soccer practice.": "Fabiola", "The actress signed autographs for Kaitlynn Price and her friends.": "no_comma", "The musicians held a free concert at Josuke Higashikata's school.": "no_comma", "From the International Space Station Jotaro Kujo sent an email to my science class.": "Jotaro", "Because she invented a flying car Fabiola Torres became a worldwide celebrity.": "Fabiola", "Seth Acosta refuses to eat celery unless it's covered in peanut butter.": "no_comma", "From the top floor of the office building Kamala Nandiwadal could see the entire city.": "Kamala", "The mayor rode a motorcycle past Jonathan Joestar's house during the parade.": "no_comma", "The astronaut inspired Alex Wilder to sign up for space camp.": "no_comma", "At the mall food court Veronica Lodge couldn't decide which soda she wanted.": "Veronica", "The children left slippery banana peels all over Jughead Jones's clean floor.": "no_comma", "My rabbit hides carrots under Paxton Hall-Yoshida's couch.": "no_comma", "Sniffing the soggy tuna sandwich Archie Andrews decided to eat a salad instead.": "Archie", "The actress signed autographs for Jotaro Kujo and his friends.": "no_comma", "Since she tried blueberry ice cream Nalini Vishwakumar has refused to eat any other flavor.": "Nalini", "Josuke Higashikata plays dodgeball in the house on rainy days.": "no_comma", "Fishing in the lake Diane Johnson tried not to get water in her boots.": "Diane", "During the championship soccer match Chase Stein did cartwheels in front of the goal.": "Chase", "Because he loves the smell of freshly cut grass Ben Gross volunteered to mow the lawn.": "Ben", "Slurping his chicken noodle soup Joseph Joestar had already decided to have another bowl.": "Joseph", "Josuke Higashikata keeps planning to visit aliens in outer space.": "no_comma", "Unless I serve cinnamon rolls at my party Jotaro Kujo will not attend.": "Jotaro", "Sniffing the soggy tuna sandwich Jonathan Joestar decided to eat a salad instead.": "Jonathan", "In the dentist's waiting room Archie Andrews read a magazine article about baby elephants.": "Archie", "Before he went on vacation Pops Johnson bought a new neon swimsuit.": "Pops", "I ride my scooter past Eleanor Wong's comic book store on the way to school.": "no_comma", "Nico Minoru loves playing the triangle in our school's marching band.": "no_comma", "Showing off her new cooking skills Fabiola Torres flipped the pancake behind her back.": "Fabiola", "Until I learn how to drive Jughead Jones will have to take me to soccer practice.": "Jughead", "The mayor rode a motorcycle past Ben Gross's house during the parade.": "no_comma", "After her cousin's ballet recital Molly Hayes Hernandez threw roses onto the stage.": "Molly", "Since she tried blueberry ice cream Kamala Nandiwadal has refused to eat any other flavor.": "Kamala", "With an instrument in each hand Fabiola Torres put on a concert all by herself.": "Fabiola", "Because she loves the smell of freshly cut grass Nalini Vishwakumar volunteered to mow the lawn.": "Nalini", "Lucy Hernandez keeps planting palm trees all over town.": "no_comma", "When the radio station plays country music Nico Minoru sings louder than everyone else.": "Nico", "Nalini Vishwakumar dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "Fishing in the lake Veronica Lodge tried not to get water in her boots.": "Veronica", "Seth Acosta keeps planning to visit aliens in outer space.": "no_comma", "During the tour of the Transylvanian castle Rainbow Johnson kept an eye out for vampires.": "Rainbow", "Slurping his chicken noodle soup Jack Johnson had already decided to have another bowl.": "Jack", "Standing on the step stool Mitchell Wilson could almost reach the cookie jar.": "Mitchell", "Devi Vishwakumar loves playing the triangle in our school's marching band.": "no_comma", "The children left slippery banana peels all over Kamala Nandiwadal's clean floor.": "no_comma", "The boys on Dio Brando's swim team enjoy practicing their dives at the lake.": "no_comma", "Vivian Carter started reading science fiction books after the library added a new section.": "no_comma", "Inside the spy's secret headquarters Diane Johnson learned about the upcoming mission.": "Diane", "Unless I serve cinnamon rolls at my party Kaitlynn Price will not attend.": "Kaitlynn", "Chase Stein likes wearing polka dots and stripes at the same time.": "no_comma", "Walking through the elves' workshop Veronica Lodge inspected the handmade toys.": "Veronica", "Before he joins the chess team Ben Gross wants me to help him practice.": "Ben", "During the national yo-yo convention Gertrude Yorkes volunteered to teach the crowd some tricks.": "Gertrude", "The mailman needed help carrying presents to Mitchell Wilson's door.": "no_comma", "With an instrument in each hand Lucy Hernandez put on a concert all by herself.": "Lucy", "Because she invented a flying car Devi Vishwakumar became a worldwide celebrity.": "Devi", "When the radio station plays country music Gertrude Yorkes sings louder than everyone else.": "Gertrude", "Jumping on the trampoline Fabiola Torres did a split and touched her toes.": "Fabiola", "Josuke Higashikata and I go camping in the Rocky Mountains every summer.": "no_comma", "Using the coupon Jotaro Kujo got twenty extra tokens at the arcade.": "Jotaro", "Walking through the elves' workshop Eleanor Wong inspected the handmade toys.": "Eleanor", "Jack Johnson's cat loves swimming in the kiddie pool.": "no_comma", "I ride my scooter past Seth Acosta's comic book store on the way to school.": "no_comma", "Before she went on vacation Nalini Vishwakumar bought a new neon swimsuit.": "Nalini", "The mailman needed help carrying presents to Molly Hayes Hernandez's door.": "no_comma", "Because she loves the smell of freshly cut grass Veronica Lodge volunteered to mow the lawn.": "Veronica", "The children left slippery banana peels all over Dio Brando's clean floor.": "no_comma", "Before she joins the chess team Devi Vishwakumar wants me to help her practice.": "Devi", "With an instrument in each hand Chase Stein put on a concert all by himself.": "Chase", "The actress signed autographs for Gertrude Yorkes and her friends.": "no_comma", "Archie Andrews likes wearing polka dots and stripes at the same time.": "no_comma", "After his cousin's ballet recital Joseph Joestar threw roses onto the stage.": "Joseph", "Using the coupon Eleanor Wong got twenty extra tokens at the arcade.": "Eleanor", "Before he joins the chess team Jotaro Kujo wants me to help him practice.": "Jotaro", "I ride my scooter past Kamala Nandiwadal's comic book store on the way to school.": "no_comma", "Because he invented a flying car Pops Johnson became a worldwide celebrity.": "Pops", "From the International Space Station Gertrude Yorkes sent an email to my science class.": "Gertrude", "After her cousin's ballet recital Kamala Nandiwadal threw roses onto the stage.": "Kamala", "In the dentist's waiting room Veronica Lodge read a magazine article about baby elephants.": "Veronica", "Showing off his new cooking skills Dio Brando flipped the pancake behind his back.": "Dio", "The musicians held a free concert at Ben Gross's school.": "no_comma", "The children left slippery banana peels all over Diane Johnson's clean floor.": "no_comma", "During the tour of the Transylvanian castle Mitchell Wilson kept an eye out for vampires.": "Mitchell", "Joseph Joestar likes wearing polka dots and stripes at the same time.": "no_comma", "Because he invented a flying car Ben Gross became a worldwide celebrity.": "Ben", "Joseph Joestar started reading science fiction books after the library added a new section.": "no_comma", "Before she joins the chess team Veronica Lodge wants me to help her practice.": "Veronica", "On the park's fastest roller coaster Seth Acosta's baseball cap flew off his head.": "Seth", "Walking through the elves' workshop Jotaro Kujo inspected the handmade toys.": "Jotaro", "When she eats cereal Molly Hayes Hernandez always adds two cups of milk.": "Molly", "During the championship soccer match Kaitlynn Price did cartwheels in front of the goal.": "Kaitlynn", "Because she loves the smell of freshly cut grass Fabiola Torres volunteered to mow the lawn.": "Fabiola", "Before he went on vacation Alex Wilder bought a new neon swimsuit.": "Alex", "Archie Andrews is considering moving to Cairo next year.": "no_comma", "At the mall food court Eleanor Wong couldn't decide which soda she wanted.": "Eleanor", "Jogging through the park Nalini Vishwakumar waved to everyone she saw.": "Nalini", "From the International Space Station Kamala Nandiwadal sent an email to my science class.": "Kamala", "During the tour of the Transylvanian castle Josuke Higashikata kept an eye out for vampires.": "Josuke", "Pops Johnson and I go camping in the Rocky Mountains every summer.": "no_comma", "Dio Brando loves playing the triangle in our school's marching band.": "no_comma", "The actress signed autographs for Lucy Hernandez and her friends.": "no_comma", "Fishing in the lake Paxton Hall-Yoshida tried not to get water in his boots.": "Paxton", "After she saw the Broadway play Veronica Lodge waited outside to meet the actors.": "Veronica", "Walking through the elves' workshop Nico Minoru inspected the handmade toys.": "Nico", "Lucy Hernandez likes wearing polka dots and stripes at the same time.": "no_comma", "From the International Space Station Nalini Vishwakumar sent an email to my science class.": "Nalini", "I ride my scooter past Gertrude Yorkes's comic book store on the way to school.": "no_comma", "Paxton Hall-Yoshida enjoys making clay models of his dog.": "no_comma", "Slurping her chicken noodle soup Devi Vishwakumar had already decided to have another bowl.": "Devi", "Fabiola Torres plays dodgeball in the house on rainy days.": "no_comma", "The actress signed autographs for Vivian Carter and her friends.": "no_comma", "From the top floor of the office building Jotaro Kujo could see the entire city.": "Jotaro", "Nico Minoru is considering moving to Cairo next year.": "no_comma", "Molly Hayes Hernandez likes wearing polka dots and stripes at the same time.": "no_comma", "Jogging through the park Lucy Hernandez waved to everyone she saw.": "Lucy", "Jonathan Joestar loves playing the triangle in our school's marching band.": "no_comma", "I never knew that Vivian Carter could beatbox until I heard her at the hip-hop festival.": "no_comma", "Joseph Joestar keeps planting palm trees all over town.": "no_comma", "Jogging through the park Diane Johnson waved to everyone she saw.": "Diane", "Kaitlynn Price and I go camping in the Rocky Mountains every summer.": "no_comma", "On the park's fastest roller coaster Ben Gross's baseball cap flew off his head.": "Ben", "Jumping on the trampoline Karolina Dean did a split and touched her toes.": "Karolina", "Sniffing the soggy tuna sandwich Paxton Hall-Yoshida decided to eat a salad instead.": "Paxton", "The mayor rode a motorcycle past Molly Hayes Hernandez's house during the parade.": "no_comma", "From the International Space Station Chase Stein sent an email to my science class.": "Chase", "Cheryl Blossom plays dodgeball in the house on rainy days.": "no_comma", "After she saw the Broadway play Fabiola Torres waited outside to meet the actors.": "Fabiola", "Sitting in the movie theater Cheryl Blossom realized she had forgotten to buy popcorn.": "Cheryl", "During the championship soccer match Josuke Higashikata did cartwheels in front of the goal.": "Josuke", "Fishing in the lake Kamala Nandiwadal tried not to get water in her boots.": "Kamala", "Slurping her chicken noodle soup Nico Minoru had already decided to have another bowl.": "Nico", "Using the coupon Vivian Carter got twenty extra tokens at the arcade.": "Vivian", "Sitting in the movie theater Eleanor Wong realized she had forgotten to buy popcorn.": "Eleanor", "Until I learn how to drive Paxton Hall-Yoshida will have to take me to soccer practice.": "Paxton", "Diane Johnson loves playing the triangle in our school's marching band.": "no_comma", "Because he loves the smell of freshly cut grass Chase Stein volunteered to mow the lawn.": "Chase", "The actress signed autographs for Rainbow Johnson and her friends.": "no_comma", "The mayor rode a motorcycle past Nico Minoru's house during the parade.": "no_comma", "Jotaro Kujo is considering moving to Cairo next year.": "no_comma", "My rabbit hides carrots under Cheryl Blossom's couch.": "no_comma", "Jogging through the park Mitchell Wilson waved to everyone he saw.": "Mitchell", "Devi Vishwakumar dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "Since he tried blueberry ice cream Seth Acosta has refused to eat any other flavor.": "Seth", "Before she joins the chess team Nalini Vishwakumar wants me to help her practice.": "Nalini", "Joseph Joestar and I go camping in the Rocky Mountains every summer.": "no_comma", "Walking through the elves' workshop Gertrude Yorkes inspected the handmade toys.": "Gertrude", "The astronaut inspired Kamala Nandiwadal to sign up for space camp.": "no_comma", "After he saw the Broadway play Jonathan Joestar waited outside to meet the actors.": "Jonathan", "Diane Johnson refuses to eat celery unless it's covered in peanut butter.": "no_comma", "With an instrument in each hand Cheryl Blossom put on a concert all by herself.": "Cheryl", "Fishing in the lake Josuke Higashikata tried not to get water in his boots.": "Josuke", "Standing on the step stool Pops Johnson could almost reach the cookie jar.": "Pops", "The musicians held a free concert at Karolina Dean's school.": "no_comma", "The mayor rode a motorcycle past Gertrude Yorkes's house during the parade.": "no_comma", "In the dentist's waiting room Seth Acosta read a magazine article about baby elephants.": "Seth", "Inside the spy's secret headquarters Cheryl Blossom learned about the upcoming mission.": "Cheryl", "From the International Space Station Ben Gross sent an email to my science class.": "Ben", "Sitting in the movie theater Jonathan Joestar realized he had forgotten to buy popcorn.": "Jonathan", "When he eats cereal Mitchell Wilson always adds two cups of milk.": "Mitchell", "Before he went on vacation Dre Johnson bought a new neon swimsuit.": "Dre", "The mailman needed help carrying presents to Paxton Hall-Yoshida's door.": "no_comma", "Gertrude Yorkes loves playing the triangle in our school's marching band.": "no_comma", "After she saw the Broadway play Vivian Carter waited outside to meet the actors.": "Vivian", "Nalini Vishwakumar enjoys baking cookies as long as she gets to lick the spoon afterward.": "no_comma", "My rabbit hides carrots under Chase Stein's couch.": "no_comma", "During the tour of the Transylvanian castle Diane Johnson kept an eye out for vampires.": "Diane", "I never knew that Lucy Hernandez could beatbox until I heard her at the hip-hop festival.": "no_comma", "Showing off her new cooking skills Eleanor Wong flipped the pancake behind her back.": "Eleanor", "Molly Hayes Hernandez started reading science fiction books after the library added a new section.": "no_comma", "Sniffing the soggy tuna sandwich Mitchell Wilson decided to eat a salad instead.": "Mitchell", "When the radio station plays country music Ben Gross sings louder than everyone else.": "Ben", "In the dentist's waiting room Josuke Higashikata read a magazine article about baby elephants.": "Josuke", "Veronica Lodge is considering moving to Cairo next year.": "no_comma", "Using the coupon Nico Minoru got twenty extra tokens at the arcade.": "Nico", "Jogging through the park Dre Johnson waved to everyone he saw.": "Dre", "From the International Space Station Jack Johnson sent an email to my science class.": "Jack", "Sniffing the soggy tuna sandwich Jughead Jones decided to eat a salad instead.": "Jughead", "The musicians held a free concert at Jack Johnson's school.": "no_comma", "Unless I serve cinnamon rolls at my party Nalini Vishwakumar will not attend.": "Nalini", "I ride my scooter past Pops Johnson's comic book store on the way to school.": "no_comma", "Before she went on vacation Nico Minoru bought a new neon swimsuit.": "Nico", "From the International Space Station Josuke Higashikata sent an email to my science class.": "Josuke", "From the top floor of the office building Jack Johnson could see the entire city.": "Jack", "The astronaut inspired Archie Andrews to sign up for space camp.": "no_comma", "During the tour of the Transylvanian castle Joseph Joestar kept an eye out for vampires.": "Joseph", "Standing on the step stool Dio Brando could almost reach the cookie jar.": "Dio", "During the championship soccer match Rainbow Johnson did cartwheels in front of the goal.": "Rainbow", "Paxton Hall-Yoshida's cat loves swimming in the kiddie pool.": "no_comma", "During the national yo-yo convention Josuke Higashikata volunteered to teach the crowd some tricks.": "Josuke", "Jumping on the trampoline Chase Stein did a split and touched his toes.": "Chase", "Walking through the elves' workshop Dre Johnson inspected the handmade toys.": "Dre", "Vivian Carter refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Lucy Hernandez plays dodgeball in the house on rainy days.": "no_comma", "On the park's fastest roller coaster Jotaro Kujo's baseball cap flew off his head.": "Jotaro", "Inside the spy's secret headquarters Paxton Hall-Yoshida learned about the upcoming mission.": "Paxton", "During the national yo-yo convention Karolina Dean volunteered to teach the crowd some tricks.": "Karolina", "Sitting in the movie theater Jack Johnson realized he had forgotten to buy popcorn.": "Jack", "When he eats cereal Jonathan Joestar always adds two cups of milk.": "Jonathan", "At the mall food court Joseph Joestar couldn't decide which soda he wanted.": "Joseph", "Jogging through the park Nico Minoru waved to everyone she saw.": "Nico", "Unless I serve cinnamon rolls at my party Trent Harrison will not attend.": "Trent", "Using the coupon Alex Wilder got twenty extra tokens at the arcade.": "Alex", "Jumping on the trampoline Pops Johnson did a split and touched his toes.": "Pops", "Showing off her new cooking skills Kaitlynn Price flipped the pancake behind her back.": "Kaitlynn", "After his cousin's ballet recital Chase Stein threw roses onto the stage.": "Chase", "Kamala Nandiwadal likes wearing polka dots and stripes at the same time.": "no_comma", "Nico Minoru and I go camping in the Rocky Mountains every summer.": "no_comma", "Jogging through the park Pops Johnson waved to everyone he saw.": "Pops", "During the tour of the Transylvanian castle Dio Brando kept an eye out for vampires.": "Dio", "The musicians held a free concert at Nalini Vishwakumar's school.": "no_comma", "Showing off her new cooking skills Rainbow Johnson flipped the pancake behind her back.": "Rainbow", "Fishing in the lake Seth Acosta tried not to get water in his boots.": "Seth", "The mailman needed help carrying presents to Diane Johnson's door.": "no_comma", "I never knew that Fabiola Torres could beatbox until I heard her at the hip-hop festival.": "no_comma", "Sitting in the movie theater Archie Andrews realized he had forgotten to buy popcorn.": "Archie", "Sniffing the soggy tuna sandwich Devi Vishwakumar decided to eat a salad instead.": "Devi", "Slurping his chicken noodle soup Alex Wilder had already decided to have another bowl.": "Alex", "Jotaro Kujo keeps planting palm trees all over town.": "no_comma", "From the top floor of the office building Dre Johnson could see the entire city.": "Dre", "During the championship soccer match Devi Vishwakumar did cartwheels in front of the goal.": "Devi", "Walking through the elves' workshop Kaitlynn Price inspected the handmade toys.": "Kaitlynn", "The boys on Paxton Hall-Yoshida's swim team enjoy practicing their dives at the lake.": "no_comma", "Singing at the top of her lungs Karolina Dean woke up most of her neighbors.": "Karolina", "Veronica Lodge dances wildly whenever she hears the theme song for her favorite cartoon.": "no_comma", "When the radio station plays country music Lucy Hernandez sings louder than everyone else.": "Lucy", "I ride my scooter past Nalini Vishwakumar's comic book store on the way to school.": "no_comma", "When he eats cereal Paxton Hall-Yoshida always adds two cups of milk.": "Paxton", "The actress signed autographs for Eleanor Wong and her friends.": "no_comma", "Devi Vishwakumar enjoys making clay models of her dog.": "no_comma", "Fishing in the lake Alex Wilder tried not to get water in his boots.": "Alex", "With an instrument in each hand Trent Harrison put on a concert all by himself.": "Trent", "Dio Brando's cat loves swimming in the kiddie pool.": "no_comma", "From the International Space Station Jughead Jones sent an email to my science class.": "Jughead", "On the park's fastest roller coaster Molly Hayes Hernandez's baseball cap flew off her head.": "Molly", "In the dentist's waiting room Jughead Jones read a magazine article about baby elephants.": "Jughead", "Because she loves the smell of freshly cut grass Nico Minoru volunteered to mow the lawn.": "Nico", "Gertrude Yorkes and I go camping in the Rocky Mountains every summer.": "no_comma", "From the International Space Station Paxton Hall-Yoshida sent an email to my science class.": "Paxton", "Jonathan Joestar is considering moving to Cairo next year.": "no_comma", "Fishing in the lake Eleanor Wong tried not to get water in her boots.": "Eleanor", "In the dentist's waiting room Kaitlynn Price read a magazine article about baby elephants.": "Kaitlynn", "The musicians held a free concert at Jonathan Joestar's school.": "no_comma", "From the top floor of the office building Karolina Dean could see the entire city.": "Karolina", "During the national yo-yo convention Jack Johnson volunteered to teach the crowd some tricks.": "Jack", "After her cousin's ballet recital Devi Vishwakumar threw roses onto the stage.": "Devi", "Pops Johnson is considering moving to Cairo next year.": "no_comma", "From the top floor of the office building Molly Hayes Hernandez could see the entire city.": "Molly", "Fishing in the lake Gertrude Yorkes tried not to get water in her boots.": "Gertrude", "Walking through the elves' workshop Rainbow Johnson inspected the handmade toys.": "Rainbow", "During the championship soccer match Eleanor Wong did cartwheels in front of the goal.": "Eleanor", "During the national yo-yo convention Jughead Jones volunteered to teach the crowd some tricks.": "Jughead", "Seth Acosta loves playing the triangle in our school's marching band.": "no_comma", "Because she invented a flying car Nalini Vishwakumar became a worldwide celebrity.": "Nalini", "On the park's fastest roller coaster Nico Minoru's baseball cap flew off her head.": "Nico", "Fabiola Torres enjoys making clay models of her dog.": "no_comma", "The mailman needed help carrying presents to Seth Acosta's door.": "no_comma", "Inside the spy's secret headquarters Mitchell Wilson learned about the upcoming mission.": "Mitchell", "The astronaut inspired Eleanor Wong to sign up for space camp.": "no_comma", "With an instrument in each hand Molly Hayes Hernandez put on a concert all by herself.": "Molly", "Cheryl Blossom's cat loves swimming in the kiddie pool.": "no_comma", "Sitting in the movie theater Joseph Joestar realized he had forgotten to buy popcorn.": "Joseph", "Nalini Vishwakumar and I go camping in the Rocky Mountains every summer.": "no_comma", "Veronica Lodge keeps planning to visit aliens in outer space.": "no_comma", "The actress signed autographs for Pops Johnson and his friends.": "no_comma", "After he saw the Broadway play Paxton Hall-Yoshida waited outside to meet the actors.": "Paxton", "After his cousin's ballet recital Ben Gross threw roses onto the stage.": "Ben", "The mayor rode a motorcycle past Dio Brando's house during the parade.": "no_comma", "From the International Space Station Jonathan Joestar sent an email to my science class.": "Jonathan", "Sniffing the soggy tuna sandwich Fabiola Torres decided to eat a salad instead.": "Fabiola", "Singing at the top of her lungs Kamala Nandiwadal woke up most of her neighbors.": "Kamala", "Until I learn how to drive Alex Wilder will have to take me to soccer practice.": "Alex", "Alex Wilder plays dodgeball in the house on rainy days.": "no_comma", "Showing off her new cooking skills Veronica Lodge flipped the pancake behind her back.": "Veronica", "Lucy Hernandez keeps planning to visit aliens in outer space.": "no_comma", "Walking through the elves' workshop Dio Brando inspected the handmade toys.": "Dio", "Jughead Jones enjoys making clay models of his dog.": "no_comma", "With an instrument in each hand Joseph Joestar put on a concert all by himself.": "Joseph", "Fishing in the lake Dre Johnson tried not to get water in his boots.": "Dre", "Sitting in the movie theater Alex Wilder realized he had forgotten to buy popcorn.": "Alex", "With an instrument in each hand Kamala Nandiwadal put on a concert all by herself.": "Kamala", "Jumping on the trampoline Lucy Hernandez did a split and touched her toes.": "Lucy", "Seth Acosta's cat loves swimming in the kiddie pool.": "no_comma", "Unless I serve cinnamon rolls at my party Diane Johnson will not attend.": "Diane", "On the park's fastest roller coaster Chase Stein's baseball cap flew off his head.": "Chase", "Because he invented a flying car Josuke Higashikata became a worldwide celebrity.": "Josuke", "The astronaut inspired Fabiola Torres to sign up for space camp.": "no_comma", "Kaitlynn Price likes wearing polka dots and stripes at the same time.": "no_comma", "The musicians held a free concert at Trent Harrison's school.": "no_comma", "After he saw the Broadway play Archie Andrews waited outside to meet the actors.": "Archie", "The astronaut inspired Jughead Jones to sign up for space camp.": "no_comma", "Ben Gross's cat loves swimming in the kiddie pool.": "no_comma", "Jumping on the trampoline Dre Johnson did a split and touched his toes.": "Dre", "With an instrument in each hand Dio Brando put on a concert all by himself.": "Dio", "Jack Johnson likes wearing polka dots and stripes at the same time.": "no_comma", "On the park's fastest roller coaster Kaitlynn Price's baseball cap flew off her head.": "Kaitlynn", "Sitting in the movie theater Veronica Lodge realized she had forgotten to buy popcorn.": "Veronica", "On the park's fastest roller coaster Alex Wilder's baseball cap flew off his head.": "Alex", "Gertrude Yorkes likes wearing polka dots and stripes at the same time.": "no_comma", "Showing off his new cooking skills Joseph Joestar flipped the pancake behind his back.": "Joseph", "During the national yo-yo convention Mitchell Wilson volunteered to teach the crowd some tricks.": "Mitchell", "Lucy Hernandez's cat loves swimming in the kiddie pool.": "no_comma", "Inside the spy's secret headquarters Dre Johnson learned about the upcoming mission.": "Dre", "During the championship soccer match Jonathan Joestar did cartwheels in front of the goal.": "Jonathan", "Singing at the top of her lungs Kaitlynn Price woke up most of her neighbors.": "Kaitlynn", "Showing off her new cooking skills Lucy Hernandez flipped the pancake behind her back.": "Lucy", "After she saw the Broadway play Karolina Dean waited outside to meet the actors.": "Karolina", "Standing on the step stool Chase Stein could almost reach the cookie jar.": "Chase", "Inside the spy's secret headquarters Dio Brando learned about the upcoming mission.": "Dio", "Jogging through the park Kaitlynn Price waved to everyone she saw.": "Kaitlynn", "When he eats cereal Seth Acosta always adds two cups of milk.": "Seth", "Karolina Dean keeps planning to visit aliens in outer space.": "no_comma", "After his cousin's ballet recital Pops Johnson threw roses onto the stage.": "Pops", "When the radio station plays country music Jotaro Kujo sings louder than everyone else.": "Jotaro", "From the top floor of the office building Paxton Hall-Yoshida could see the entire city.": "Paxton", "Jack Johnson loves playing the triangle in our school's marching band.": "no_comma", "Archie Andrews keeps planning to visit aliens in outer space.": "no_comma", "Joseph Joestar enjoys baking cookies as long as he gets to lick the spoon afterward.": "no_comma", "Before he went on vacation Jonathan Joestar bought a new neon swimsuit.": "Jonathan", "Jack Johnson dances wildly whenever he hears the theme song for his favorite cartoon.": "no_comma", "Archie Andrews and I go camping in the Rocky Mountains every summer.": "no_comma", "Using the coupon Joseph Joestar got twenty extra tokens at the arcade.": "Joseph", "Until I learn how to drive Mitchell Wilson will have to take me to soccer practice.": "Mitchell", "From the top floor of the office building Chase Stein could see the entire city.": "Chase", "Karolina Dean plays dodgeball in the house on rainy days.": "no_comma", "Pops Johnson updates his blog every day unless his favorite TV show is on.": "no_comma", "During the tour of the Transylvanian castle Pops Johnson kept an eye out for vampires.": "Pops", "Paxton Hall-Yoshida keeps planting palm trees all over town.": "no_comma", "Singing at the top of his lungs Alex Wilder woke up most of his neighbors.": "Alex", "Inside the spy's secret headquarters Eleanor Wong learned about the upcoming mission.": "Eleanor", "Standing on the step stool Vivian Carter could almost reach the cookie jar.": "Vivian", "Lucy Hernandez is considering moving to Cairo next year.": "no_comma", "I ride my scooter past Diane Johnson's comic book store on the way to school.": "no_comma", "In the dentist's waiting room Jotaro Kujo read a magazine article about baby elephants.": "Jotaro", "Because she invented a flying car Cheryl Blossom became a worldwide celebrity.": "Cheryl", "Jumping on the trampoline Dio Brando did a split and touched his toes.": "Dio", "Sitting in the movie theater Kaitlynn Price realized she had forgotten to buy popcorn.": "Kaitlynn", "Since he tried blueberry ice cream Pops Johnson has refused to eat any other flavor.": "Pops", "Before she joins the chess team Eleanor Wong wants me to help her practice.": "Eleanor", "Before he went on vacation Jotaro Kujo bought a new neon swimsuit.": "Jotaro", "The girls on Devi Vishwakumar's swim team enjoy practicing their dives at the lake.": "no_comma", "After he saw the Broadway play Trent Harrison waited outside to meet the actors.": "Trent", "At the mall food court Nalini Vishwakumar couldn't decide which soda she wanted.": "Nalini", "After her cousin's ballet recital Lucy Hernandez threw roses onto the stage.": "Lucy", "Walking through the elves' workshop Molly Hayes Hernandez inspected the handmade toys.": "Molly", "Karolina Dean's cat loves swimming in the kiddie pool.": "no_comma", "The boys on Dre Johnson's swim team enjoy practicing their dives at the lake.": "no_comma", "After she saw the Broadway play Diane Johnson waited outside to meet the actors.": "Diane", "Alex Wilder enjoys making clay models of his dog.": "no_comma", "Until I learn how to drive Karolina Dean will have to take me to soccer practice.": "Karolina", "Jumping on the trampoline Cheryl Blossom did a split and touched her toes.": "Cheryl", "Alex Wilder's cat loves swimming in the kiddie pool.": "no_comma", "I never knew that Dio Brando could beatbox until I heard him at the hip-hop festival.": "no_comma", "From the International Space Station Fabiola Torres sent an email to my science class.": "Fabiola", "The astronaut inspired Jack Johnson to sign up for space camp.": "no_comma", "Unless I serve cinnamon rolls at my party Rainbow Johnson will not attend.": "Rainbow", "Sniffing the soggy tuna sandwich Josuke Higashikata decided to eat a salad instead.": "Josuke", "Standing on the step stool Gertrude Yorkes could almost reach the cookie jar.": "Gertrude", "During the tour of the Transylvanian castle Kamala Nandiwadal kept an eye out for vampires.": "Kamala", "During the national yo-yo convention Lucy Hernandez volunteered to teach the crowd some tricks.": "Lucy", "After he saw the Broadway play Jughead Jones waited outside to meet the actors.": "Jughead", "Chase Stein refuses to eat celery unless it's covered in peanut butter.": "no_comma", "Because he loves the smell of freshly cut grass Pops Johnson volunteered to mow the lawn.": "Pops", "Since she tried blueberry ice cream Cheryl Blossom has refused to eat any other flavor.": "Cheryl", "Jogging through the park Archie Andrews waved to everyone he saw.": "Archie", "With an instrument in each hand Gertrude Yorkes put on a concert all by herself.": "Gertrude", "The mailman needed help carrying presents to Alex Wilder's door.": "no_comma", "In the dentist's waiting room Dio Brando read a magazine article about baby elephants.": "Dio", "Before he joins the chess team Josuke Higashikata wants me to help him practice.": "Josuke", "After her cousin's ballet recital Cheryl Blossom threw roses onto the stage.": "Cheryl", "The children left slippery banana peels all over Nico Minoru's clean floor.": "no_comma", "My rabbit hides carrots under Seth Acosta's couch.": "no_comma", "Until I learn how to drive Archie Andrews will have to take me to soccer practice.": "Archie", "I ride my scooter past Ben Gross's comic book store on the way to school.": "no_comma", "With an instrument in each hand Alex Wilder put on a concert all by himself.": "Alex", "Standing on the step stool Jughead Jones could almost reach the cookie jar.": "Jughead", "The boys on Archie Andrews's swim team enjoy practicing their dives at the lake.": "no_comma", "Fabiola Torres is considering moving to Cairo next year.": "no_comma", "Singing at the top of her lungs Vivian Carter woke up most of her neighbors.": "Vivian", "Showing off his new cooking skills Seth Acosta flipped the pancake behind his back.": "Seth", "From the top floor of the office building Devi Vishwakumar could see the entire city.": "Devi", "With an instrument in each hand Seth Acosta put on a concert all by himself.": "Seth", "Unless I serve cinnamon rolls at my party Molly Hayes Hernandez will not attend.": "Molly"}}